[
   {
      "author_association" : "NONE",
      "body" : "Hi, the command did take a while to return. Perhaps about 30 seconds. This is what I got,\r\n\r\n{\r\n  \"height\": 750848,\r\n  \"bestblock\": \"000000000000000000042bfa933012137be4426a545056c51d75f8358306f099\",\r\n  \"txouts\": 83853482,\r\n  \"bogosize\": 6255092170,\r\n  \"hash_serialized_2\": \"e8915ee90c5152753b10ab7e1b48d33f21d999a89668a3f5b948478b153ccff6\",\r\n  \"total_amount\": 19130092.17246361,\r\n  \"transactions\": 49927698,\r\n  \"disk_size\": 5119722459\r\n}\r\n\r\nWhat version are you running? \r\nI'm on Bitcoin Core RPC client version v23.99.0-b1a2021f7809-dirty",
      "created_at" : "2022-08-24T03:31:53Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1225138581",
      "id" : 1225138581,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JBiGV",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1225138581/reactions"
      },
      "updated_at" : "2022-08-24T03:32:38Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1225138581",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/111384550?v=4",
         "events_url" : "https://api.github.com/users/ZaidanK/events{/privacy}",
         "followers_url" : "https://api.github.com/users/ZaidanK/followers",
         "following_url" : "https://api.github.com/users/ZaidanK/following{/other_user}",
         "gists_url" : "https://api.github.com/users/ZaidanK/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/ZaidanK",
         "id" : 111384550,
         "login" : "ZaidanK",
         "node_id" : "U_kgDOBqOX5g",
         "organizations_url" : "https://api.github.com/users/ZaidanK/orgs",
         "received_events_url" : "https://api.github.com/users/ZaidanK/received_events",
         "repos_url" : "https://api.github.com/users/ZaidanK/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/ZaidanK/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/ZaidanK/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/ZaidanK"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "I'm using the same version as you. It was compiled from the current develomment branch in this Git repository.\r\nCompiled with debug (-g) and with -DDEBUG_LOCKCONTENTION (as instructed by other developers because I submitted several other issues) here.\r\n\r\nThe node is fully synchronized, running as a full node.\r\n\r\nRunning on standard Debian Bullseye, in a VM with 8 CPU cores (Intel Core i9), 32GB RAM, and a dedicated physical storage volume for Bitcoin data, over a fast and reliable RAID5 array (on 6 physical disks), with 1TB allocated only for this volume (there's a separate volume for the rest of the system or /home, all Bitcion data goes into its own mounted partition, optimized for perfomance with 64KB clusters).\r\n\r\nI can reproduce it on my local PC, or when using a VM hosted Azure or AWS. So I know that it is not a hardware issue. I have the same issue when running on a cheaper personal notebook (with a SSD), where Debian is installed with a basic desktop environment.\r\n\r\nIt has both connectivity over IPv4 and IPv6 (but I don't use Tor) and accepts incoming connections from peers on the Internet.\r\n\r\n[That VM only runs the kernel (init), and a single user logged in running two bash sessions, one for running bitcoin dameon (via `gdb --args bitcoind -printtoconsole`), the other one for looking at what is happening (with \"htop\" to see active processes and threads, or to run 'bitcoin-cli' commands. [I use the \"-printtoconsole\" option just to have a direct view of logs, without having to use some \"tail -f debug.log\" in another console; but the main reason is that there are some other outputs on stderr which are not written in \"debug.log\", coming from some dependant libraries, noably from MiniUPNPC which is used in its own thread, so I can see these messages synchronized with other logs. I've not disabled UPNP with the \"pnp=0\" option; it has no effect on my network, as UPNP is not enabled on the router which is just configured with a single port forwarding for accepting incoming connections on TCP port 8333 with IPv4 or IPv6; I've disabled Tor, so \"listenonion=0\" is set in bitcoin.conf, as well there's no option to enable I2P; the RPC service is configured to allow onlyconnections using cookie authentication, and it only accepts local connections, with the \"whitelist=127.0.0.1/32\" option, and only from the same local Linux user, where this \"rpc.cookie\" file is accessible and not readable by any other Linux user (except \"root\") than the one used to run bitcoind or gdb.]\r\n\r\nI run bitcoind through gdb, only to be able to pause it an inspect what is happening and get stack traces if needed). But the same occurs when letting it run outside gdb (then I can use the released version 23.0, or a compiled version 23.99 without debug (-g). Note that I cannot \"attach\" gdb to an already running bitcoind, sur to security restrictions (\"ptrace\" is not permitted across sessions with different controling terminals or different parent processes, this is enforced by the kernel with its standard security settings, so gdb must be attached as the parent process and must run bitcoind itself; I will never run any Internet-connected program accepting incoming connections over any Linux where such restrictions on ptrace are not enforced by the kernel, at least with the \"yama\" security model or with the \"SELinux\" model; a strenghened kernel is mandatory for running any VM in AWS and Azure when not running any Linux VM on costly dedicated hardware, but on shared hosts where you cannot run custom kernels, but only supported kernels: I use the standard (securely signed) Debian Bullseye kernel proposed and supported by these cloud-hosting providers.\r\n\r\nI also know now (see other bug reports) that one \"bitcoin.conf\" option (checkblockindex=1) has an issue and is not thread-safe, so I've disabled it (that bug was signaled by another user in 2019). That option is disabled by default in the release, but while searching for other bugs, I had activated it, but this causes the RPC service to hang as well.\r\n\r\nI know that `bitcoin-cli gettxoutsetinfo` can take a while, but according to what is logged, the deamon just takes about 40 ms to complete the flush, but then hangs but then enters in a tight loop that never ends after more than 1 hour, and never replies to the bitcoin-cli client.\r\n",
      "created_at" : "2022-08-24T04:26:39Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1225174876",
      "id" : 1225174876,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JBq9c",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1225174876/reactions"
      },
      "updated_at" : "2022-08-24T05:23:30Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1225174876",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/1387035?v=4",
         "events_url" : "https://api.github.com/users/verdy-p/events{/privacy}",
         "followers_url" : "https://api.github.com/users/verdy-p/followers",
         "following_url" : "https://api.github.com/users/verdy-p/following{/other_user}",
         "gists_url" : "https://api.github.com/users/verdy-p/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/verdy-p",
         "id" : 1387035,
         "login" : "verdy-p",
         "node_id" : "MDQ6VXNlcjEzODcwMzU=",
         "organizations_url" : "https://api.github.com/users/verdy-p/orgs",
         "received_events_url" : "https://api.github.com/users/verdy-p/received_events",
         "repos_url" : "https://api.github.com/users/verdy-p/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/verdy-p/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/verdy-p/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/verdy-p"
      }
   },
   {
      "author_association" : "MEMBER",
      "body" : "Can you attach gdb when this deadlock happens and let us know where exactly the http thread is stuck?",
      "created_at" : "2022-08-24T05:44:42Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1225224100",
      "id" : 1225224100,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JB2-k",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1225224100/reactions"
      },
      "updated_at" : "2022-08-24T05:44:42Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1225224100",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/6399679?v=4",
         "events_url" : "https://api.github.com/users/MarcoFalke/events{/privacy}",
         "followers_url" : "https://api.github.com/users/MarcoFalke/followers",
         "following_url" : "https://api.github.com/users/MarcoFalke/following{/other_user}",
         "gists_url" : "https://api.github.com/users/MarcoFalke/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/MarcoFalke",
         "id" : 6399679,
         "login" : "MarcoFalke",
         "node_id" : "MDQ6VXNlcjYzOTk2Nzk=",
         "organizations_url" : "https://api.github.com/users/MarcoFalke/orgs",
         "received_events_url" : "https://api.github.com/users/MarcoFalke/received_events",
         "repos_url" : "https://api.github.com/users/MarcoFalke/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/MarcoFalke/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/MarcoFalke/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/MarcoFalke"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "I'm setting up an environment for testing this out right now. @verdy-p, Would you please make your bitcoin.conf available. Do you have the same problems on testnet as well?\r\n\r\nYou configure command looks like\r\n`configure -g -DDEBUG_LOCKCONTENTION`\r\ncorrect?\r\n\r\nedit: Apologies,\r\nI got the following to work\r\n`configure CXXFLAGS='-O0 -g -DDEBUG_CONTENTION'`",
      "created_at" : "2022-08-24T22:57:59Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1226569778",
      "id" : 1226569778,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JG_gy",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1226569778/reactions"
      },
      "updated_at" : "2022-08-24T23:58:40Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1226569778",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/111384550?v=4",
         "events_url" : "https://api.github.com/users/ZaidanK/events{/privacy}",
         "followers_url" : "https://api.github.com/users/ZaidanK/followers",
         "following_url" : "https://api.github.com/users/ZaidanK/following{/other_user}",
         "gists_url" : "https://api.github.com/users/ZaidanK/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/ZaidanK",
         "id" : 111384550,
         "login" : "ZaidanK",
         "node_id" : "U_kgDOBqOX5g",
         "organizations_url" : "https://api.github.com/users/ZaidanK/orgs",
         "received_events_url" : "https://api.github.com/users/ZaidanK/received_events",
         "repos_url" : "https://api.github.com/users/ZaidanK/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/ZaidanK/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/ZaidanK/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/ZaidanK"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "I don't use testnet, jsut the regular chain, because I don't need to send any transaction on it or create blocks, and I'm not mining The regular chani contains all interesting features, is highly active, has many peers (using various software implementations). And bugs are occuring with this variety.\r\n\r\nNote: I created a dedicated storage volume only for Bitcoin data (blocks, chainstate, indexes, pluis de debug.log file), separated from the system files, home directory and /usr/local/ directories where the compiled software will be installed and running. This volume also contains some regular copies of the \"chainstate\" and \"indexes\" (4 indexes are enabled), just to avoid having to reindex everything after a crash, or to perform a new test, so I dimensionned to to 800 GiB in my Debian VM (currently about 450 GiB for blocks for a full node, add the chainstate, indexes, and their backups, it remains about 150GB free on that volume).\r\n\r\nThe interesting thing is that you need to have more indexes enabled (txindex, coinstat, blockfilter). It seems that this bug mostly affects the coinstat index when the main chainstate is fully synced and no longer in IBD). But it you start bitcoind from scratch (not any block or index) with the 4 indexed enabled, you'll see it hand extremely rapidly (in less than 10 minutes), if you run with at least 8 CPU cores in your VM (so that threads may effectively run concurrently peer connections).\r\n\r\nYou can even hang it very rapidly by just using \"bitcoin-cli -getinfo\" repeatedly to run RPC requests (which will consume an http thread to consult the progress of the chainstate): it should not crash/hang the RPC service, but it does.\r\n\r\nNote that initially I had also enabled \"checkmempool=1\" and \"checkchainstate=1\" (but now I know that the 2nd one has a problem and generates a deadlock, so I've disabled it, and there's still a problem).\r\n\r\nOn Windows, you don't need to configure anything: the default settings will make both the Qt version or the daemon version (running on a CMD console) hang the same way (as long as you've 8 CPU cores enabled); I could also get this hang with a lower number of CPU (you can use the Task manager to reduce the \"CPU affinity\" to reduce the number of cores you want for bitcoind; if running Windows in a VM, just configure the number of cores in your favorite hypervisor, it could be Hyper-V, Proxmox, or the internal hypervisors manage by AWS or Azure on their cloud; I did not test it with basic Qemu over Debian, or with Oracle Virtual Box; Proxmox however can only run on bare metal and won't let you run GUI apps easily without complex configuration, but it is fine as is for testing the deamon version, running in a \"Windows Core\" server installation). I thnik that one Windows such deadlocks are more likely, because Windows uses much lighter threads in its scheduler, whereas Linux uses \"lighweight processes\" (LWP) to support the POSIX thread library, with some additional containment, and transitions between threads in Linux have a higher cost than on Windows, and mutexes on Windows are more \"reactive\" than on Linux.\r\n\r\nAlso I noted that bitcoind does not manage any priority between its threads, so threads are woken up in random order (in Windows like on Linux). And there's not even any code in bitcoind to insert randomized delays after releasing a mutex: the message manager is using mutexes in a too much agressive, it is awoken much too often, more than necessary, and it it acquires a lock on the main mutex, it may hold it most of the time, or will \"steal\" it easily from other threads, that will have to pause and will have difficulties to be woken up: these waiting threads may still have another lock on another mutex, creating the deadlock if other threads need it but then need to acquire the global mutex.\r\n\r\nNote also that I run with \"upnp=1\" enabled, but as long as UPnP is not enabled on the network side, it should be safe beacuse it should not acquire the lock on the list of peers (also used by the address manager to perform new outgoing connections, or when accepting list of peer addresses from any peer). It is possible that the deadlock occurs when the address manager acquires the lock on the address list, while it is still holding the global mutex on the chainstate in the same thread, this could be caused by the address manager being needed but the validator currently processing blocks, but needing another outgoing connection, if existing peers are not replying to a request, e.g. for new incoming blocks).\r\n\r\nSo studying the lock contention (notably when there are different mutexes acquired in different orders) may reveal the deadlock problem.\r\n\r\nAnother thing I do not understand is why there is a so small static number (4) of \"httpworker\" threads for RPC. RPC is supposed to be used locally at low frequency (not from remotes) and could be created dynamically (and then deleted, we can just keep one running permanently in a thread pool, and just fix a large but sufficient maximum, even up to 256, may be more, like on usual webservers, even if it exceeds the number of available CPU cores). Being able to tune the number of worker threads for each kind of thread would also allow interesting similations for testing bitcoind (notably for lock contention) and for adapting bitcoind on more environments, with better scalability (e.g. not running on desktop or notebook PCs, but on large servers with many cores and lot of memory, or running on small appliances and mobiles probably but not as a \"full node\" as this requires too much local storage).\r\n\r\nThe RPC listener should also be running much earlier in the init sequence (for example we should be able to use \"bitcoin-cli logging '[]' '[]'\" or the RPC request to suspend network activity, or to \"stop\" the daemon immediately (creating an \"httpworker\" if needed, even if the 4 existing ones are busy) even if some RPC requests (about the state of the chainstate, or the wallet as long as it is not loaded) are still not fully avaible and should return their existing initialization status by returning immediately a suitable error.\r\n\r\nThen adding an RPC to control thread pool sizes, or CPU affinity, could also allow performing lot of simulations for \"fuzz\" tests (some tests will require a host with at least 8 cores to be able to run the simulation).\r\n\r\nFinally I suggest that the Bitcoin documentation allows any RPC request to send \"HTTP 100 Continue\" status, which should be required if the execution of the RPC runs for more than 5 seconds: RPC clients should receive these notifications, containing also some informative status (as a JSON object) of what is happening and how these requests are progressing, for example the length of their work queue such as the range (minimum/maximum) height to handle, the number of transactions to do, and some counters, and a the same time should see if they were instructed to bail out, or if the RPC client has already been disconnected or has been interrupted and will no longer receive any reply. It's not reasonnable for any RPC thread to take several minutes (e.g. \"gettxoutsetinfo\"), or may be hours to complete, without knowing anything about what it is doing (we shuold not need to run the daemon inside a debugger and send a SIGINT signal to suspend the whole process, just to inspect the thread stacks with debugger commands, or by using some other \"strace\" tool on Linux, which does not always work in all environment where it is restricted by basic kernel security).\r\n",
      "created_at" : "2022-08-25T11:10:02Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1227115836",
      "id" : 1227115836,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JJE08",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1227115836/reactions"
      },
      "updated_at" : "2022-08-25T12:03:05Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1227115836",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/1387035?v=4",
         "events_url" : "https://api.github.com/users/verdy-p/events{/privacy}",
         "followers_url" : "https://api.github.com/users/verdy-p/followers",
         "following_url" : "https://api.github.com/users/verdy-p/following{/other_user}",
         "gists_url" : "https://api.github.com/users/verdy-p/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/verdy-p",
         "id" : 1387035,
         "login" : "verdy-p",
         "node_id" : "MDQ6VXNlcjEzODcwMzU=",
         "organizations_url" : "https://api.github.com/users/verdy-p/orgs",
         "received_events_url" : "https://api.github.com/users/verdy-p/received_events",
         "repos_url" : "https://api.github.com/users/verdy-p/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/verdy-p/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/verdy-p/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/verdy-p"
      }
   },
   {
      "author_association" : "MEMBER",
      "body" : "I assume what's happening here is that `bitcoind` takes longer to compute the gettxoutsetinfo result than `bitcoin-cli` is willing to wait. You may want to increase the rpcclienttimeout option (the default is 15 minutes).",
      "created_at" : "2022-08-25T12:18:57Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1227181536",
      "id" : 1227181536,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JJU3g",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1227181536/reactions"
      },
      "updated_at" : "2022-08-25T12:18:57Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1227181536",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/548488?v=4",
         "events_url" : "https://api.github.com/users/sipa/events{/privacy}",
         "followers_url" : "https://api.github.com/users/sipa/followers",
         "following_url" : "https://api.github.com/users/sipa/following{/other_user}",
         "gists_url" : "https://api.github.com/users/sipa/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/sipa",
         "id" : 548488,
         "login" : "sipa",
         "node_id" : "MDQ6VXNlcjU0ODQ4OA==",
         "organizations_url" : "https://api.github.com/users/sipa/orgs",
         "received_events_url" : "https://api.github.com/users/sipa/received_events",
         "repos_url" : "https://api.github.com/users/sipa/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/sipa/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/sipa/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/sipa"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "I will also enable the \"-DDEBUG_LOCKORDER\" option (see \"src/sync.h\", \"src/sync.cpp\", also \"test/sync_tests.cpp\", \"test/reverselock_tests.cpp\") when compiling with \"-g\" and see what is happening when running in \"gdb\". The option \"-DDEBUG_LOCKCONTENTION\" does not seem sufficient.\r\n",
      "created_at" : "2022-08-25T12:23:50Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1227186992",
      "id" : 1227186992,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JJWMw",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1227186992/reactions"
      },
      "updated_at" : "2022-08-25T12:45:39Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1227186992",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/1387035?v=4",
         "events_url" : "https://api.github.com/users/verdy-p/events{/privacy}",
         "followers_url" : "https://api.github.com/users/verdy-p/followers",
         "following_url" : "https://api.github.com/users/verdy-p/following{/other_user}",
         "gists_url" : "https://api.github.com/users/verdy-p/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/verdy-p",
         "id" : 1387035,
         "login" : "verdy-p",
         "node_id" : "MDQ6VXNlcjEzODcwMzU=",
         "organizations_url" : "https://api.github.com/users/verdy-p/orgs",
         "received_events_url" : "https://api.github.com/users/verdy-p/received_events",
         "repos_url" : "https://api.github.com/users/verdy-p/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/verdy-p/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/verdy-p/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/verdy-p"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "Hi Verdy,\r\n\r\nSo some of the options you have set are\r\n\r\nchain=main\r\ncheckmempool=1\r\ncheckchainstate=1\r\ntxindex=1\r\ncoinstat=1\r\nblockfilter=1\r\n\r\nis that correct?\r\n\r\nMaking your bitcoin.conf available would be greatly appreciated. \r\n\r\nTo understand this problem better, I'm assuming gettxoutsetinfo is near-consistent across all nodes? With gettxoutsetinfo returning data on the txoutset and mempool (as an implicit txoutset) Could anyone clarify? \r\n\r\n",
      "created_at" : "2022-08-25T16:35:31Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1227507342",
      "id" : 1227507342,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JKkaO",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1227507342/reactions"
      },
      "updated_at" : "2022-08-25T16:38:11Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1227507342",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/111384550?v=4",
         "events_url" : "https://api.github.com/users/ZaidanK/events{/privacy}",
         "followers_url" : "https://api.github.com/users/ZaidanK/followers",
         "following_url" : "https://api.github.com/users/ZaidanK/following{/other_user}",
         "gists_url" : "https://api.github.com/users/ZaidanK/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/ZaidanK",
         "id" : 111384550,
         "login" : "ZaidanK",
         "node_id" : "U_kgDOBqOX5g",
         "organizations_url" : "https://api.github.com/users/ZaidanK/orgs",
         "received_events_url" : "https://api.github.com/users/ZaidanK/received_events",
         "repos_url" : "https://api.github.com/users/ZaidanK/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/ZaidanK/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/ZaidanK/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/ZaidanK"
      }
   },
   {
      "author_association" : "MEMBER",
      "body" : "I'd say this is just a duplicate of #25897",
      "created_at" : "2022-08-26T07:10:33Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1228136333",
      "id" : 1228136333,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JM9-N",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1228136333/reactions"
      },
      "updated_at" : "2022-08-26T07:10:33Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1228136333",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/6399679?v=4",
         "events_url" : "https://api.github.com/users/MarcoFalke/events{/privacy}",
         "followers_url" : "https://api.github.com/users/MarcoFalke/followers",
         "following_url" : "https://api.github.com/users/MarcoFalke/following{/other_user}",
         "gists_url" : "https://api.github.com/users/MarcoFalke/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/MarcoFalke",
         "id" : 6399679,
         "login" : "MarcoFalke",
         "node_id" : "MDQ6VXNlcjYzOTk2Nzk=",
         "organizations_url" : "https://api.github.com/users/MarcoFalke/orgs",
         "received_events_url" : "https://api.github.com/users/MarcoFalke/received_events",
         "repos_url" : "https://api.github.com/users/MarcoFalke/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/MarcoFalke/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/MarcoFalke/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/MarcoFalke"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "Most of them are defaults, just commented for completeness.\r\n\r\nI play with debug options, also now with compile options (-DDEBUG_LOCKCONTENTION, and recently -DDEBUG_LOCKORDER)\r\n(both used in Debian Bullseye or Windows 11)\r\n\r\nInitially on my first installation on Windows, I did not configure anything and used the default with the released versions v22 and v23 (initially with Qt, but as it did not work, I used bitcoind from the commandline).\r\n\r\nThat is because I did not find any way to let it run that I started to look at these options and look at what were there default settings.\r\n\r\nI had also tried to set the \"alert_*\" options, trying to spawn an external command to trace something else in an aditional log file), but this was not the cause (those alerts were never launched, but I still had the same issues with bitcoin core hanging), so I have disabled them again. That's when I decided to run it on Linux, and also tried to run it on another machine (fiest on a NUC running ProxMox to excute a Linux Debian VM, then on AWS, and Azure, where I still had the same hanging issues).\r\n\r\n```\r\n# Options de l'IU:\r\n#\r\nlang=fr_FR              # Définir la langue, par exemple « fr_CA » (par défaut: la langue du système)\r\nresetguisettings=0      # Réinitialiser tous les paramètres changés dans l'IU\r\nmin=0                   # Démarrer minimisé\r\nsplash=1                # Afficher l'écran d'accueil au démarrage (par défaut: 1)\r\n\r\n# Options de sélection de chaine:\r\n#\r\ntestnet=0               # Utiliser la chaine test\r\n\r\n# Options générales:\r\n#\r\n#rootcertificates=-system-      # Définir les certificats SSL racine pour les requêtes de paiement (par défaut: -system-)\r\n#choosedatadir=0                # Choisir un répertoire de données au démarrage (par défaut: 0)\r\ndatadir=/mnt/g/bitcoin          # Spécifier le répertoire de données\r\nconf=bitcoin.conf               # Spécifier le fichier de configuration (par défaut: bitcoin.conf)\r\ndbcache=450                     # Définir la taille du cache de la base de données en MiB (4 à 16384, par défaut: 300)\r\nmaxmempool=300                  # Garder la réserve de mémoire transactionnelle sous n MiB (par défaut: 300)\r\nmaxsigcachesize=64              # MiB\r\ndblogsize=4                     # Flush wallet database activity from memory to disk log every n megabytes (default: 100)\r\ncheckblocks=6                   # Nombre de blocs à vérifier au démarrage (par défaut: 6, 0=tous)\r\nchecklevel=4                    # Degré de profondeur de la vérification des blocs -checkblocks (0-4, par défaut: 3)\r\ncheckblockindex=0               # Flag\r\nreindex=0                       # Reconstruire l'état de la chaîne et l'index des blocs à partir des fichiers blk*.dat sur le disque\r\nreindex-chainstate=0            # Reconstruire l'état de la chaîne à partir des blocs indexés actuellement\r\n#prune=550                      # Réduire les exigences de stockage en élaguant (supprimant) les anciens blocs. Ce mode est incompatible avec -txindex et -rescan. Avertissement: ramener ce paramètre à sa va\r\nleur antérieure exige un nouveau téléchargement de la chaîne de blocs en entier (par défaut: 0=désactiver l'élagage des blocs, 550=taille cible en Mio à utiliser pour les fichiers de blocs).\r\ntxindex=0                       # Maintenir un index complet des transactions, utilisé par l'appel RPC getrawtransaction (obtenir la transaction brute) (par défaut: 0)\r\nblockfilterindex=1              # flag\r\ncoinstatsindex=1                # flag\r\npeerblockfilters=1              # flag\r\npeerbloomfilters=1              # Prendre en charge le filtrage des blocs et des transactions avec les filtres bloom (par défaut: 1)\r\ncheckmempool=1                  # Flag\r\nmempoolexpiry=72                # Ne pas conserver de transactions dans la réserve de mémoire plus de n heures (par défaut: 72)\r\npersistmempool=1                # Flag\r\nmaxorphantx=100                 # Garder au plus n transactions non connectables en mémoire (par défaut: 100)\r\npar=0                           # Définir le nombre de fils de vérification des scripts (-4 à 16, 0=autant que de cœurs, -4 à -1=laisser ce nombre de cœurs inutilisés, par défaut: 0)\r\n# Exécuter la commande lorsque le meilleur bloc change (%s dans cmd est remplacé par le hachage du bloc)\r\n#blocknotify=\"G:\\Bitcoin\\alert.cmd\" Notif: %s\r\n# Exécuter une commande lorsqu'une alerte pertinente est reçue, ou si nous voyons une bifurcation vraiment étendue (%s dans la commande est remplacé par le message)\r\n#alertnotify=\"G:\\Bitcoin\\alert.cmd\" Alert: %s\r\n\r\n# Options du serveur RPC:\r\n#\r\nrpcthreads=4                    # Définir le nombre de fils pour les appels RPC (par défaut: 4)\r\nserver=1                        # Accepter les commandes JSON-RPC et en ligne de commande\r\nrest=0                          # Accepter les demandes HTTP REST publiques (par défaut: 0)\r\nrpcserialversion=1              # Sets the serialization of raw transaction or block hex returned in non-verbose mode, non-segwit(0) or segwit(1) (par défaut: 1)\r\nrpccookiefile=rpc.cookie        # Emplacement du fichier témoin auth (par défaut: data dir)\r\nrpcbind=127.0.0.1               # Se lier à l'adresse donnée pour écouter des connexions JSON-RPC. Utiliser la notation [host]:port pour l'IPv6. Cette option peut être spécifiée plusieurs fois (par défaut:\r\nse lier à toutes les interfaces)\r\nrpcport=8332                    # Écouter les connexions JSON-RPC sur port (par défaut: 8332 ou tesnet: 18332)\r\nrpcallowip=127.0.0.1            # Permettre les connexions JSON-RPC de sources spécifiques. Valide pour ip qui sont une IP simple (p. ex. 1.2.3.4), un réseau/masque réseau (p. ex. 1.2.3.4/255.255.255.0) ou\r\nun réseau/CIDR (p. ex. 1.2.3.4/24). Cette option peut être spécifiée plusieurs fois\r\n#rpcuser=pve                    # Nom d'utilisateur pour les connexions JSON-RPC\r\n# Mot de passe pour les connexions JSON-RPC\r\n#rpcpassword=btc\r\n# Nom d'utilisateur et mot de passe haché pour les connexions JSON-RPC. Le champ userpw vient au format: USERNAME:SALT$HASH. Un script python canonique est inclus dans share/rpcuser. Cette option peut être\r\nspécifiée plusieurs fois.\r\n#rpcauth=pve:SALT$btc\r\n\r\n# Options de création de blocs:\r\n#\r\n#blockmaxweight=3000000         # Définir le poids maximal de bloc BIP141 (par défaut: 3000000)\r\n#blockmaxsize=750000            # Définir la taille minimale de bloc en octets (par défaut: 750000)\r\n#blockprioritysize=0            # Définir la taille maximale en octets des transactions à priorité élevée et frais modiques (par défaut: 0)\r\n#blockreconstructionextratxn=100        #\r\n\r\n# Options de relais du nœud:\r\n#\r\n#bytespersigop=20       # Octets équivalents par sigop dans les transactions pour relayer et miner (par défaut: 20)\r\n#datacarrier=1          # Relayer et miner les transactions du porteur de données (par défaut: 1)\r\n#datacarriersize=83     # Quantité maximale de données dans les transactions du porteur de données que nous relayons et minons (par défaut: 83)\r\n#permitbaremultisig=1   # Relayer les multisignatures non-P2SH (par défaut: 1)\r\nwhitelistrelay=1        # Accepter les transactions relayées reçues de pairs de la liste blanche même si le nœud ne relaie pas les transactions (par défaut: 1)\r\n#whitelistforcerelay=1  # Force relay of transactions from whitelisted peers even if they violate local relay policy (par défaut: 1)\r\n\r\n# Options de connexion:\r\n#\r\ndiscover=1                      # Découvrir ses propres adresses (par défaut: 1 en écoute et sans externalip ou -proxy)\r\nupnp=1                          # Utiliser UPnP pour mapper le port d'écoute (par défaut: 0)\r\nnatpmp=0                        # Utiliser NAT-PMP pour mapper le port d'écoute (par défaut: 0)\r\n#externalip=ip                  # Spécifier votre propre adresse publique\r\n#bind=ip:port                   # Se lier à l'adresse donnée et toujours l'écouter. Utiliser la notation [host]:port pour l'IPv6\r\nport=8333                       # Écouter les connexions sur port (par défaut: 8333 ou tesnet: 18333)\r\n#proxy=ip:port                  # Se connecter par un mandataire SOCKS5\r\n#proxyrandomize=1               # Aléer les authentifiants pour chaque connexion mandataire. Cela active l'isolement de flux de Tor (par défaut: 1)\r\nlisten=1                        # Accepter les connexions entrantes (par défaut: 1 si aucun -proxy ou -connect)\r\ncheckaddrman=0                  # Flag\r\ndnsseed=1                       # Demander les adresses des pairs par recherche DNS si l'on manque d'adresses (par défaut: 1 sauf si -connect)\r\nforcednsseed=0                  # Toujours demander les adresses des pairs par recherche DNS (par défaut: 0)\r\ndns=0                           # Autoriser les recherches DNS pour -addnode, -seednode et -connect (par défaut: 1)\r\n#onlynet=IPV4                   # Seulement se connecter aux nœuds du réseau net (IPv4, IPv6 ou oignon)\r\n#seednode=1.2.3.4               # Se connecter à un nœud pour obtenir des adresses de pairs puis se déconnecter\r\n#connect=104.248.143.83:8333    # Ne se connecter qu'au(x) nœud(s) spécifié(s)\r\n#addnode=1.2.3.4                # Ajouter un nœud auquel se connecter et tenter de garder la connexion ouverte\r\n#asmap=ip_asn.map\r\nlistenonion=0                   # Créer automatiquement un service caché Tor (par défaut: 1)\r\n#onion=ip:port                  # Utiliser un serveur mandataire SOCKS5 séparé pour atteindre les pairs par les services cachés de Tor (par défaut: -proxy)\r\n#torcontrol=127.0.0.1:9051      # Port de contrôle Tor à utiliser si l'écoute onion est activée (par défaut:127.0.0.1:9051)\r\n#torpassword=                   # Mot de passe du port de contrôle Tor (par défaut: vide)\r\nmaxconnections=125              # Garder au plus n connexions avec les pairs (par défaut: 125)\r\n#maxuploadtarget=               # Tente de garder le trafic sortant sous la cible donnée (en Mio par 24 h), 0=sans limite (par défaut: 0)\r\n#maxreceivebuffer=5000          # Tampon maximal de réception par connexion, n*1000 octets (par défaut: 5000)\r\n#maxsendbuffer=1000             # Tampon maximal d'envoi par connexion, n*1000 octets (par défaut: 1000)\r\n#maxtimeadjustment=4200         # Réglage moyen maximal autorisé de décalage de l'heure d'un pair. La perspective locale du temps peut être influencée par les pairs, en avance ou en retard, de cette valeur.\r\n (Par défaut: 4200 secondes)\r\n#timeout=5000                   # Spécifier le délai d'expiration de la connexion en millisecondes (minimum: 1, par défaut: 5000)\r\n#whitebind=addr                 # Se lier à l'adresse donnée et aux pairs s'y connectant. Utiliser la notation [host]:port pour l'IPv6\r\nwhitelist=127.0.0.1/32          # Whitelist peers connecting from the given IP address (e.g. 1.2.3.4) or CIDR notated network (e.g. 1.2.3.0/24). Can be specified multiple times. Les pairs de la liste blanch\r\ne ne peuvent pas être bannis DoS et leurs transactions sont toujours relayées, même si elles sont déjà dans le mempool, utile p. ex. pour une passerelle\r\nwhitelist=[::1]/128             # Whitelist peers connecting from the given IP address (e.g. 1.2.3.4) or CIDR notated network (e.g. 1.2.3.0/24). Can be specified multiple times. Les pairs de la liste blanch\r\ne ne peuvent pas être bannis DoS et leurs transactions sont toujours relayées, même si elles sont déjà dans le mempool, utile p. ex. pour une passerelle\r\nbantime=3600                    # Délai en secondes de refus de reconnexion pour les pairs présentant un mauvais comportement (par défaut: 86400 pour 24 heures)\r\n\r\n# Options du porte-monnaie:\r\n#\r\n#disablewallet=1                # Ne pas charger le porte-monnaie et désactiver les appels RPC\r\n#wallet=G:\\Bitcoin\\Perso        # Spécifiez le répertoire des fichiers (wallet.dat et wallet.log) de porte-monnaie (dans le répertoire de données) (par défaut: aucun)\r\nflushwallet=1                   # flag\r\n#zapwallettxes=0                # Supprimer toutes les transactions du porte-monnaie et ne récupérer que ces parties de la chaîne de blocs avec -rescan au démarrage (1=conserver les métadonnées de transmiss\r\nion, p. ex. les informations du propriétaire du compte et de demande de paiement, 2=abandonner les métadonnées de transmission)\r\n#walletbroadcast=1              # Obliger le porte-monnaie à diffuser les transactions (par défaut: 1)\r\n#spendzeroconfchange=1          # Dépenser la monnaie non confirmée lors de l'envoi de transactions (par défaut: 1)\r\n#keypool=100                    # Définir la taille de la réserve de clés à n (par défaut: 100)\r\n#fallbackfee=0.0002             # Un taux de frais (en BTC/Ko) qui sera utilisé si l'estimation de frais ne possède pas suffisamment de données (par défaut: 0.0002)\r\n#mintxfee=0.00001               # Les frais (en BTC/Ko) inférieurs à ce seuil sont considérés comme étant nuls pour la création de transactions (par défaut: 0.00001)\r\n#paytxfee=0.00001               # Les frais (en BTC/ko) à ajouter aux transactions que vous envoyez (par défaut: 0.00001)\r\n#txconfirmtarget=2              # Si paytxfee n'est pas défini, inclure suffisamment de frais afin que les transactions commencent la confirmation en moyenne avant n blocs (par défaut: 2)\r\n#walletnotify=cmd               # Exécuter la commande lorsqu'une transaction de porte-monnaie change (%s dans la commande est remplacée par TxID)\r\n\r\n# Options de débogage/de test:\r\n#\r\n#uacomment=cmt                  # Ajouter un commentaire à la chaîne d'agent utilisateur\r\nlogips=1                        # Inclure les adresses IP à la sortie de débogage (par défaut: 0)\r\nlogtimestamps=1                 # Ajouter l'horodatage au début de la sortie de débogage (par défaut: 1)\r\nlogtimemicros=1                 # Add microsecond precision to debug timestamps (default: 0)\r\nlogsourcelocations=1            # Prepend debug output with name of the originating source location (source file, line number and function name) (default: 0)\r\nlogthreadnames=1                # Prepend debug output with name of the originating thread (only available on platforms supporting thread_local) (default: 1)\r\n#minrelaytxfee=0.00001          # Les frais (en BTC/Ko) inférieurs à ce seuil sont considérés comme étant nuls pour le relais, le minage et la création de transactions (par défaut: 0.00001)\r\n#maxtxfee=0.10                  # Frais totaux maximaux (en BTC) à utiliser en une seule transaction de porte-monnaie ou transaction brute ; les définir trop bas pourrait interrompre les grosses transaction\r\ns (par défaut: 0.10)\r\nprinttoconsole=0                # Envoyer les infos de débogage/trace à la console au lieu du fichier debug.log\r\nshrinkdebugfile=0               # Réduire le fichier debug.log lors du démarrage du client (par défaut: 1 sans -debug)\r\n\r\n#debug=0\r\n#debug=category\r\n# Extraire les informations de débogage (par défaut: 0, fournir category est facultatif).\r\n# Si category n'est pas indiqué ou si category=1, extraire toutes les données de débogage.\r\n# category peut être:\r\n#   rand, util, libevent, ipc, rpc, qt, bench,\r\n#   addrman, net, i2p, http, proxy, tor,\r\n#   leveldb, blockstorage, prune, reindex, mempool, mempoolrej,\r\n#   validation, cmpctblock, coindb, selectcoins, zmq, walletdb.\r\n#\r\n#debug=rand\r\n#debug=util\r\n#debug=libevent\r\ndebug=ipc\r\ndebug=rpc\r\n##debug=qt\r\n#debug=bench\r\ndebug=lock\r\n#\r\n#debug=addrman\r\ndebug=net\r\n##debug=i2p\r\ndebug=http\r\n##debug=proxy\r\n##debug=tor\r\n#\r\n#debug=leveldb\r\n#debug=blockstorage\r\n#debug=prune\r\n#debug=reindex\r\ndebug=mempool\r\ndebug=mempoolrej\r\n#\r\ndebug=validation\r\n#debug=estimatefee\r\ndebug=cmpctblock\r\ndebug=coindb\r\n#debug=selectcoins\r\n#debug=zmq\r\n#debug=walletdb\r\n```",
      "created_at" : "2022-08-26T07:17:49Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1228142185",
      "id" : 1228142185,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JM_Zp",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1228142185/reactions"
      },
      "updated_at" : "2022-08-26T07:17:49Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1228142185",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/1387035?v=4",
         "events_url" : "https://api.github.com/users/verdy-p/events{/privacy}",
         "followers_url" : "https://api.github.com/users/verdy-p/followers",
         "following_url" : "https://api.github.com/users/verdy-p/following{/other_user}",
         "gists_url" : "https://api.github.com/users/verdy-p/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/verdy-p",
         "id" : 1387035,
         "login" : "verdy-p",
         "node_id" : "MDQ6VXNlcjEzODcwMzU=",
         "organizations_url" : "https://api.github.com/users/verdy-p/orgs",
         "received_events_url" : "https://api.github.com/users/verdy-p/received_events",
         "repos_url" : "https://api.github.com/users/verdy-p/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/verdy-p/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/verdy-p/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/verdy-p"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "Note that this RPC hanging issue (which appears if you run \"gettxsetoutinfo\" too often, which then hangs for hours, locking one of the 4 \"httpworkers\" each time, then block completely and forbids using even \"bitcoin-cli stop\" is a separate issue than https://github.com/bitcoin/bitcoin/issues/25897.\r\n\r\nSo there are multiple issues, not caused by the same thing, or not with the same effect. In #25897, you don't need to use any bitcoin-cli RPC request to get the hang very rapidly (and extremely rapidly with ALL default settings in both Windows and Linux), after jsut a few minutes, and it's simply impossible to complete the IBD without having to \"-reindex\" or \"-reindex-chainstate\" each time: indexes are not correctly flushed, get corrupted, chaintips are \"disconnected\", and to make any progress you need to have a complete backup of the \"chainstate\", created when you could shutdown bitcoin successfully.\r\n\r\nTo accelerate things, I also used a dedicated storage volume (about 800 MiB is sufficient for a full node, and all the blocks, indexes, and backups of indexes) for all bitcoin data, formatted with LARGE cluster sizes (64 KiB initially, then 256 KiB, to make sure this was not caused by filesystem overhead, and to significantly reduce the fragmentation: after all almost all files in bitcoin data are large, over 1MB). And I have eliminated all causes of possible I/O hardware issues by using a RAID5 volume over 6 physical disks (and looking at OS reports about them, and also used filesystem checking, and nothing was detected in system logs). Of course, all this should not be needed on a regular default installation, but for daily use, I would still recommend using a dedicated volume (not necessarily RAID5 on many disks), and you should not need extra space for backups of indexes (even if most of the space is for the ~450GiB of blocks, and about 10 GiB for the chainstate index, plus some 20% free margin to avoid most filesystem overheads), and also recommand large cluster sizes (as this makes the PC much more responsive, even when the volume is created on an SSD, and reduces significantly the fragmentation and disk activity if you use an hard disk, or an external USB device).\r\n\r\nOn the opposite I keep the OS and all other \"home\" files use the default cluster sizes on its volume (typically 4 KiB, unless you use very large disks): various people use larger cluster sizes with dedicated volumes for the storage of their videos or some of their games to get more performance for their large files (it does not necessarily waste space), or for the storage of large databases, always to minimize the filesystem overhead.\r\n\r\nOn Linux, I just chose the default \"ext4\" filesystem (it could have been just \"ext2\" without journaling but less safe, or \"zfs\", or other). On Windows I chose the default \"NTFS\" filesystem (it could have been \"ReFS\" with additional checks and costs, it could eventually be \"FAT32\" with much less stability after crashes, or \"exFAT\" but the 800 GiB volume is not so large that you really need it and all files are largely below 4GiB each so \"exFAT\" is not needed at all; anyway \"NTFS\" and \"ext4\" are fine for all disk sizes and all file sizes, and their journaling makes our life safer after almost all crashes; I did NOT use \"BTRFS\" on Linux which is known to have severe issues after crashes, being almost impossible to repair, forcing to reformat everything and loosing all existing data; I have no opinion about \"ZFS\" that some Linux distribs propose, but I don't understand why some Linux distribs are still supporting \"BTRFS\" and sometimes propose it by default).\r\n\r\nOn Linux, I also did not use \"LVM\" on the guest OS or on a native OS (I use \"LVM\" only on a Linux-based host OS for installing an hypervisor needed to run a VM; as well on Windows, I use \"StorageSpaces\" for the storage of VMs used by an Windows-based hypervisor: these are quite common things done by administrators of hypervisors, because this offers flexibility for managing/creating/deleting/moving/resizing the storage needed for multiple VMs). Some Linux distribs uses \"LVM\" by default (even in their desktop environment): Bitcoin should work independantly of such partitioning and filesystem schemes.\r\n",
      "created_at" : "2022-08-26T07:27:40Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1228150841",
      "id" : 1228150841,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JNBg5",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1228150841/reactions"
      },
      "updated_at" : "2022-08-26T07:58:12Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1228150841",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/1387035?v=4",
         "events_url" : "https://api.github.com/users/verdy-p/events{/privacy}",
         "followers_url" : "https://api.github.com/users/verdy-p/followers",
         "following_url" : "https://api.github.com/users/verdy-p/following{/other_user}",
         "gists_url" : "https://api.github.com/users/verdy-p/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/verdy-p",
         "id" : 1387035,
         "login" : "verdy-p",
         "node_id" : "MDQ6VXNlcjEzODcwMzU=",
         "organizations_url" : "https://api.github.com/users/verdy-p/orgs",
         "received_events_url" : "https://api.github.com/users/verdy-p/received_events",
         "repos_url" : "https://api.github.com/users/verdy-p/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/verdy-p/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/verdy-p/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/verdy-p"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "Thanks for the thorough write up. Will check this out asap. Might be beyond my ability.",
      "created_at" : "2022-08-28T15:42:20Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1229489248",
      "id" : 1229489248,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JSIRg",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1229489248/reactions"
      },
      "updated_at" : "2022-08-28T15:42:20Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1229489248",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/45839100?v=4",
         "events_url" : "https://api.github.com/users/amovfx/events{/privacy}",
         "followers_url" : "https://api.github.com/users/amovfx/followers",
         "following_url" : "https://api.github.com/users/amovfx/following{/other_user}",
         "gists_url" : "https://api.github.com/users/amovfx/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/amovfx",
         "id" : 45839100,
         "login" : "amovfx",
         "node_id" : "MDQ6VXNlcjQ1ODM5MTAw",
         "organizations_url" : "https://api.github.com/users/amovfx/orgs",
         "received_events_url" : "https://api.github.com/users/amovfx/received_events",
         "repos_url" : "https://api.github.com/users/amovfx/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/amovfx/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/amovfx/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/amovfx"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "I havn't forgotten about this. @verdy-p have you had any progress?",
      "created_at" : "2022-09-09T01:51:30Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1241409536",
      "id" : 1241409536,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585J_mgA",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1241409536/reactions"
      },
      "updated_at" : "2022-09-09T01:51:30Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1241409536",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/45839100?v=4",
         "events_url" : "https://api.github.com/users/amovfx/events{/privacy}",
         "followers_url" : "https://api.github.com/users/amovfx/followers",
         "following_url" : "https://api.github.com/users/amovfx/following{/other_user}",
         "gists_url" : "https://api.github.com/users/amovfx/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/amovfx",
         "id" : 45839100,
         "login" : "amovfx",
         "node_id" : "MDQ6VXNlcjQ1ODM5MTAw",
         "organizations_url" : "https://api.github.com/users/amovfx/orgs",
         "received_events_url" : "https://api.github.com/users/amovfx/received_events",
         "repos_url" : "https://api.github.com/users/amovfx/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/amovfx/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/amovfx/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/amovfx"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "Now with a completely downloaeed database (fully indexed with all 4 indexes), there's no longer an issue.\r\nBut all my attempts to start from zero data are still failing rapidly. I've not been able to isolate the deadlock (that still occurs even if I do not add any setting other the default or additional indexes, early during the IBD phase, on both Windows and Linux, with the version compiled as is from existing Git sources).\r\nBut anyway NONE of the existing released versions (signed binaries from the wedssite) are working and show the same deadlock (or fatal data corruptions in the chainstate) occuring really fast (this is jsut slightly less frequent if we compiler it ourself from Git sources: here at least we avoid the corruption most of the time and can preserve the chainstate by just restarting with check level=4, without having to reindex everything; but wiht the release, even that solution does not work and it's impossible to complete the IBD safely, we constantly need to restart from scratch, if we've not kept regular snapshots by stopping the daemon or graphic version every about 5-10 minutes, because they always crash after about 15-20 minutes, sometimes sooner). And this is systelaic on any systems with 3 cores (or more) or 6 CPU threads (or more). If you run the daemon or graphic version on a single vcore (using process manager's CPU affinity in Windows, or the equivalent in Linux, or by running Linux in a VM with a single vcore), it does not crash but it is extremely  slow.",
      "created_at" : "2022-09-12T12:50:39Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1243694696",
      "id" : 1243694696,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585KIUZo",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1243694696/reactions"
      },
      "updated_at" : "2022-09-12T12:50:39Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1243694696",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/1387035?v=4",
         "events_url" : "https://api.github.com/users/verdy-p/events{/privacy}",
         "followers_url" : "https://api.github.com/users/verdy-p/followers",
         "following_url" : "https://api.github.com/users/verdy-p/following{/other_user}",
         "gists_url" : "https://api.github.com/users/verdy-p/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/verdy-p",
         "id" : 1387035,
         "login" : "verdy-p",
         "node_id" : "MDQ6VXNlcjEzODcwMzU=",
         "organizations_url" : "https://api.github.com/users/verdy-p/orgs",
         "received_events_url" : "https://api.github.com/users/verdy-p/received_events",
         "repos_url" : "https://api.github.com/users/verdy-p/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/verdy-p/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/verdy-p/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/verdy-p"
      }
   },
   {
      "author_association" : "MEMBER",
      "body" : "It could also make sense to try to reproduce this in asan to check for some cases of undefined behavior.\r\n\r\nWindows: https://docs.microsoft.com/en-us/cpp/sanitizers/asan\r\nLinux: https://clang.llvm.org/docs/AddressSanitizer.html",
      "created_at" : "2022-09-12T12:57:50Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1243703154",
      "id" : 1243703154,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585KIWdy",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1243703154/reactions"
      },
      "updated_at" : "2022-09-12T12:57:50Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1243703154",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/6399679?v=4",
         "events_url" : "https://api.github.com/users/MarcoFalke/events{/privacy}",
         "followers_url" : "https://api.github.com/users/MarcoFalke/followers",
         "following_url" : "https://api.github.com/users/MarcoFalke/following{/other_user}",
         "gists_url" : "https://api.github.com/users/MarcoFalke/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/MarcoFalke",
         "id" : 6399679,
         "login" : "MarcoFalke",
         "node_id" : "MDQ6VXNlcjYzOTk2Nzk=",
         "organizations_url" : "https://api.github.com/users/MarcoFalke/orgs",
         "received_events_url" : "https://api.github.com/users/MarcoFalke/received_events",
         "repos_url" : "https://api.github.com/users/MarcoFalke/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/MarcoFalke/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/MarcoFalke/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/MarcoFalke"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "My opinion is that there's some \"Stack use after return\" remaining, and in multithreaded environement with many concurrent connections opening and closing there's likely an issue affecting one of the worker threads causnig data corruption in indexes (plus the deadlock already detected in an unsafe data checker inside Bitcoin code).\r\nI wonder if this will be solved ibn the \"multiprocess\" version that you're starting to implement (separate processes for separate services, communicating via IPC calls with the documented RPC protocol interface)",
      "created_at" : "2022-09-12T13:04:44Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1243711282",
      "id" : 1243711282,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585KIYcy",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1243711282/reactions"
      },
      "updated_at" : "2022-09-12T13:04:44Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1243711282",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/1387035?v=4",
         "events_url" : "https://api.github.com/users/verdy-p/events{/privacy}",
         "followers_url" : "https://api.github.com/users/verdy-p/followers",
         "following_url" : "https://api.github.com/users/verdy-p/following{/other_user}",
         "gists_url" : "https://api.github.com/users/verdy-p/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/verdy-p",
         "id" : 1387035,
         "login" : "verdy-p",
         "node_id" : "MDQ6VXNlcjEzODcwMzU=",
         "organizations_url" : "https://api.github.com/users/verdy-p/orgs",
         "received_events_url" : "https://api.github.com/users/verdy-p/received_events",
         "repos_url" : "https://api.github.com/users/verdy-p/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/verdy-p/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/verdy-p/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/verdy-p"
      }
   },
   {
      "author_association" : "MEMBER",
      "body" : "> My opinion is that there's some \"Stack use after return\"\r\n\r\nit would be good to have the runtime traceback of valgrind or asan, otherwise there is nothing we can do",
      "created_at" : "2022-09-12T13:07:10Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1243714277",
      "id" : 1243714277,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585KIZLl",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1243714277/reactions"
      },
      "updated_at" : "2022-09-12T13:07:10Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1243714277",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/6399679?v=4",
         "events_url" : "https://api.github.com/users/MarcoFalke/events{/privacy}",
         "followers_url" : "https://api.github.com/users/MarcoFalke/followers",
         "following_url" : "https://api.github.com/users/MarcoFalke/following{/other_user}",
         "gists_url" : "https://api.github.com/users/MarcoFalke/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/MarcoFalke",
         "id" : 6399679,
         "login" : "MarcoFalke",
         "node_id" : "MDQ6VXNlcjYzOTk2Nzk=",
         "organizations_url" : "https://api.github.com/users/MarcoFalke/orgs",
         "received_events_url" : "https://api.github.com/users/MarcoFalke/received_events",
         "repos_url" : "https://api.github.com/users/MarcoFalke/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/MarcoFalke/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/MarcoFalke/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/MarcoFalke"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "Don't know how to setup this (problem finding the configuration that works with existing config scripts)",
      "created_at" : "2022-09-12T13:14:42Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1243724391",
      "id" : 1243724391,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585KIbpn",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1243724391/reactions"
      },
      "updated_at" : "2022-09-12T13:14:42Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1243724391",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/1387035?v=4",
         "events_url" : "https://api.github.com/users/verdy-p/events{/privacy}",
         "followers_url" : "https://api.github.com/users/verdy-p/followers",
         "following_url" : "https://api.github.com/users/verdy-p/following{/other_user}",
         "gists_url" : "https://api.github.com/users/verdy-p/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/verdy-p",
         "id" : 1387035,
         "login" : "verdy-p",
         "node_id" : "MDQ6VXNlcjEzODcwMzU=",
         "organizations_url" : "https://api.github.com/users/verdy-p/orgs",
         "received_events_url" : "https://api.github.com/users/verdy-p/received_events",
         "repos_url" : "https://api.github.com/users/verdy-p/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/verdy-p/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/verdy-p/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/verdy-p"
      }
   },
   {
      "author_association" : "MEMBER",
      "body" : "On Linux you simply pass `--with-sanitizers=address` to `./configure` (you might also have to set `CC=clang CXX=clang++`). On Windows, I don't know.",
      "created_at" : "2022-09-12T13:27:01Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1243742523",
      "id" : 1243742523,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585KIgE7",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1243742523/reactions"
      },
      "updated_at" : "2022-09-12T13:27:01Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1243742523",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/6399679?v=4",
         "events_url" : "https://api.github.com/users/MarcoFalke/events{/privacy}",
         "followers_url" : "https://api.github.com/users/MarcoFalke/followers",
         "following_url" : "https://api.github.com/users/MarcoFalke/following{/other_user}",
         "gists_url" : "https://api.github.com/users/MarcoFalke/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/MarcoFalke",
         "id" : 6399679,
         "login" : "MarcoFalke",
         "node_id" : "MDQ6VXNlcjYzOTk2Nzk=",
         "organizations_url" : "https://api.github.com/users/MarcoFalke/orgs",
         "received_events_url" : "https://api.github.com/users/MarcoFalke/received_events",
         "repos_url" : "https://api.github.com/users/MarcoFalke/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/MarcoFalke/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/MarcoFalke/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/MarcoFalke"
      }
   },
   {
      "author_association" : "MEMBER",
      "body" : "Is this still an issue with a recent version of Bitcoin Core? If yes, what are the steps to reproduce?",
      "created_at" : "2023-02-23T20:27:15Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1442387196",
      "id" : 1442387196,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585V-RT8",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1442387196/reactions"
      },
      "updated_at" : "2023-02-23T20:27:15Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1442387196",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/6399679?v=4",
         "events_url" : "https://api.github.com/users/maflcko/events{/privacy}",
         "followers_url" : "https://api.github.com/users/maflcko/followers",
         "following_url" : "https://api.github.com/users/maflcko/following{/other_user}",
         "gists_url" : "https://api.github.com/users/maflcko/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/maflcko",
         "id" : 6399679,
         "login" : "maflcko",
         "node_id" : "MDQ6VXNlcjYzOTk2Nzk=",
         "organizations_url" : "https://api.github.com/users/maflcko/orgs",
         "received_events_url" : "https://api.github.com/users/maflcko/received_events",
         "repos_url" : "https://api.github.com/users/maflcko/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/maflcko/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/maflcko/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/maflcko"
      }
   },
   {
      "author_association" : "CONTRIBUTOR",
      "body" : "The problem does not seem to be easily reproducible.\r\n\r\nPlease open a new issue (or leave a comment in here if you want this re-opened) if you experience the problem again. ",
      "created_at" : "2024-04-10T15:18:00Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-2047836598",
      "id" : 2047836598,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII5856D4G2",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/2047836598/reactions"
      },
      "updated_at" : "2024-04-10T15:18:00Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/2047836598",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/6606587?v=4",
         "events_url" : "https://api.github.com/users/willcl-ark/events{/privacy}",
         "followers_url" : "https://api.github.com/users/willcl-ark/followers",
         "following_url" : "https://api.github.com/users/willcl-ark/following{/other_user}",
         "gists_url" : "https://api.github.com/users/willcl-ark/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/willcl-ark",
         "id" : 6606587,
         "login" : "willcl-ark",
         "node_id" : "MDQ6VXNlcjY2MDY1ODc=",
         "organizations_url" : "https://api.github.com/users/willcl-ark/orgs",
         "received_events_url" : "https://api.github.com/users/willcl-ark/received_events",
         "repos_url" : "https://api.github.com/users/willcl-ark/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/willcl-ark/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/willcl-ark/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/willcl-ark"
      }
   }
]
