[
   {
      "author_association" : "NONE",
      "body" : "Hi, the command did take a while to return. Perhaps about 30 seconds. This is what I got,\r\n\r\n{\r\n  \"height\": 750848,\r\n  \"bestblock\": \"000000000000000000042bfa933012137be4426a545056c51d75f8358306f099\",\r\n  \"txouts\": 83853482,\r\n  \"bogosize\": 6255092170,\r\n  \"hash_serialized_2\": \"e8915ee90c5152753b10ab7e1b48d33f21d999a89668a3f5b948478b153ccff6\",\r\n  \"total_amount\": 19130092.17246361,\r\n  \"transactions\": 49927698,\r\n  \"disk_size\": 5119722459\r\n}\r\n\r\nWhat version are you running? \r\nI'm on Bitcoin Core RPC client version v23.99.0-b1a2021f7809-dirty",
      "created_at" : "2022-08-24T03:31:53Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1225138581",
      "id" : 1225138581,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JBiGV",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1225138581/reactions"
      },
      "updated_at" : "2022-08-24T03:32:38Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1225138581",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/111384550?v=4",
         "events_url" : "https://api.github.com/users/ZaidanK/events{/privacy}",
         "followers_url" : "https://api.github.com/users/ZaidanK/followers",
         "following_url" : "https://api.github.com/users/ZaidanK/following{/other_user}",
         "gists_url" : "https://api.github.com/users/ZaidanK/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/ZaidanK",
         "id" : 111384550,
         "login" : "ZaidanK",
         "node_id" : "U_kgDOBqOX5g",
         "organizations_url" : "https://api.github.com/users/ZaidanK/orgs",
         "received_events_url" : "https://api.github.com/users/ZaidanK/received_events",
         "repos_url" : "https://api.github.com/users/ZaidanK/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/ZaidanK/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/ZaidanK/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/ZaidanK"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "I'm using the same version as you. It was compiled from the current develomment branch in this Git repository.\r\nCompiled with debug (-g) and with -DDEBUG_LOCKCONTENTION (as instructed by other developers because I submitted several other issues) here.\r\n\r\nThe node is fully synchronized, running as a full node.\r\n\r\nRunning on standard Debian Bullseye, in a VM with 8 CPU cores (Intel Core i9), 32GB RAM, and a dedicated physical storage volume for Bitcoin data, over a fast and reliable RAID5 array (on 6 physical disks), with 1TB allocated only for this volume (there's a separate volume for the rest of the system or /home, all Bitcion data goes into its own mounted partition, optimized for perfomance with 64KB clusters).\r\n\r\nI can reproduce it on my local PC, or when using a VM hosted Azure or AWS. So I know that it is not a hardware issue. I have the same issue when running on a cheaper personal notebook (with a SSD), where Debian is installed with a basic desktop environment.\r\n\r\nIt has both connectivity over IPv4 and IPv6 (but I don't use Tor) and accepts incoming connections from peers on the Internet.\r\n\r\n[That VM only runs the kernel (init), and a single user logged in running two bash sessions, one for running bitcoin dameon (via `gdb --args bitcoind -printtoconsole`), the other one for looking at what is happening (with \"htop\" to see active processes and threads, or to run 'bitcoin-cli' commands. [I use the \"-printtoconsole\" option just to have a direct view of logs, without having to use some \"tail -f debug.log\" in another console; but the main reason is that there are some other outputs on stderr which are not written in \"debug.log\", coming from some dependant libraries, noably from MiniUPNPC which is used in its own thread, so I can see these messages synchronized with other logs. I've not disabled UPNP with the \"pnp=0\" option; it has no effect on my network, as UPNP is not enabled on the router which is just configured with a single port forwarding for accepting incoming connections on TCP port 8333 with IPv4 or IPv6; I've disabled Tor, so \"listenonion=0\" is set in bitcoin.conf, as well there's no option to enable I2P; the RPC service is configured to allow onlyconnections using cookie authentication, and it only accepts local connections, with the \"whitelist=127.0.0.1/32\" option, and only from the same local Linux user, where this \"rpc.cookie\" file is accessible and not readable by any other Linux user (except \"root\") than the one used to run bitcoind or gdb.]\r\n\r\nI run bitcoind through gdb, only to be able to pause it an inspect what is happening and get stack traces if needed). But the same occurs when letting it run outside gdb (then I can use the released version 23.0, or a compiled version 23.99 without debug (-g). Note that I cannot \"attach\" gdb to an already running bitcoind, sur to security restrictions (\"ptrace\" is not permitted across sessions with different controling terminals or different parent processes, this is enforced by the kernel with its standard security settings, so gdb must be attached as the parent process and must run bitcoind itself; I will never run any Internet-connected program accepting incoming connections over any Linux where such restrictions on ptrace are not enforced by the kernel, at least with the \"yama\" security model or with the \"SELinux\" model; a strenghened kernel is mandatory for running any VM in AWS and Azure when not running any Linux VM on costly dedicated hardware, but on shared hosts where you cannot run custom kernels, but only supported kernels: I use the standard (securely signed) Debian Bullseye kernel proposed and supported by these cloud-hosting providers.\r\n\r\nI also know now (see other bug reports) that one \"bitcoin.conf\" option (checkblockindex=1) has an issue and is not thread-safe, so I've disabled it (that bug was signaled by another user in 2019). That option is disabled by default in the release, but while searching for other bugs, I had activated it, but this causes the RPC service to hang as well.\r\n\r\nI know that `bitcoin-cli gettxoutsetinfo` can take a while, but according to what is logged, the deamon just takes about 40 ms to complete the flush, but then hangs but then enters in a tight loop that never ends after more than 1 hour, and never replies to the bitcoin-cli client.\r\n",
      "created_at" : "2022-08-24T04:26:39Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1225174876",
      "id" : 1225174876,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JBq9c",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1225174876/reactions"
      },
      "updated_at" : "2022-08-24T05:23:30Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1225174876",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/1387035?v=4",
         "events_url" : "https://api.github.com/users/verdy-p/events{/privacy}",
         "followers_url" : "https://api.github.com/users/verdy-p/followers",
         "following_url" : "https://api.github.com/users/verdy-p/following{/other_user}",
         "gists_url" : "https://api.github.com/users/verdy-p/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/verdy-p",
         "id" : 1387035,
         "login" : "verdy-p",
         "node_id" : "MDQ6VXNlcjEzODcwMzU=",
         "organizations_url" : "https://api.github.com/users/verdy-p/orgs",
         "received_events_url" : "https://api.github.com/users/verdy-p/received_events",
         "repos_url" : "https://api.github.com/users/verdy-p/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/verdy-p/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/verdy-p/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/verdy-p"
      }
   },
   {
      "author_association" : "MEMBER",
      "body" : "Can you attach gdb when this deadlock happens and let us know where exactly the http thread is stuck?",
      "created_at" : "2022-08-24T05:44:42Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1225224100",
      "id" : 1225224100,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JB2-k",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1225224100/reactions"
      },
      "updated_at" : "2022-08-24T05:44:42Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1225224100",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/6399679?v=4",
         "events_url" : "https://api.github.com/users/MarcoFalke/events{/privacy}",
         "followers_url" : "https://api.github.com/users/MarcoFalke/followers",
         "following_url" : "https://api.github.com/users/MarcoFalke/following{/other_user}",
         "gists_url" : "https://api.github.com/users/MarcoFalke/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/MarcoFalke",
         "id" : 6399679,
         "login" : "MarcoFalke",
         "node_id" : "MDQ6VXNlcjYzOTk2Nzk=",
         "organizations_url" : "https://api.github.com/users/MarcoFalke/orgs",
         "received_events_url" : "https://api.github.com/users/MarcoFalke/received_events",
         "repos_url" : "https://api.github.com/users/MarcoFalke/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/MarcoFalke/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/MarcoFalke/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/MarcoFalke"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "I'm setting up an environment for testing this out right now. @verdy-p, Would you please make your bitcoin.conf available. Do you have the same problems on testnet as well?\r\n\r\nYou configure command looks like\r\n`configure -g -DDEBUG_LOCKCONTENTION`\r\ncorrect?\r\n\r\nedit: Apologies,\r\nI got the following to work\r\n`configure CXXFLAGS='-O0 -g -DDEBUG_CONTENTION'`",
      "created_at" : "2022-08-24T22:57:59Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1226569778",
      "id" : 1226569778,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JG_gy",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1226569778/reactions"
      },
      "updated_at" : "2022-08-24T23:58:40Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1226569778",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/111384550?v=4",
         "events_url" : "https://api.github.com/users/ZaidanK/events{/privacy}",
         "followers_url" : "https://api.github.com/users/ZaidanK/followers",
         "following_url" : "https://api.github.com/users/ZaidanK/following{/other_user}",
         "gists_url" : "https://api.github.com/users/ZaidanK/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/ZaidanK",
         "id" : 111384550,
         "login" : "ZaidanK",
         "node_id" : "U_kgDOBqOX5g",
         "organizations_url" : "https://api.github.com/users/ZaidanK/orgs",
         "received_events_url" : "https://api.github.com/users/ZaidanK/received_events",
         "repos_url" : "https://api.github.com/users/ZaidanK/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/ZaidanK/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/ZaidanK/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/ZaidanK"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "I don't use testnet, jsut the regular chain, because I don't need to send any transaction on it or create blocks, and I'm not mining The regular chani contains all interesting features, is highly active, has many peers (using various software implementations). And bugs are occuring with this variety.\r\n\r\nNote: I created a dedicated storage volume only for Bitcoin data (blocks, chainstate, indexes, pluis de debug.log file), separated from the system files, home directory and /usr/local/ directories where the compiled software will be installed and running. This volume also contains some regular copies of the \"chainstate\" and \"indexes\" (4 indexes are enabled), just to avoid having to reindex everything after a crash, or to perform a new test, so I dimensionned to to 800 GiB in my Debian VM (currently about 450 GiB for blocks for a full node, add the chainstate, indexes, and their backups, it remains about 150GB free on that volume).\r\n\r\nThe interesting thing is that you need to have more indexes enabled (txindex, coinstat, blockfilter). It seems that this bug mostly affects the coinstat index when the main chainstate is fully synced and no longer in IBD). But it you start bitcoind from scratch (not any block or index) with the 4 indexed enabled, you'll see it hand extremely rapidly (in less than 10 minutes), if you run with at least 8 CPU cores in your VM (so that threads may effectively run concurrently peer connections).\r\n\r\nYou can even hang it very rapidly by just using \"bitcoin-cli -getinfo\" repeatedly to run RPC requests (which will consume an http thread to consult the progress of the chainstate): it should not crash/hang the RPC service, but it does.\r\n\r\nNote that initially I had also enabled \"checkmempool=1\" and \"checkchainstate=1\" (but now I know that the 2nd one has a problem and generates a deadlock, so I've disabled it, and there's still a problem).\r\n\r\nOn Windows, you don't need to configure anything: the default settings will make both the Qt version or the daemon version (running on a CMD console) hang the same way (as long as you've 8 CPU cores enabled); I could also get this hang with a lower number of CPU (you can use the Task manager to reduce the \"CPU affinity\" to reduce the number of cores you want for bitcoind; if running Windows in a VM, just configure the number of cores in your favorite hypervisor, it could be Hyper-V, Proxmox, or the internal hypervisors manage by AWS or Azure on their cloud; I did not test it with basic Qemu over Debian, or with Oracle Virtual Box; Proxmox however can only run on bare metal and won't let you run GUI apps easily without complex configuration, but it is fine as is for testing the deamon version, running in a \"Windows Core\" server installation). I thnik that one Windows such deadlocks are more likely, because Windows uses much lighter threads in its scheduler, whereas Linux uses \"lighweight processes\" (LWP) to support the POSIX thread library, with some additional containment, and transitions between threads in Linux have a higher cost than on Windows, and mutexes on Windows are more \"reactive\" than on Linux.\r\n\r\nAlso I noted that bitcoind does not manage any priority between its threads, so threads are woken up in random order (in Windows like on Linux). And there's not even any code in bitcoind to insert randomized delays after releasing a mutex: the message manager is using mutexes in a too much agressive, it is awoken much too often, more than necessary, and it it acquires a lock on the main mutex, it may hold it most of the time, or will \"steal\" it easily from other threads, that will have to pause and will have difficulties to be woken up: these waiting threads may still have another lock on another mutex, creating the deadlock if other threads need it but then need to acquire the global mutex.\r\n\r\nNote also that I run with \"upnp=1\" enabled, but as long as UPnP is not enabled on the network side, it should be safe beacuse it should not acquire the lock on the list of peers (also used by the address manager to perform new outgoing connections, or when accepting list of peer addresses from any peer). It is possible that the deadlock occurs when the address manager acquires the lock on the address list, while it is still holding the global mutex on the chainstate in the same thread, this could be caused by the address manager being needed but the validator currently processing blocks, but needing another outgoing connection, if existing peers are not replying to a request, e.g. for new incoming blocks).\r\n\r\nSo studying the lock contention (notably when there are different mutexes acquired in different orders) may reveal the deadlock problem.\r\n\r\nAnother thing I do not understand is why there is a so small static number (4) of \"httpworker\" threads for RPC. RPC is supposed to be used locally at low frequency (not from remotes) and could be created dynamically (and then deleted, we can just keep one running permanently in a thread pool, and just fix a large but sufficient maximum, even up to 256, may be more, like on usual webservers, even if it exceeds the number of available CPU cores). Being able to tune the number of worker threads for each kind of thread would also allow interesting similations for testing bitcoind (notably for lock contention) and for adapting bitcoind on more environments, with better scalability (e.g. not running on desktop or notebook PCs, but on large servers with many cores and lot of memory, or running on small appliances and mobiles probably but not as a \"full node\" as this requires too much local storage).\r\n\r\nThe RPC listener should also be running much earlier in the init sequence (for example we should be able to use \"bitcoin-cli logging '[]' '[]'\" or the RPC request to suspend network activity, or to \"stop\" the daemon immediately (creating an \"httpworker\" if needed, even if the 4 existing ones are busy) even if some RPC requests (about the state of the chainstate, or the wallet as long as it is not loaded) are still not fully avaible and should return their existing initialization status by returning immediately a suitable error.\r\n\r\nThen adding an RPC to control thread pool sizes, or CPU affinity, could also allow performing lot of simulations for \"fuzz\" tests (some tests will require a host with at least 8 cores to be able to run the simulation).\r\n\r\nFinally I suggest that the Bitcoin documentation allows any RPC request to send \"HTTP 100 Continue\" status, which should be required if the execution of the RPC runs for more than 5 seconds: RPC clients should receive these notifications, containing also some informative status (as a JSON object) of what is happening and how these requests are progressing, for example the length of their work queue such as the range (minimum/maximum) height to handle, the number of transactions to do, and some counters, and a the same time should see if they were instructed to bail out, or if the RPC client has already been disconnected or has been interrupted and will no longer receive any reply. It's not reasonnable for any RPC thread to take several minutes (e.g. \"gettxoutsetinfo\"), or may be hours to complete, without knowing anything about what it is doing (we shuold not need to run the daemon inside a debugger and send a SIGINT signal to suspend the whole process, just to inspect the thread stacks with debugger commands, or by using some other \"strace\" tool on Linux, which does not always work in all environment where it is restricted by basic kernel security).\r\n",
      "created_at" : "2022-08-25T11:10:02Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1227115836",
      "id" : 1227115836,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JJE08",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1227115836/reactions"
      },
      "updated_at" : "2022-08-25T12:03:05Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1227115836",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/1387035?v=4",
         "events_url" : "https://api.github.com/users/verdy-p/events{/privacy}",
         "followers_url" : "https://api.github.com/users/verdy-p/followers",
         "following_url" : "https://api.github.com/users/verdy-p/following{/other_user}",
         "gists_url" : "https://api.github.com/users/verdy-p/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/verdy-p",
         "id" : 1387035,
         "login" : "verdy-p",
         "node_id" : "MDQ6VXNlcjEzODcwMzU=",
         "organizations_url" : "https://api.github.com/users/verdy-p/orgs",
         "received_events_url" : "https://api.github.com/users/verdy-p/received_events",
         "repos_url" : "https://api.github.com/users/verdy-p/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/verdy-p/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/verdy-p/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/verdy-p"
      }
   },
   {
      "author_association" : "MEMBER",
      "body" : "I assume what's happening here is that `bitcoind` takes longer to compute the gettxoutsetinfo result than `bitcoin-cli` is willing to wait. You may want to increase the rpcclienttimeout option (the default is 15 minutes).",
      "created_at" : "2022-08-25T12:18:57Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1227181536",
      "id" : 1227181536,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JJU3g",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1227181536/reactions"
      },
      "updated_at" : "2022-08-25T12:18:57Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1227181536",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/548488?v=4",
         "events_url" : "https://api.github.com/users/sipa/events{/privacy}",
         "followers_url" : "https://api.github.com/users/sipa/followers",
         "following_url" : "https://api.github.com/users/sipa/following{/other_user}",
         "gists_url" : "https://api.github.com/users/sipa/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/sipa",
         "id" : 548488,
         "login" : "sipa",
         "node_id" : "MDQ6VXNlcjU0ODQ4OA==",
         "organizations_url" : "https://api.github.com/users/sipa/orgs",
         "received_events_url" : "https://api.github.com/users/sipa/received_events",
         "repos_url" : "https://api.github.com/users/sipa/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/sipa/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/sipa/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/sipa"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "I will also enable the \"-DDEBUG_LOCKORDER\" option (see \"src/sync.h\", \"src/sync.cpp\", also \"test/sync_tests.cpp\", \"test/reverselock_tests.cpp\") when compiling with \"-g\" and see what is happening when running in \"gdb\". The option \"-DDEBUG_LOCKCONTENTION\" does not seem sufficient.\r\n",
      "created_at" : "2022-08-25T12:23:50Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25912#issuecomment-1227186992",
      "id" : 1227186992,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25912",
      "node_id" : "IC_kwDOABII585JJWMw",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1227186992/reactions"
      },
      "updated_at" : "2022-08-25T12:45:39Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1227186992",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/1387035?v=4",
         "events_url" : "https://api.github.com/users/verdy-p/events{/privacy}",
         "followers_url" : "https://api.github.com/users/verdy-p/followers",
         "following_url" : "https://api.github.com/users/verdy-p/following{/other_user}",
         "gists_url" : "https://api.github.com/users/verdy-p/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/verdy-p",
         "id" : 1387035,
         "login" : "verdy-p",
         "node_id" : "MDQ6VXNlcjEzODcwMzU=",
         "organizations_url" : "https://api.github.com/users/verdy-p/orgs",
         "received_events_url" : "https://api.github.com/users/verdy-p/received_events",
         "repos_url" : "https://api.github.com/users/verdy-p/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/verdy-p/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/verdy-p/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/verdy-p"
      }
   }
]
