[
   {
      "author_association" : "MEMBER",
      "body" : "Please see\r\nhttps://lists.linuxfoundation.org/pipermail/bitcoin-dev/2019-October/017354.html\r\nfor additional background on memory attacks possible using low-work headers\r\nchains. Currently, checkpoints are our only defense against memory attacks on\r\nour algorithm for storing headers, and the cost of attack (as described in that\r\nmailing list post) is not very high. Notably, the cost of an attack does not\r\nincrease as the consensus chain accumulates work, because attacking our\r\nalgorithm now relies on just being able to ramp down difficulty on a chain that\r\nforks from the last checkpointed block header.\r\n\r\nMy goal with this patch is to demonstrate that it should be possible to\r\ndrastically increase the cost of this type of attack with changes only at our\r\np2p application layer.\r\n\r\nThe algorithm is described a bit in the OP and further in comments in\r\nnet_processing.cpp. This patchset is complex and difficult to reason about, I\r\nthink for two reasons:\r\n\r\n(a) We reuse the \"headers\" message in many contexts (it can be a response to a\r\ngetheaders, which can be sent either for an initial chain sync or in response\r\nto a block announcement; or it can be a newly announced block).  The different\r\ncontexts that might be in play when processing a headers message makes\r\nreasoning about our state machine fairly difficult.\r\n\r\n(b) Because our p2p protocol does not support downloading headers in reverse,\r\nwhich is a functionality needed by the algorithm I tried to use here, I had to\r\napproximate that by doing something fairly complicated (storing 1 block hash\r\nfrom each headers message, so that when I got to the point where I'd want to\r\ndownload headers in reverse, I instead download them forwards a second time and\r\nensure I'm getting the same chain on the second try). This in turn means that\r\nthe algorithm uses much more peer memory than desirable in the face of an\r\nattacker chain, which in turn requires additional complexity around limiting\r\nthe number of simultaneously syncing peers, and preventing a sync peer from\r\nstarving other peers whose chains need to sync.\r\n\r\nIn the absence of an attacker giving a node a \"fake\" chain, this code would\r\nonly have one effect: it changes initial headers sync to not fully process\r\nheaders until we've downloaded the chain up to our nMinimumChainWork, at which\r\npoint all the headers are processed in one go. After that, headers processing\r\nshould be essentially unchanged from how it operates today.\r\n\r\nThat said, this patch is very complex, and I am not sure it's worth the review\r\neffort that would be required to merge this change in. It may be interesting as\r\na proof-of-concept however, so that we have a defense on standby in the event\r\nof a memory attack on the network using low-work headers, and so that we have a\r\ngood answer to any mistaken notions that checkpoints are somehow required to\r\nmaintain Bitcoin's security model (they are not).\r\n\r\nOne alternate idea for increasing the cost of attack, which would be vastly\r\nsimpler to deploy, is to raise the minimum difficulty of blocks (eg after the\r\nlast checkpoint height). If we make an arbitrary chain cost at least, say, $1/block to\r\ncreate (assuming current mining hardware capabilities), then mining 100M blocks\r\nto create 8GB of memory usage would be quite expensive! I think this is a\r\nreasonable approach, but has two downsides:\r\n\r\n(a) The cost of an attack still does not go up as the chain work goes up (so in\r\nparticular, if the cost of an attack were to come down as hardware gets more\r\nefficient in the future, we could become vulnerable again).\r\n\r\n(b) Changing the consensus rules we enforce comes with a higher bar for\r\njustification. Even though in this case I think someone could make a coherent\r\nargument for why this is not a meaningful consensus change (and, debatably,\r\nshouldn't even require community consensus!), this may not be well-understood\r\nwithout significant discussion and education. I think it's probably not worth\r\nthe social effort of changing the consensus rules, just to solve what is\r\nfundamentally a problem at the p2p layer. But perhaps I'm overly pessimistic\r\nhere.\r\n\r\nIf this high level approach (of having peers prove that their headers chains\r\nhave sufficient work in order to permanently store them) seems like something\r\nwe might want to include, but if this patch is indeed not worth the effort to\r\ntry to merge, then another option would be to consider a p2p protocol upgrade\r\nthat would make this logic easier to implement, such as a set of new headers\r\nsync messages that support the underlying functionality, while giving other\r\nimprovements as well, such as compression or parallel-download features\r\ndescribed by Jim Posen\r\n(https://lists.linuxfoundation.org/pipermail/bitcoin-dev/2018-March/015851.html).\r\nThe advantage to that should be much simpler logic; the downside is that we run\r\ninto issues with syncing headers chains from unupgraded peers who do not\r\nsupport the new message types.\r\n",
      "created_at" : "2019-10-31T19:04:43Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/pull/17332#issuecomment-548524127",
      "id" : 548524127,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/17332",
      "node_id" : "MDEyOklzc3VlQ29tbWVudDU0ODUyNDEyNw==",
      "updated_at" : "2019-10-31T19:04:43Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/548524127",
      "user" : {
         "avatar_url" : "https://avatars0.githubusercontent.com/u/7463573?v=4",
         "events_url" : "https://api.github.com/users/sdaftuar/events{/privacy}",
         "followers_url" : "https://api.github.com/users/sdaftuar/followers",
         "following_url" : "https://api.github.com/users/sdaftuar/following{/other_user}",
         "gists_url" : "https://api.github.com/users/sdaftuar/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/sdaftuar",
         "id" : 7463573,
         "login" : "sdaftuar",
         "node_id" : "MDQ6VXNlcjc0NjM1NzM=",
         "organizations_url" : "https://api.github.com/users/sdaftuar/orgs",
         "received_events_url" : "https://api.github.com/users/sdaftuar/received_events",
         "repos_url" : "https://api.github.com/users/sdaftuar/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/sdaftuar/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/sdaftuar/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/sdaftuar"
      }
   }
]
