{
   "assignee" : null,
   "assignees" : [],
   "author_association" : "MEMBER",
   "body" : "A low-work headers chain might be valid according to consensus rules, yet\r\nuninteresting for reaching consensus, because of the little work on the chain.\r\nCurrently, a low-work headers chain that is received by bitcoind is\r\nnevertheless stored in memory (permanently), because the headers download logic\r\nstores valid headers as it goes, and we only look at the total work on the\r\nchain at a later point.\r\n\r\nBy definition, a low-work headers chain can be cheap to produce, so the cost to\r\nan adversary for performing a memory DoS (on the entire network of reachable\r\nnodes) is not very high (checkpoints currently make this cost non-trivial, but the cost is not increasing as the chain advances).\r\n\r\nIdeally, the cost to making a node store a headers chain should be related to\r\nthe total work on the best chain, as we're only ever interested in the most\r\nwork chain for consensus purposes. (If an adversary is able to perform a memory\r\nDoS by producing a headers chain with work comparable to the work on the best\r\nchain, there's not much we could do about it, as a node must be aware of all\r\nheaders chains that potentially have the most work in order to remain in\r\nconsensus. So requiring that a headers chain have work comparable to the\r\nmost-work chain before we store it is essentially the best we can do.)\r\n\r\nThis patch introduces a headers download scheme that attempts to verify that a\r\npeer's headers chain has sufficient work (namely, within a week of our current\r\ntip and at least as much work as nMinimumChainWork) before committing to\r\npermanent storage.\r\n\r\nIf a peer gives us a headers message whose last header has less work than our\r\nanti-DoS threshold, then we store those headers in memory that is allocated to\r\njust that peer, until we've seen a chain tip building on those headers that has\r\nsufficient work. At that point, the headers will be processed and stored\r\nglobally.\r\n\r\nBecause of the time-warp problem, where a chain producing blocks at a rate of 6\r\nblocks/second can theoretically be valid even while being low-work, we have to\r\nconsider the possibility of being fed a very long, low-work chain. If we stored\r\nall of a peer's headers even in temporary memory, this could be enough to be a\r\nmemory DoS by itself. To address this, this patch uses a heuristic to cache\r\njust the last header in each message if the time on the chain is progressing\r\nslower than expected. If the chain ends up having sufficient work, then we\r\ncan redownload the chain, verifying that we get the same headers back by using\r\nthese cached headers as intermediate markers that must match the redownloaded\r\nchain.\r\n\r\nUsing this scheme, we can bound the memory used for headers download by a\r\nsingle peer to roughly the amount of memory we'd expect an \"honest\" chain to\r\nuse (1 block header per 10 minutes starting at the genesis block).  To prevent\r\nan adversary from using many inbound peers to flood a node's memory due to\r\nsimultaneous headers sync, this patch also includes logic to restrict using the\r\nper-peer headers sync memory by more than one peer at a time, along with timeout\r\nlogic to prevent a single peer from starving headers sync from other peers.",
   "closed_at" : null,
   "closed_by" : null,
   "comments" : 1,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/17332/comments",
   "created_at" : "2019-10-31T19:03:36Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/17332/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/pull/17332",
   "id" : 515672559,
   "labels" : [
      {
         "color" : "006b75",
         "default" : false,
         "id" : 98298007,
         "name" : "P2P",
         "node_id" : "MDU6TGFiZWw5ODI5ODAwNw==",
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/labels/P2P"
      }
   ],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/17332/labels{/name}",
   "locked" : false,
   "milestone" : null,
   "node_id" : "MDExOlB1bGxSZXF1ZXN0MzM1MDkzODk0",
   "number" : 17332,
   "pull_request" : {
      "diff_url" : "https://github.com/bitcoin/bitcoin/pull/17332.diff",
      "html_url" : "https://github.com/bitcoin/bitcoin/pull/17332",
      "patch_url" : "https://github.com/bitcoin/bitcoin/pull/17332.patch",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/pulls/17332"
   },
   "repository_url" : "https://api.github.com/repos/bitcoin/bitcoin",
   "state" : "open",
   "title" : "p2p: Proof-of-concept: Improve DoS-resistance to low-work headers chains",
   "updated_at" : "2019-10-31T19:05:08Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/17332",
   "user" : {
      "avatar_url" : "https://avatars0.githubusercontent.com/u/7463573?v=4",
      "events_url" : "https://api.github.com/users/sdaftuar/events{/privacy}",
      "followers_url" : "https://api.github.com/users/sdaftuar/followers",
      "following_url" : "https://api.github.com/users/sdaftuar/following{/other_user}",
      "gists_url" : "https://api.github.com/users/sdaftuar/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/sdaftuar",
      "id" : 7463573,
      "login" : "sdaftuar",
      "node_id" : "MDQ6VXNlcjc0NjM1NzM=",
      "organizations_url" : "https://api.github.com/users/sdaftuar/orgs",
      "received_events_url" : "https://api.github.com/users/sdaftuar/received_events",
      "repos_url" : "https://api.github.com/users/sdaftuar/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/sdaftuar/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/sdaftuar/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/sdaftuar"
   }
}
