{
   "active_lock_reason" : null,
   "assignee" : null,
   "assignees" : [],
   "author_association" : "CONTRIBUTOR",
   "body" : "## tldr:\r\nBlock-relay-only connections help improve partition resistance on the bitcoin network by increasing connectivity while obfuscating the network graph. To be conservative and reduce chances of unexpected network effects, initially 2 outbound block-relay-only connections per node were introduced. Since then, we have improved resource utilization and network behaviors to work towards increasing that number. Now, let’s try and do it!\r\n\r\nThis is joint work with mzumsande. #28463 proposes a specific implementation to increase the number of inbound slots for block-relay-only connections, which is a prerequisite to later increase the outbound slots. This issue is a place to discuss any conceptual questions or concerns.\r\n\r\n## History & Context: \r\nIn 2019, PR [#15759](https://github.com/bitcoin/bitcoin/pull/15759) introduced 2 outbound block-relay-only connections for bitcoind nodes. The primary motivation of introducing these connections was to help obfuscate the network graph, since leaked information could help an adversary execute a partition attack. \r\n\r\nFrom the beginning, there was open questioning around how many block-relay-only connections we should add. More increases robustness but effects to consider include resource utilization and addr relay implications. Introducing 2 extra connections was evaluated to be a good first step that balanced tangible benefits with potential risk. gmaxwell mentioned in [this comment](https://github.com/bitcoin/bitcoin/pull/15759#issuecomment-480400958), “ultimately I'd like to optimize memory usage for both inbound and outbound blocksonly links, then at least double the inbound connection limit for blocks only links, and make 8 blocks only links.” @sdaftuar expressed agreement with this direction [here](https://github.com/bitcoin/bitcoin/pull/15759#issuecomment-480868516).\r\n\r\nAt the time, there were a few different mechanisms that would be a cause for concern if the number of block-relay-only connections were increased. Many have been resolved since and we have highlighted one significant question that needs to be evaluated in the context of this proposal. Additionally, reviewers should consider if there may be any other undesirable side effects. \r\n- Addrman interactions (fixed) [PR #20187](https://github.com/bitcoin/bitcoin/pull/20187): There were a couple of nuanced interactions between block-relay-only connections and addrman that were addressed in this PR. The changes fix a privacy leak, ensure block-relay-only addresses are recognized as reliable connections, and fix a pre-existing addrman bug around active connections. \r\n- Addr relay implications (fixed) [PR #21528](https://github.com/bitcoin/bitcoin/pull/21528): As @ajtowns described in [this comment](https://github.com/bitcoin/bitcoin/pull/15759#issuecomment-527012757), introducing block-relay-only connections initially degraded the propagation of addr messages on the network. [PR #21528](https://github.com/bitcoin/bitcoin/pull/21528) reduces addr blackholes by improving the behavior for honest nodes. The default behavior was updated to not treat inbound connections as addr relay peers until they indicated interest by initiating an address related p2p message. \r\n- Memory utilization (fixed) [PR #22778](https://github.com/bitcoin/bitcoin/pull/22778): block-relay-only connections do not require as much memory as transaction relay peers. They don’t need a `TxRelay` data structure, which is significant because the tx relay bloom filter uses approximately 500kb per peer. [PR #22778](https://github.com/bitcoin/bitcoin/pull/22778) allowed nodes to identify whether an inbound peer might ever relay transactions over the lifetime of the connection, and stop initializing the TxRelay data structure when unnecessary. \r\n- Netgroup limitation (fixed) [PR #27374](https://github.com/bitcoin/bitcoin/pull/27374): In certain circumstances, the logic to diversify netgroups of our outbound connections was limiting the total number of connections permitted by the node. This PR fixed this issue by applying separate logic for clearnet peers vs privacy network peers. \r\n- Number of available connection slots on the network (OPEN): available connection slots are a shared and limited network resource. Increasing the defaults for outbound connections should be carefully calibrated against the expected values for inbound slots over time. The next section shares context for how numbers have been selected for our proposal, and this is an area where we are very interested in reviewer feedback. \r\n- Is there anything else we are missing? \r\n\r\n\r\n## Availability of Connection Slots: \r\n#### Context \r\nThe patch in #28463 proposes values based on observing network statistics & calculating expected memory utilization. This section provides more reasoning behind selecting those numbers, so reviewers can evaluate the methodology.\r\n\r\nThe fundamental question is: how much do we need to increase inbound capacity to accommodate for increasing the number of outbounds from 10 to 16. This is tricky to answer with precision because (1) estimating the number of non-reachable nodes is hard and (2) these numbers will inevitably change over time, and we want to accommodate for fluctuations. \r\n\r\nThere is no way to guarantee sufficient connection slots - if all users disabled inbounds, the network would fail. However, we can still observe network behaviors to build confidence around projecting likely proportions that would be maintained over time. After all, the default number of 8 outbound connections dates back to [satoshi code](https://github.com/bitcoin/bitcoin/commit/94cfec07fd302c9ff9b6a80c47418d4fe56596ae) from 2010, and has successfully held up over the years 🙂\r\n\r\n#### Estimating the number of reachable clearnet nodes (per sept 2023)\r\nStatistics from various services: 6155 ([bitnodes](https://bitnodes.io/nodes/)), 8509 ([KIT](https://www.dsn.kastel.kit.edu/bitcoin/data/churn0-v.gpd)), 3862 ([Luke Dashjr](https://luke.dashjr.org/programs/bitcoin/files/charts/historical.html))\r\nQuality of data: The bitnodes number is verifiable because peers can be queried, and a random sampling has demonstrated a high probability of successfully connecting. Luke Dashjr reports significantly lower than the other two, but the methodology is not disclosed. \r\n\r\n#### Estimating the number of non-reachable clearnet nodes \r\n50956 ([Luke](https://luke.dashjr.org/programs/bitcoin/files/charts/historical.html), sept 2023, unknown methodology and included networks)\r\n32300 ([KIT Addr Spam Paper](https://www.dsn.kastel.kit.edu/publications/2022-Bitcoin-Degree.pdf) 07/21, estimated from the degrees calculated from observed addr spam)\r\n27000 - 35000 ([KIT Monitoring Paper](https://fc22.ifca.ai/preproceedings/114.pdf) 12/21, estimated from the number of gossip addrs received)\r\nBoth KIT methods don’t take into account nodes that don’t self-advertise (e.g. listen=0, or SPV clients) but do permit inbound slots. \r\n\r\n#### Extrapolating numbers\r\nLet’s use rough estimates of 8,000 reachable clearnet nodes & 40,000 non-reachable nodes. \r\n\r\nEstimated slots required for each increment to the default number of outbound connections: 48,000. \r\nRequired additional inbound slots for each increment to default outbounds: 48000/8000 = 6.\r\n\r\nWith the current network estimates, we would need at least 6 additional inbound slots for each increment to the default number of outbounds. To be more conservative, we should probably add ~8-10 inbound slots for each additional outbound. \r\n\r\nThis is all only clearnet. However, it seems likely that inbound capacity for privacy networks are higher in comparison, because unlike clearnet, there is no need to unblock ports, so accepting inbounds is the default behavior. While node operators are able to easily disable those inbounds, we’d anticipate that to happen less frequently than on clearnet where the reverse effort is required. \r\n\r\n## Future work: \r\nWe need users to adopt the changes to increase the default for inbound block-relay-only connections before we can safely increase the default for outbounds. #28463 proposes the increase in inbounds. If these changes are accepted, we would want to wait until the corresponding release is widely adopted, then have a future release update the outbound default.\r\n\r\nAnchors were implemented using block-relay-only connections to mitigate against restart-based eclipse attacks. For more context see [issue #17326](https://github.com/bitcoin/bitcoin/issues/17326) & [PR #17428](https://github.com/bitcoin/bitcoin/pull/17428). If we increase the number of outbound block-relay-only connections, we will want to thoughtfully design the interactions with anchors. As sdaftuar mentions in [this comment](https://github.com/bitcoin/bitcoin/pull/17428#issuecomment-554073351), we will likely want to cap the anchors at 2, which entails selection logic. In [this comment](https://github.com/bitcoin/bitcoin/pull/27213#issuecomment-1478551323), @brunoerg mentions the idea of having (at least) one anchor per network instead of just two generic ones. While discussing this in depth would be premature, we also want to keep these implications and options in mind as we advance the current work.",
   "closed_at" : null,
   "closed_by" : null,
   "comments" : 1,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/28462/comments",
   "created_at" : "2023-09-12T20:28:12Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/28462/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/issues/28462",
   "id" : 1893213480,
   "labels" : [
      {
         "color" : "7cf575",
         "default" : false,
         "description" : null,
         "id" : 64583,
         "name" : "Feature",
         "node_id" : "MDU6TGFiZWw2NDU4Mw==",
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/labels/Feature"
      }
   ],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/28462/labels{/name}",
   "locked" : false,
   "milestone" : null,
   "node_id" : "I_kwDOABII585w2CUo",
   "number" : 28462,
   "performed_via_github_app" : null,
   "reactions" : {
      "+1" : 0,
      "-1" : 0,
      "confused" : 0,
      "eyes" : 0,
      "heart" : 0,
      "hooray" : 0,
      "laugh" : 0,
      "rocket" : 0,
      "total_count" : 0,
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/28462/reactions"
   },
   "repository_url" : "https://api.github.com/repos/bitcoin/bitcoin",
   "state" : "open",
   "state_reason" : null,
   "timeline_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/28462/timeline",
   "title" : "Increase # of block-relay-only connections ",
   "updated_at" : "2023-09-13T08:12:56Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/28462",
   "user" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/1500952?v=4",
      "events_url" : "https://api.github.com/users/amitiuttarwar/events{/privacy}",
      "followers_url" : "https://api.github.com/users/amitiuttarwar/followers",
      "following_url" : "https://api.github.com/users/amitiuttarwar/following{/other_user}",
      "gists_url" : "https://api.github.com/users/amitiuttarwar/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/amitiuttarwar",
      "id" : 1500952,
      "login" : "amitiuttarwar",
      "node_id" : "MDQ6VXNlcjE1MDA5NTI=",
      "organizations_url" : "https://api.github.com/users/amitiuttarwar/orgs",
      "received_events_url" : "https://api.github.com/users/amitiuttarwar/received_events",
      "repos_url" : "https://api.github.com/users/amitiuttarwar/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/amitiuttarwar/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/amitiuttarwar/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/amitiuttarwar"
   }
}
