{
   "assignee" : null,
   "body" : "Bitcoin-qt v0.11.1 and now v0.11.2rc1  32 bit Windows, running on Win7 with 2GB ram.\r\n\r\nAt app startup, the splash screen runs through verifying and rescanning status messages fairly quickly, then gets \"stuck\" showing \"Activating best chain\" message. The disk is thrashing. Process memory use is under 300MB, total system memory use is 1.5GB out of 2GB available. CPU load (2 cores) bounces between 10 and 60%, but not pegged at 100%.  Disk use (as reported by Task Manage / Resource Manager) shows about 1MByte/sec read, 3MByte/sec write, with a disk queue length of around 2.5.\r\n\r\nAfter 1 to 2 HOURS, bitcoin-qt gets past the \"activating best chain\" message and opens the full UI window. The blockchain on this machine is 8 weeks out of date.\r\n\r\nWhile sync'ing to the network, the disk is still thrashing heavily and memory use has not increased above 300MB. The peer list shows it is attempting to connect to peers to ask for blocks, but most of the time the Ping Time shows as N/A and there is no user agent or other handshake info shown. The network use graph shows an occasional blip separated by 5 to 10 minutes of total network silence.\r\n\r\nTyping \"help\" in the Debug console window shows no response for nearly 30 seconds.\r\n\r\nThe disk thrashing doesn't appear to be caused by low memory page faults, because there's 500MB of free system memory available.\r\n\r\nIf I shut down the app (normal exit, not kill), wait for it to shut down, and then start it up again, it sits on the \"activating best chain\" message again for an hour or more.\r\n\r\nIs the v0.11.x build running a background thread to update the database and indices on disk?  When this machine was last fired up on main net, it was running Bitcoinqt v0.10.x. \r\n\r\nIt's doing a heckovalot of disk I/O with absolutely nothing coming in from the peer network.  Bitcoinqt is trying to connect to peers, but apparently can rarely can make it through the handshake before giving up and starting over.  This isn't a network or firewall/router/ISP saturation issue because this machine can't even manage a connection to another 0.11.0 peer on the local network which has an up-to-date blockchain. I was thinking I could get the machine \"caught up\" in a few minutes by -connect(ing) it to the up to date machine over the 1GB local ethernet, but it's barely able to connect at all.  \r\n\r\nNote that this machine normally runs bitcoinqt on testnet, and has shown none of this behavior. However, it's kept up to date, not 8 weeks behind there.\r\n\r\nAny idea what's going on?  Why is 0.11.x thrashing the disk so hard, even without incoming txs or blocks?\r\n\r\n",
   "closed_at" : null,
   "closed_by" : null,
   "comments" : 0,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/7001/comments",
   "created_at" : "2015-11-13T02:18:22Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/7001/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/issues/7001",
   "id" : 116685857,
   "labels" : [],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/7001/labels{/name}",
   "locked" : false,
   "milestone" : null,
   "number" : 7001,
   "state" : "open",
   "title" : "0.11.x Bitcoin-qt disk thrashing, nonresponsive  32 bit Win7",
   "updated_at" : "2015-11-13T02:18:22Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/7001",
   "user" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/2288043?v=3",
      "events_url" : "https://api.github.com/users/dthorpe/events{/privacy}",
      "followers_url" : "https://api.github.com/users/dthorpe/followers",
      "following_url" : "https://api.github.com/users/dthorpe/following{/other_user}",
      "gists_url" : "https://api.github.com/users/dthorpe/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/dthorpe",
      "id" : 2288043,
      "login" : "dthorpe",
      "organizations_url" : "https://api.github.com/users/dthorpe/orgs",
      "received_events_url" : "https://api.github.com/users/dthorpe/received_events",
      "repos_url" : "https://api.github.com/users/dthorpe/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/dthorpe/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/dthorpe/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/dthorpe"
   }
}
