[
   {
      "body" : "> implementation depends on an external centralised network of relay servers\r\n\r\nAh, that's a common misunderstanding-- and not true. Matt does run a well maintained public network of nodes running the protocol; but it has no dependence on it. And anyone can run the same software.\r\n\r\nWe've considered it a goal to include more efficient block relaying in core though, and have mostly just been waiting for the protocols implementing it to mature.\r\n\r\n> Compression - binary data, and also compression of that data \r\n\r\nThe bitcoin p2p protocol is already binary. Traditional data compression is not terribly useful except in the presence of address reuse, and not needed over and above mempool relative differential transmission-- which is critical to get any efficiency gain at all.\r\n\r\n> Early relay\r\n\r\nThis is orthogonal to more efficient transmission and could just be done in the ordinary p2p protocol with, a \"unverified block\" message.  Luke-jr implemented this a couple years ago but it provided no meaningful speedup at the time (presumably due to other delay factors which we've since eliminated).  So long as all parties involved know they're getting something non-validated, there isn't much harm in passing it along; as a combination of POW, chain consistency (e.g. extends the current tip), and serialization rules is enough to prevent denial of service.\r\n\r\n> and a separate client that talks to bitcoind.\r\n\r\nOur preferred method of adding new protocols is via gatewaying from another process, for reliability and security reasons. \r\n\r\n> such a network similar to the one that already exists that you could configure in a higher trust rating based\r\n\r\nIn general our experience suggests that trust settings are black magic that cannot be configured correctly even by experts-- that even trusted things fail, and their doing so magnifies fault domains, so we should avoid them wherever possible.  Fortunately, I don't see anything you've suggested that has any need for such settings.",
      "created_at" : "2015-11-18T01:39:16Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/7049#issuecomment-157569702",
      "id" : 157569702,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/7049",
      "updated_at" : "2015-11-18T01:39:16Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/157569702",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/858454?v=3",
         "events_url" : "https://api.github.com/users/gmaxwell/events{/privacy}",
         "followers_url" : "https://api.github.com/users/gmaxwell/followers",
         "following_url" : "https://api.github.com/users/gmaxwell/following{/other_user}",
         "gists_url" : "https://api.github.com/users/gmaxwell/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/gmaxwell",
         "id" : 858454,
         "login" : "gmaxwell",
         "organizations_url" : "https://api.github.com/users/gmaxwell/orgs",
         "received_events_url" : "https://api.github.com/users/gmaxwell/received_events",
         "repos_url" : "https://api.github.com/users/gmaxwell/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/gmaxwell/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/gmaxwell/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/gmaxwell"
      }
   },
   {
      "body" : ">     implementation depends on an external centralised network of relay servers\r\n>\r\n> Ah, that's a common misunderstanding-- and not true.\r\n\r\nAh, that's an incorrect statement of yours-- and not true.\r\n\r\nJust as there are many bitcoin 'centralised' pools, many 'centralised' relays are still 'centralised' relays.\r\nMoving it to being part of the bitcoin protocol is what is called 'decentralised' and then only if not using centralised 'networks' like the current relay.\r\n\r\n\r\n>     Early relay\r\n>\r\n> This is orthogonal to more efficient transmission and could just be done in the ordinary p2p protocol with, a \"unverified block\" message.\r\n\r\nIndeed and your suggestion that people should be using multiple daemons to solve this problem:\r\nhttps://github.com/bitcoin/bitcoin/issues/7015#issuecomment-156605612\r\nrequires this \"early relay\" since otherwise even a local set of (as you said):\r\n\r\n> to work around this today (run multiple daemons).\r\n\r\nwill relay to each other slowly since they must wait for full verification before passing the block on to any other local daemon\r\n\r\n\r\n>     and a separate client that talks to bitcoind.\r\n>\r\n> Our preferred method of adding new protocols is via gatewaying from another process, for reliability and security reasons.\r\n\r\nThat of course would be handled in an intelligent way - just as there are compiled in options for bitcoin core already - cli, qt, server (even compiling 'out' wallet)\r\nIn this case, since the client would require a lot of bitcoin core, it would be a bad design to make that some other project requiring a second implementation of the rules already in bitcoin core.\r\nIt could indeed be another program compilable with bitcoin core.\r\nThe trust design would allow levels - and thus the 'relay client' would be a lot of bitcoin core including the code that performs the various checks in core applied before relaying the block, according to the trust level requirements.\r\n\r\n\r\n>     such a network similar to the one that already exists that you could\r\n>     configure in a higher trust rating based\r\n>\r\n> In general our experience suggests that trust settings are black magic that cannot be configured correctly even by experts-- that even trusted things fail, and their doing so magnifies fault domains, so we should avoid them wherever possible. Fortunately, I don't see anything you've suggested that has any need for such settings.\r\n\r\nI'm not sure what grade school you experienced your methods of software design, or who wrote software that you consider black magic, but dumbing down software and limiting it's performance because **YOU** believe you are unable to understand the concept of trust, sounds like a bad idea to me.\r\n\r\nIn fact even in the current design there is a rather obvious point of trust that could implement the relaying of non-fully verified blocks to your own list of bitcoinds - that would be a block submitted to the RPC - that already has a trust given to it to allow access to the RPC\r\n\r\nThe use of not relaying something, is to save the target from checking it, when you consider it invalid. Relaying something, that you may rarely consider bad, means that those who receive it must check it ... as they already do with everything else they receive.\r\n\r\nAs stated here: https://github.com/bitcoin/bitcoin/issues/7015#issuecomment-156605612\r\nThere is indeed a very clear need for it in **your** 'opinion' of how to solve that problem, without resorting to a simple improvement of the code, that I stated there: https://github.com/bitcoin/bitcoin/issues/7015#issuecomment-157942182\r\n\r\nIn that example given, that raised the issue, and your 'supposed' solution to it, in fact what currently happens is work is supplied that is already stale even though bitcoin core code has the data that knows this in an extremely high percentage of those cases, but due to some unexplained locking failure of understanding, it's decided ok to increase network divergence.\r\n\r\nIf you had multiple bitcoinds, and didn't submit the block to the getblocktemplate bticoind, i.e. only submit the block to another one (or more) to process, and then be given back to the getblocktemplate source bitcoind via those, that would double the amount of time spent working on stale work.",
      "created_at" : "2015-11-28T12:36:11Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/7049#issuecomment-160289860",
      "id" : 160289860,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/7049",
      "updated_at" : "2015-11-28T12:36:11Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/160289860",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/1059166?v=3",
         "events_url" : "https://api.github.com/users/kanoi/events{/privacy}",
         "followers_url" : "https://api.github.com/users/kanoi/followers",
         "following_url" : "https://api.github.com/users/kanoi/following{/other_user}",
         "gists_url" : "https://api.github.com/users/kanoi/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/kanoi",
         "id" : 1059166,
         "login" : "kanoi",
         "organizations_url" : "https://api.github.com/users/kanoi/orgs",
         "received_events_url" : "https://api.github.com/users/kanoi/received_events",
         "repos_url" : "https://api.github.com/users/kanoi/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/kanoi/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/kanoi/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/kanoi"
      }
   }
]
