[
   {
      "body" : "> implementation depends on an external centralised network of relay servers\r\n\r\nAh, that's a common misunderstanding-- and not true. Matt does run a well maintained public network of nodes running the protocol; but it has no dependence on it. And anyone can run the same software.\r\n\r\nWe've considered it a goal to include more efficient block relaying in core though, and have mostly just been waiting for the protocols implementing it to mature.\r\n\r\n> Compression - binary data, and also compression of that data \r\n\r\nThe bitcoin p2p protocol is already binary. Traditional data compression is not terribly useful except in the presence of address reuse, and not needed over and above mempool relative differential transmission-- which is critical to get any efficiency gain at all.\r\n\r\n> Early relay\r\n\r\nThis is orthogonal to more efficient transmission and could just be done in the ordinary p2p protocol with, a \"unverified block\" message.  Luke-jr implemented this a couple years ago but it provided no meaningful speedup at the time (presumably due to other delay factors which we've since eliminated).  So long as all parties involved know they're getting something non-validated, there isn't much harm in passing it along; as a combination of POW, chain consistency (e.g. extends the current tip), and serialization rules is enough to prevent denial of service.\r\n\r\n> and a separate client that talks to bitcoind.\r\n\r\nOur preferred method of adding new protocols is via gatewaying from another process, for reliability and security reasons. \r\n\r\n> such a network similar to the one that already exists that you could configure in a higher trust rating based\r\n\r\nIn general our experience suggests that trust settings are black magic that cannot be configured correctly even by experts-- that even trusted things fail, and their doing so magnifies fault domains, so we should avoid them wherever possible.  Fortunately, I don't see anything you've suggested that has any need for such settings.",
      "created_at" : "2015-11-18T01:39:16Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/7049#issuecomment-157569702",
      "id" : 157569702,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/7049",
      "updated_at" : "2015-11-18T01:39:16Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/157569702",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/858454?v=3",
         "events_url" : "https://api.github.com/users/gmaxwell/events{/privacy}",
         "followers_url" : "https://api.github.com/users/gmaxwell/followers",
         "following_url" : "https://api.github.com/users/gmaxwell/following{/other_user}",
         "gists_url" : "https://api.github.com/users/gmaxwell/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/gmaxwell",
         "id" : 858454,
         "login" : "gmaxwell",
         "organizations_url" : "https://api.github.com/users/gmaxwell/orgs",
         "received_events_url" : "https://api.github.com/users/gmaxwell/received_events",
         "repos_url" : "https://api.github.com/users/gmaxwell/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/gmaxwell/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/gmaxwell/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/gmaxwell"
      }
   }
]
