{
   "assignee" : null,
   "body" : "This is the first (main) part of a major rewrite of our build and release process: the dependencies builder. See the README in the depends folder for more detailed info. It unifies many of our build procedures so that they may be re-used for similar purposes. The major points are:\r\n\r\n- Pull-tester and Gitian build processes have been unified.\r\n- Pull-tester can test all possible configs on all supported OSâs.\r\n- All dependencies are now built with unified recipes. No more hackish per-target shell scripts. This also means that release binaries will share the exact same dependency versions, rather than a random assortment as they are now.\r\n- Gitian builds are now painless and require no intervention since the results are chained together.\r\n- Dependencies are no longer a local issue for the the pull-tester. Everything can be handled in git alone. Anyone can deploy their own pull-tester if desired.\r\n- Devs may elect to use these dependencies rather than installing them via their OS. This is especially helpful on OSX as it avoids the need for homebrew/macports.\r\n\r\nLinux x64 and Mac x64 are supported build environments. Building should work from anywhere, it just hasnât been a priority to actively work outside of those two yet, so the paths haven't been tested.\r\n\r\nBuild-side tools may either be installed locally or built as native dependencies. For example, the linux/win builds use locally installed gcc/mingw, but the OSX build builds and installs its own clang-based toolchain. Ideally all local build-side dependencies would be removed, but that can come down the road if it proves necessary.\r\n\r\nThe dependencies builder creates a cached payload for each package that it builds. Each is automatically rebuilt as needed, either when the build recipe or its dependencies are changed. Old payloads are automatically cleaned. The result is a set of files that are automatically glued together into a prefix suitable for building Bitcoin. This process is entirely automated and deterministic, suitable for running before each  Bitcoin build. If nothing has changed, it completes in less than a second.\r\n\r\nA POC pull-tester has been setup to use them: https://travis-ci.org/theuni/bitcoin/builds . It caches these packages and re-uses them as necessary (note that caching is not currently happening due to some Travis account restrictions, Iâm actively working with the Travis guys on this. Once this is in place builds will only take a few min). The end-result is that Bitcoin is always built with a known set of dependencies, which are entirely controlled by us. No files from the build-machine are ever used. This means that the pull-tester can be OS/distro/architecture agnostic, so we donât end up in a situation (as we are currently) where the pull-tester is a static environment that canât be touched.\r\n\r\nGitian has been made to use these dependencies as well. Now, Gitian releases are built with the exact same procedure as the pull-tester, making dogfooding much easier. As mentioned for the pull-tester above, this lifts the OS restriction on Gitian, so weâre free to move to more recent distros/releases. Builds have been verified as deterministic locally, but I havenât yet compared with non-local builds. Also worth mentioning, because we build all dependencies ourselves in a sandbox, a single base image can be used for all builds.\r\n\r\nThe new Gitian descriptors have not been included here, they will come in as a separate PR. However, the changes to enable our build-cache have been accepted upstream: https://github.com/devrandom/gitian-builder/pull/62\r\n\r\nWith this new version, the sources are fetched by the dependencies builder, and cached for re-use. Existing files in the inputs folder will not be used, so the first build will take a good big longer.\r\n\r\n\r\nTODO:\r\nEnable the travis builds. I'm currently working with Travis on this, I hope to have it ready in the next week.",
   "closed_at" : "2014-08-11T15:39:02Z",
   "closed_by" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/126646?v=3",
      "events_url" : "https://api.github.com/users/laanwj/events{/privacy}",
      "followers_url" : "https://api.github.com/users/laanwj/followers",
      "following_url" : "https://api.github.com/users/laanwj/following{/other_user}",
      "gists_url" : "https://api.github.com/users/laanwj/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/laanwj",
      "id" : 126646,
      "login" : "laanwj",
      "organizations_url" : "https://api.github.com/users/laanwj/orgs",
      "received_events_url" : "https://api.github.com/users/laanwj/received_events",
      "repos_url" : "https://api.github.com/users/laanwj/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/laanwj/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/laanwj/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/laanwj"
   },
   "comments" : 32,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/4592/comments",
   "created_at" : "2014-07-26T18:16:56Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/4592/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/pull/4592",
   "id" : 38823246,
   "labels" : [
      {
         "color" : "5319e7",
         "name" : "Build system",
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/labels/Build%20system"
      }
   ],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/4592/labels{/name}",
   "locked" : false,
   "milestone" : null,
   "number" : 4592,
   "pull_request" : {
      "diff_url" : "https://github.com/bitcoin/bitcoin/pull/4592.diff",
      "html_url" : "https://github.com/bitcoin/bitcoin/pull/4592",
      "patch_url" : "https://github.com/bitcoin/bitcoin/pull/4592.patch",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/pulls/4592"
   },
   "state" : "closed",
   "title" : "Add dependencies builder for pull-tester, gitian, easy cross-dev",
   "updated_at" : "2014-11-09T13:18:53Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/4592",
   "user" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/417043?v=3",
      "events_url" : "https://api.github.com/users/theuni/events{/privacy}",
      "followers_url" : "https://api.github.com/users/theuni/followers",
      "following_url" : "https://api.github.com/users/theuni/following{/other_user}",
      "gists_url" : "https://api.github.com/users/theuni/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/theuni",
      "id" : 417043,
      "login" : "theuni",
      "organizations_url" : "https://api.github.com/users/theuni/orgs",
      "received_events_url" : "https://api.github.com/users/theuni/received_events",
      "repos_url" : "https://api.github.com/users/theuni/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/theuni/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/theuni/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/theuni"
   }
}
