[
   {
      "author_association" : "MEMBER",
      "body" : "What is the version (pass `-version` on the command line)? Did you modify the source code? What is `gettxoutsetinfo`?\r\n\r\nOtherwise, I am pretty sure this is  caused by the same underlying issue that also causes #25800 ",
      "created_at" : "2022-08-16T08:55:23Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25857#issuecomment-1216339291",
      "id" : 1216339291,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25857",
      "node_id" : "IC_kwDOABII585If91b",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1216339291/reactions"
      },
      "updated_at" : "2022-08-16T08:55:23Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1216339291",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/6399679?v=4",
         "events_url" : "https://api.github.com/users/MarcoFalke/events{/privacy}",
         "followers_url" : "https://api.github.com/users/MarcoFalke/followers",
         "following_url" : "https://api.github.com/users/MarcoFalke/following{/other_user}",
         "gists_url" : "https://api.github.com/users/MarcoFalke/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/MarcoFalke",
         "id" : 6399679,
         "login" : "MarcoFalke",
         "node_id" : "MDQ6VXNlcjYzOTk2Nzk=",
         "organizations_url" : "https://api.github.com/users/MarcoFalke/orgs",
         "received_events_url" : "https://api.github.com/users/MarcoFalke/received_events",
         "repos_url" : "https://api.github.com/users/MarcoFalke/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/MarcoFalke/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/MarcoFalke/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/MarcoFalke"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "No modification of the sources, these are exactly like with \"git pull\" from this repo (with or without the patch for dbwrapper's logger, which allows going further, and seems to avoid overwriting the stack by allocating its buffer onlce on the hep and not on the stack)\r\n\r\n(So it is version v23.99.0-22d96d76ab02-dirty; it includes all the recent modifications found in current git HEAD).\r\nNote that I CANNOT use `gettxoutsetinfo` after this crash, the RPC thread is no longer running... So if you have a way to perform this call from gdb...\r\n\r\nMy opinion is that I am approaching the case where there's some temporary object on the stack used after it should have been freed) So may be #25800 is reladed to this one (which occurs much less ofter than without the small patches I proposed in #25800).\r\nNote also that in #25800, I propose to fully memset the buffer on the stack always with zeroes (possibly enlarging its size to more than 500 bytes), if it helps reproducing the bug faster.\r\n\r\nBut it seems that the bug reported here is an unexpected effect of the recursion in CoinsView::FetchCoin (without any protection offered by its associated exclusive lock: this occurs purely inside the same thread, if there's a lock on a mutex it is already owned and there's no check to count the number of times it has been requested and block it to a limit); I also see that FetchCoin uses an iterator on a range that may not accept some modifications inside the range made by a recursive call.\r\n\r\nNote that I can reproduce this bug even when I compile bitcoind with debug=true (the default is false), this occurs always on the same block height, and with no incoming connections (prevented by firewall rules), only outgoing connections to 2 full nodes, and without performing any RPC call (so this is not caused by RPC threads).\r\n\r\nNotice that this occurs just after detecting a \"fork block\".\r\n\r\nI wonder what is the validity of this line [src/coins.cpp:48] in CCoinsViewCache::FetchCoin(...):\r\n```\r\n    CCoinsMap::iterator ret = cacheCoins.emplace(std::piecewise_construct, std::forward_as_tuple(outpoint),\r\nstd::forward_as_tuple(std::move(tmp))).first;\r\n```\r\nAnd how this reorganization made in a recursive call could affect the validy of the iterator in the parent call made via GetCoin(...). For me the semantics of std::move(tmp) is not clear. The doc says this is a **destructive read**, and the order of evaluation of this expression (which uses forward_as_tuple(outpoint) twice) may have already invalidated the state of the outpoint iterator, making tmp possibly invalid, or possibly the two forward iterators are overlapping, possibly processing the same transaction twice, including the secondtime after it was removed from the chain. These are some parts of the C++11 library that I do not understand clearly. Shouldn't we call std::move(tmp) first **before** creating the two tuples?\r\n\r\n\r\nI initially did not want to debug the program, so I still do not undestand entirely its logic.\r\nIf you have hints about possible patches I could make inside the code to get more useful traces, it would be really nice.\r\n\r\nThat code, using recursions and self-modifying iterators (with heavy C++11-based optimizations, apparently to avoid copy-contructions, by using move semantics and trying to get automatic management of the lifetime for indexed coin transactions, to determine when to delete or merge blocks indexed in the chainstate or purge/prune/split them) is really complex and I'm not sure to completely understand how all this works. It seems that some objects are deleted too early, because their references are \"lost\" in the middle, allowing some objects (still persisting somewhere on the stack after a function return) to be deleted too early, or being unexpectedly overwritten anywhere elsewhere in the application, if this is a case of \"use-after-free\" (e.g. if some coin transactions checked here fall on the starting or ending boundary between two successive \"blocks\" in the chainstate cache).\r\n",
      "created_at" : "2022-08-16T10:38:42Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25857#issuecomment-1216463486",
      "id" : 1216463486,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25857",
      "node_id" : "IC_kwDOABII585IgcJ-",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1216463486/reactions"
      },
      "updated_at" : "2022-08-16T14:31:05Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1216463486",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/1387035?v=4",
         "events_url" : "https://api.github.com/users/verdy-p/events{/privacy}",
         "followers_url" : "https://api.github.com/users/verdy-p/followers",
         "following_url" : "https://api.github.com/users/verdy-p/following{/other_user}",
         "gists_url" : "https://api.github.com/users/verdy-p/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/verdy-p",
         "id" : 1387035,
         "login" : "verdy-p",
         "node_id" : "MDQ6VXNlcjEzODcwMzU=",
         "organizations_url" : "https://api.github.com/users/verdy-p/orgs",
         "received_events_url" : "https://api.github.com/users/verdy-p/received_events",
         "repos_url" : "https://api.github.com/users/verdy-p/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/verdy-p/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/verdy-p/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/verdy-p"
      }
   },
   {
      "author_association" : "MEMBER",
      "body" : "> No modification of the sources,\r\n\r\n> So it is version v23.99.0-22d96d76ab02-dirty\r\n\r\n\"dirty\" means you modified it\r\n\r\n> Note that I CANNOT use gettxoutsetinfo\r\n\r\nYou can use it after a restart and then compare the output with the expected output at that height (from another node)",
      "created_at" : "2022-08-16T14:36:03Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25857#issuecomment-1216725814",
      "id" : 1216725814,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25857",
      "node_id" : "IC_kwDOABII585IhcM2",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1216725814/reactions"
      },
      "updated_at" : "2022-08-16T14:36:03Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1216725814",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/6399679?v=4",
         "events_url" : "https://api.github.com/users/MarcoFalke/events{/privacy}",
         "followers_url" : "https://api.github.com/users/MarcoFalke/followers",
         "following_url" : "https://api.github.com/users/MarcoFalke/following{/other_user}",
         "gists_url" : "https://api.github.com/users/MarcoFalke/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/MarcoFalke",
         "id" : 6399679,
         "login" : "MarcoFalke",
         "node_id" : "MDQ6VXNlcjYzOTk2Nzk=",
         "organizations_url" : "https://api.github.com/users/MarcoFalke/orgs",
         "received_events_url" : "https://api.github.com/users/MarcoFalke/received_events",
         "repos_url" : "https://api.github.com/users/MarcoFalke/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/MarcoFalke/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/MarcoFalke/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/MarcoFalke"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "Dirty means that I have applied the two patches described  in #25800 (and only those) (on the dbwrapper, and missing initializers to 0 for piece of mind). I think they are safe, but without them, I have the crashes occuring much sooner.\r\n\r\nAlso I don't need to execute a RPC `gettxoutsetinfo` because the log above already shows the block heights in the gdb output.\r\n\r\n```\r\nConsensus::CheckTxInputs (tx=..., state=..., inputs=..., nSpendHeight=661434, txfee=@0x7fff3338dcd0: 0)\r\n```\r\n\r\nand the debug.log output (just before the crash and I get the stack trace in gdb) also shows:\r\n\r\n```\r\n2022-08-16T08:41:09.703806Z [loadblk] [validationinterface.cpp:227] [BlockConnected] [validation] Enqueuing BlockConnected: block hash=0000000000000000000b5996770f8489d67422b9797569fc4f7ff78d06029943 block height=661433\r\n```\r\nSo this has crashed when processing  block height=661434 (the previous height was successfully processed). However that still does not explain anything (unless you know how to inspect precisely what is so special for the existing block at that height in the main chain).\r\n\r\n----\r\n\r\nLater I've tried to detect when CCoinsViewCache::FetchCoin recurses: I've just used a global static counter=0, and I increment it just before line [src/coins.cpp:48] and decrement it just after (this global static counter is safe as there's a single thread calling that function, at least in the IBD phase; I do not modify any other varaible or object). Additionally I perform a basic check `if (counter)` just before the increment to see its value see if I need to log it with a basic `LogPrintf(\"Recurse %d\", counter);`).\r\n\r\nThe result is that this line [src/coins.cpp:48] is extremely rarely reached (this is apparently when a transaction is not fully spent and its parent is not already in the cache, but may be very old and has been purged from the cache, forcing it to be reloaded, and changing the current view of the cache which has unexpectedly changed in the parent of the recursive call). It passes well most of the time, but when it crashes, this is always when there's been some pruning in the dblevel cache (because it was full) to allow another block to be loaded (in which case the cache may contain the data of any other unrelated block and no longer the data of the block being processed).\r\n\r\nThere's apparently nothing in CCoinsViewCache that instructs leveldb to NOT purge the current block from its cache, if you call FetchCoin() multiple times to load blocks of parent transactions (we have not kept any local copy of that block when processing it, we apparently treat it directly from the cache view). Also note that when purging the cache in LevelDB, this does not necessarily invalidates the virtual memory addresses used to map a block file, that virtual address may be reused for newer blocks loaded just after.\r\n\r\nWhat I am attempting to find is a reproductive case, because you can't find any one since long (but such strange crashes or corruptions have been experimented by MANY people if you look at online forums, complaining that IBD never succeeds; they were all replied that their machine would not be reliable, but I don't think this is the case for most of them; so all of these users have just abandoned). This bug seems to be very sensitive to memory usage (notably the fill level of the dbcache, so it depends on how much memory you've configured for it; but this cache fill level is ALSO sensitive to the current network activity, notably when running with default options that accept incoming connections which may perform requests to random blocks no longer present in the cache, including \"getheaders\" requests coming from other remote nodes in IBD phase).\r\n\r\nAnd may be this is related to the recent bug #25632 reported, probably",
      "created_at" : "2022-08-16T15:38:16Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25857#issuecomment-1216809492",
      "id" : 1216809492,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25857",
      "node_id" : "IC_kwDOABII585IhwoU",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1216809492/reactions"
      },
      "updated_at" : "2022-08-16T18:50:53Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1216809492",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/1387035?v=4",
         "events_url" : "https://api.github.com/users/verdy-p/events{/privacy}",
         "followers_url" : "https://api.github.com/users/verdy-p/followers",
         "following_url" : "https://api.github.com/users/verdy-p/following{/other_user}",
         "gists_url" : "https://api.github.com/users/verdy-p/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/verdy-p",
         "id" : 1387035,
         "login" : "verdy-p",
         "node_id" : "MDQ6VXNlcjEzODcwMzU=",
         "organizations_url" : "https://api.github.com/users/verdy-p/orgs",
         "received_events_url" : "https://api.github.com/users/verdy-p/received_events",
         "repos_url" : "https://api.github.com/users/verdy-p/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/verdy-p/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/verdy-p/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/verdy-p"
      }
   },
   {
      "author_association" : "NONE",
      "body" : "> You can use it after a restart and then compare the output with the expected output at that height (from another node)\r\n\r\nNot really:\r\n- if we use another node, it will have to be able to connect to the faulting node, which it does not allow before it has checked some parts (te 6 last blocks), possibly rearranged them to collect the tips, and then restarted to reindex the chain. As well the RPC server will take some time to be responsive (initially the node has other priorities, including making outgoing connections to other fill nodes, but not accepting an incloming connection).\r\n- if we just restart the faulting node, the same appears, but its local RPC client (bitcoin-cli) will also have to wait.\r\n\r\nIn both cases, we get the last value for 'gettxoutsetinfo' too late, and it may not even be there at all after the initial recovery.\r\nSo we have to rely on what was last displayed by the fauling node in its log, or what could be retrieved in the debugger by looking at the stack trace when the fatal exception occured (and this is exactly what I did above).\r\n\r\nThe alternative is to use a third party leveldb tool to scan its database without making any write to it (no attempt to repair it, just like what bitcoind does when we start it: the reason of the fault is lost at that time).\r\n\r\nSo the best thing is always using logs, or a debuggger (that is not possible easily with the released version as debug info have been stripped), or other tracing systems if they are implemented (like DTRACE, running with a \"eBPF\" helper of the kernel on Linux). To get enough info we just have -debug=all which must be activated before the crash, but if this takes a very long time before reaching the case where there's a crash, we need a giant log file.\r\n\r\nThe alternative is to run the daemon with -nodebuglog, but then capture the output no the stadnard terminal with a program that will preserve some significant amount of logs in a rotating buffer (e.g. the last 10000 lines, hoping that this will be enough). Buteven in this case, we may not capture enough info even with \"-debug=all\": the only solution in that case is to modify the sources to add additional custom logs (with non-destructive tests to perform a useful selection of cases we are suspecting; notably we should compile the debug option to enable \"asserts\", and safety checks that may be alerady present or added for that purpose). This requires some modifications of the program, so isolating bugs is not evident, and without it it's hard to isolate problems, and finally regenerate the conditions in a test case that will be added to the project, to make sure it won't happen again for future releases.\r\n\r\nIf you see better solutions, I'm ready to hear! (notably propose patches that I could insert in the sources, or that could be hosted in Git in some branch, so that I can compile with them to get better diagnostic, and finally isolate the bug, because I'm now sure this is a bug of BitCoin Core itself, and not even a bug of its upstream dependant libraries or of the OSes or machines on which I've tested the current releases without any success since months and after trying many configurations).",
      "created_at" : "2022-08-16T18:48:34Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/25857#issuecomment-1217017666",
      "id" : 1217017666,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/25857",
      "node_id" : "IC_kwDOABII585IijdC",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1217017666/reactions"
      },
      "updated_at" : "2022-08-16T18:49:28Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1217017666",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/1387035?v=4",
         "events_url" : "https://api.github.com/users/verdy-p/events{/privacy}",
         "followers_url" : "https://api.github.com/users/verdy-p/followers",
         "following_url" : "https://api.github.com/users/verdy-p/following{/other_user}",
         "gists_url" : "https://api.github.com/users/verdy-p/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/verdy-p",
         "id" : 1387035,
         "login" : "verdy-p",
         "node_id" : "MDQ6VXNlcjEzODcwMzU=",
         "organizations_url" : "https://api.github.com/users/verdy-p/orgs",
         "received_events_url" : "https://api.github.com/users/verdy-p/received_events",
         "repos_url" : "https://api.github.com/users/verdy-p/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/verdy-p/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/verdy-p/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/verdy-p"
      }
   }
]
