{
   "assignee" : null,
   "body" : "One of the most annoying things about trying to maintain wallet backups is the fact that every time you unlock a wallet the key pool gets automatically refilled, thus making any existing backups of the wallet keys obsolete. If you call getnewaddress on a locked wallet, no problem - but the moment you unlock it, your wallet backups are out of date...no warning is given to user. Sooner or later that backed up wallet will expire, by which time we better hope the user had the foresight, understanding, discipline, and memory to have made a new backup.\r\n\r\nAs things currently stand, the user must either keep track of when the backed up keypool is exhausted and remember to make a backup before the new keys are used - or must make a backup after every few transactions to be certain the backed up keypool is never exhausted. And let's be honest about it - very few users do either of these things. They are tedious and annoying. I only do them because they're far less tedious or annoying than attempting to recover lost keys.\r\n\r\nThe user now has the choice to disable automatic refilling of the keypool by adding the following line to bitcoin.conf:\r\n\r\nnoautofillkeypool=1\r\n\r\nThis effectively disables all automatic key generation, requiring the user to manually run keypoolrefill to replenish the wallet when the key pool runs low or a new wallet is created.The keypoolrefill command has been conveniently exposed in the GUI as well. This ensures that all generated keys can be easily and conveniently backed up in a timely fashion, with confidence that the backup has been made properly and will never expire without warning (at least as far as keys - synchronizing history and account labels are separate issues that this pull request does not address).\r\n\r\nWe probably shouldn't be allowing users to generate new keys without prompting them to make backups (or automatically making the backups for them); certainly not in the GUI and probably not in the RPC either (at least not without requiring an override flag or an additional call). It obviously makes more sense to do backups in batch rather than after every single new transaction; after all, that's exactly the purpose of pregenerating a key pool in the first place.  I believe hiding this from users only does them a disservice. Anyone who is smart enough to use Bitcoin-Qt should have no problem understanding how to do this - and anyone who is incapable of doing this probably shouldn't be managing their own bitcoin keys in the first place. EVERYONE should be making proper backups of their signing keys. Exposing a wallet backup function without also giving users control over their keypool is giving them a tool that requires two hands to use properly but tying one of their hands behind their back.\r\n\r\nThis pull request simply makes the keypool feature which already exists properly usable. Having said that, with the expectation that some may disagree with my position, this new behavior is 100% opt-in -  if noautofillkeypool is not set in bitcoin.conf (or omitted), the app defaults to its old behavior thus ensuring full backward compatibility.\r\n\r\n![alt tag](http://blockhawk.net/screenshots/Bitcoin-Qt.png)\r\nView of Bitcoin-Qt interface with keypoolrefill feature exposed.\r\n\r\nTODO:\r\n- General: Automate backups when keypool runs low by, for instance, allowing the user to add one or more autobackupwallet=\\<destination\\> lines to the config file. The destination field should support protocols like sftp as well as removable media. Will require mechanism to prompt user or return an error if connection cannot be established, removable media is not present, or specified path is not found/invalid.\r\n\r\n- Bitcoin-Qt: Prompt user to refill pool when key pool is empty, prompt/remind user more aggressively to make backups, check key pool status before attempting operations that require new keys, add indicator to show how many keys are left in pool, add the ability to easily change the pool size from GUI, make it clear when errors are due to an empty key pool and show user proper procedure for refilling it and making a backup.\r\n\r\n- Bitcoin-Qt: Icon attribution for ![alt tag](https://github.com/CodeShark/bitcoin/diff_blob/6b18ba00d265f544dd457a83fac0c930ae51c66a/src/qt/res/icons/keypair.png?raw=true), taken from http://i1-win.softpedia-static.com/screenshots/32x32-Free-Design-Icons_1.png?1358761381",
   "closed_at" : "2014-01-29T08:20:43Z",
   "closed_by" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/126646?v=3",
      "events_url" : "https://api.github.com/users/laanwj/events{/privacy}",
      "followers_url" : "https://api.github.com/users/laanwj/followers",
      "following_url" : "https://api.github.com/users/laanwj/following{/other_user}",
      "gists_url" : "https://api.github.com/users/laanwj/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/laanwj",
      "id" : 126646,
      "login" : "laanwj",
      "organizations_url" : "https://api.github.com/users/laanwj/orgs",
      "received_events_url" : "https://api.github.com/users/laanwj/received_events",
      "repos_url" : "https://api.github.com/users/laanwj/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/laanwj/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/laanwj/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/laanwj"
   },
   "comments" : 11,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/2841/comments",
   "created_at" : "2013-07-21T04:53:19Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/2841/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/pull/2841",
   "id" : 17014934,
   "labels" : [],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/2841/labels{/name}",
   "locked" : false,
   "milestone" : null,
   "number" : 2841,
   "pull_request" : {
      "diff_url" : "https://github.com/bitcoin/bitcoin/pull/2841.diff",
      "html_url" : "https://github.com/bitcoin/bitcoin/pull/2841",
      "patch_url" : "https://github.com/bitcoin/bitcoin/pull/2841.patch",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/pulls/2841"
   },
   "state" : "closed",
   "title" : "Added new config option noautofillkeypool.",
   "updated_at" : "2014-01-29T08:20:43Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/2841",
   "user" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/894059?v=3",
      "events_url" : "https://api.github.com/users/CodeShark/events{/privacy}",
      "followers_url" : "https://api.github.com/users/CodeShark/followers",
      "following_url" : "https://api.github.com/users/CodeShark/following{/other_user}",
      "gists_url" : "https://api.github.com/users/CodeShark/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/CodeShark",
      "id" : 894059,
      "login" : "CodeShark",
      "organizations_url" : "https://api.github.com/users/CodeShark/orgs",
      "received_events_url" : "https://api.github.com/users/CodeShark/received_events",
      "repos_url" : "https://api.github.com/users/CodeShark/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/CodeShark/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/CodeShark/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/CodeShark"
   }
}
