{
   "active_lock_reason" : null,
   "assignee" : null,
   "assignees" : [],
   "author_association" : "MEMBER",
   "body" : "Second-layers with time-sensitive transactions might see their propagation tampered by their counterparties in opportunistic or adversarial environments. Additionally, non-cooperatively fee-bumped chain of transactions might produce suboptimal miners block templates.\r\n\r\n## Motivation\r\n\r\nCurrently, replaced or evicted transactions out of the mempool are not kept in archive. Later transaction reception might invalidate again the replacement candidate letting a spend utxo free to be spent by the original replaced transaction.\r\n\r\nIt is possible to keep in bounded memory a list of all seen transactions, which have entered our mempool at least once at current mempool min fee (or weight-based mempool min fee on the last X period of time).\r\n\r\n- A transaction issuer on the network might broadcast a batch payout transaction paying many users outputs to user-selected wallets scriptpubkeys. Fee bumping responbility might be shared between the initial broadcaster RBF or payouts users CPFP. Current in-mempool chain package limits might prevent a higher-fee RBF than the sum of CPFP of replacing the chain of transactions or at th contrary the sum of CPFP entering the mempool after the RBF might be higher due to lack of coordination between the set of multi-party transactions participants.\r\n\r\n- Recently, p2p replacement attacks have come to awareness affecting second-layers with time-sensitive transactions where a counterparty can delay the confirmation of time-sensitive states until a more favorable ones become consensus final at the advantage of the attacker. In such situations the initial spend candidate of the channel funding output might be the best fee proposal after a full sequence of replacement have played out.\r\n\r\n## Design Questions\r\n\r\n### What Denial-of-Service vectors to consider ?\r\n\r\nA cache of replacement transaction will have to be DoS-resistant. Traversal of the cache should be efficient to avoid being a source of new DoS vectors, both memory and CPU validation. Transactions signatuters in the replacement cache could stay in a new cache we have already (like built from `CuckooCache` primitives) or existent one. New cluster-based algorithms can be leveraged to make traversal of replacement cache more efficient.\r\n\r\nReconciliation between replacement caches due to asymmetric transaction-relay network topology of block templates builders shouldn’t hamper on compact block validation.\r\n\r\n### What replacement cache expiration delay to consider ?\r\n\r\nAfter an epoch-based or height-based delay, transactions in the replacement cache might be definitively pruned out of node memory, until a subsequent automatic or manual re-broadcast by the transaction issuer. Currently, core's mempool expiration delay (`DEFAULT_MEMPOOL_EXPIRY_HOURS=336`) so 14 days time at max during which a transaction might stay in network mempools.\r\n\r\nExpiration delay value of the replacement cache might let opportunistic behavior happen in function of mempool cycles, where transaction issuers might delay a fee-bumping (RBF or CPFP) to trigger a \"resurrection\" of the cached transactions back in miners block templates, saving on the RBF penalty.\r\n\r\n### How to handle reorgs consistently ?\r\n\r\nIf we have one or two blocks of reorgs, which happen sometimes on mainnet, some transactions laying in the replacement cache might become stale, i.e a spent output does not exist anymore. In that situation, the replacement cache should be pruned in consequence to remove the staled transactions. Pruning parameters should be selected carefully to avoid low-hashrate miners provoking shallow reorgs to optimize their block templates, in a variant of a \"selffish\" miner attack.",
   "closed_at" : null,
   "closed_by" : null,
   "comments" : 0,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/28699/comments",
   "created_at" : "2023-10-21T01:33:47Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/28699/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/issues/28699",
   "id" : 1955198666,
   "labels" : [],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/28699/labels{/name}",
   "locked" : false,
   "milestone" : null,
   "node_id" : "I_kwDOABII5850ifbK",
   "number" : 28699,
   "performed_via_github_app" : null,
   "reactions" : {
      "+1" : 0,
      "-1" : 0,
      "confused" : 0,
      "eyes" : 0,
      "heart" : 0,
      "hooray" : 0,
      "laugh" : 0,
      "rocket" : 0,
      "total_count" : 0,
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/28699/reactions"
   },
   "repository_url" : "https://api.github.com/repos/bitcoin/bitcoin",
   "state" : "open",
   "state_reason" : null,
   "timeline_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/28699/timeline",
   "title" : "[brainstorm] replacement cache to optimize miners block templates",
   "updated_at" : "2023-10-21T01:33:47Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/28699",
   "user" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/23310655?v=4",
      "events_url" : "https://api.github.com/users/ariard/events{/privacy}",
      "followers_url" : "https://api.github.com/users/ariard/followers",
      "following_url" : "https://api.github.com/users/ariard/following{/other_user}",
      "gists_url" : "https://api.github.com/users/ariard/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/ariard",
      "id" : 23310655,
      "login" : "ariard",
      "node_id" : "MDQ6VXNlcjIzMzEwNjU1",
      "organizations_url" : "https://api.github.com/users/ariard/orgs",
      "received_events_url" : "https://api.github.com/users/ariard/received_events",
      "repos_url" : "https://api.github.com/users/ariard/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/ariard/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/ariard/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/ariard"
   }
}
