{
   "active_lock_reason" : null,
   "assignee" : null,
   "assignees" : [],
   "author_association" : "NONE",
   "body" : "# The Official Removal of the MIT License as Permitted by the MIT License:\r\n\r\n```\r\nproof:\r\nPublic Government Licenses are defined as permission, agreement, and permit.\r\nPrivate Licenses are defined as a contract between two parties over the rights of use.\r\nLicensing agreements between private parties involve one party allowing another to use, create or sell its products or intellectual property.\r\nA licensing agreement is a contract that allows one party (the licensee) to use and/or earn revenue from the property of the owner (the licensor).\r\nLicensing agreements are legal contracts that are written between two parties.\r\nSoftware agreements and Licenses are legally defined as contractual obligations.\r\nA licensing agreement is a contract between two parties.\r\nReports of Cases Determined in the Supreme Court: Volume 168\r\nLicense—Contract for the purpose of carrying out tasks with private property which would otherwise be illegal to perform.\r\n```\r\n\r\n## The Call for Responsibility of Humans by Finally Working Together Worldwide:\r\n\r\nSince the Supreme Court Defined License as a Contract; it has created a world of hurt for the open-source community. Google, Apple, MS, Amazon, and all of the big corporations are submitting for hundreds of thousands of patents, and they consist overwhelmingly of open source/non-patentable works. \r\n\r\nWhile software is not restricted to anyone with this license, so crypto shall not be hindered, it will restrict universities from stealing their students' inventions and patenting them. It allows for the original authors to have three years of exclusive publishing rights for their research verbatim. Since this project is old, that time has expired. The original claim of authorship/ownership shall remain with the same people/teams as before. Those with malicious intent could have taken over the entire crypto market legally. That option is too late now as the fork of this software has spread to every MIT license and nullified while replacing it with the Public Resource License. \r\n\r\nThe MIT licenses must be updated and replaced with this license as it has legal claim and authority to protect all MIT content. The claim of authorship remains with the discoverers, and authors: https://github.com/PublicResourceLicense/PublicResourceLicense/blob/main/prl%20license.txt\r\n\r\n## My Refute to the Law Which Will Try to Say This License is Invalid:\r\n\r\nI authored this license strictly from contracts held up by the U.S., namely the Veteran Affairs and Military Contracts. It appears most people have the idea that one little error cancels the entire license or contract. This is false according to verbiage within GOVERNMENT contracts. You can simply state that if anything is contradictory, then the outcome must be fair. Which is fair. \r\n\r\nThe Public Resource License defines itself as an individual document between two parties on behalf of humans and that every jurisdiction only has authority within their jurisdiction, and any license which becomes void or redefined does not affect any other Public Resource License.\r\n\r\nYou cannot place in a contract or license that you are completely free of any liability for any reason. This causes a paradox where you would be allowed to commit any crime that you wanted and not have to suffer any consequence. \r\n\r\nSince this contract is technically void, every single person who contributed code to Bitcoin, would have been liable for losses and the crimes of others. This contract however, but adhere to the fairness doctrine, which means if malicious intent was the goal. Then the license no longer gives you any protection. The license would have still remained as is until it was challenged, in which would have sent everything into the public domain which has shady avenues of being able to be trademarked. \r\n\r\nConsideration. There is no explicit consideration in the license and acts as if you dropped some trash, and therefore, you shall allow someone else to pick it up as you are not responsible for it. Consideration does not work in this case \r\n\r\nThe original researchers and contributors have authorship rights. Prior research will not be attributed to whoever tried to submit it. But it will give them credibility points. \r\n\r\nCopy this file verbatim to other MIT repositories and upload the PRlicense to that repository. Thank You. ",
   "closed_at" : "2022-02-12T11:53:23Z",
   "closed_by" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/863730?v=4",
      "events_url" : "https://api.github.com/users/fanquake/events{/privacy}",
      "followers_url" : "https://api.github.com/users/fanquake/followers",
      "following_url" : "https://api.github.com/users/fanquake/following{/other_user}",
      "gists_url" : "https://api.github.com/users/fanquake/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/fanquake",
      "id" : 863730,
      "login" : "fanquake",
      "node_id" : "MDQ6VXNlcjg2MzczMA==",
      "organizations_url" : "https://api.github.com/users/fanquake/orgs",
      "received_events_url" : "https://api.github.com/users/fanquake/received_events",
      "repos_url" : "https://api.github.com/users/fanquake/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/fanquake/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/fanquake/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/fanquake"
   },
   "comments" : 0,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/24327/comments",
   "created_at" : "2022-02-12T11:38:28Z",
   "draft" : false,
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/24327/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/pull/24327",
   "id" : 1133920317,
   "labels" : [],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/24327/labels{/name}",
   "locked" : false,
   "milestone" : null,
   "node_id" : "PR_kwDOABII584ymH5h",
   "number" : 24327,
   "performed_via_github_app" : null,
   "pull_request" : {
      "diff_url" : "https://github.com/bitcoin/bitcoin/pull/24327.diff",
      "html_url" : "https://github.com/bitcoin/bitcoin/pull/24327",
      "merged_at" : null,
      "patch_url" : "https://github.com/bitcoin/bitcoin/pull/24327.patch",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/pulls/24327"
   },
   "reactions" : {
      "+1" : 0,
      "-1" : 0,
      "confused" : 0,
      "eyes" : 0,
      "heart" : 1,
      "hooray" : 0,
      "laugh" : 0,
      "rocket" : 0,
      "total_count" : 1,
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/24327/reactions"
   },
   "repository_url" : "https://api.github.com/repos/bitcoin/bitcoin",
   "state" : "closed",
   "timeline_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/24327/timeline",
   "title" : "MIT Vulnerability from Lack of Definition and Escape from the Law.",
   "updated_at" : "2022-02-12T11:53:23Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/24327",
   "user" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/98574390?v=4",
      "events_url" : "https://api.github.com/users/PublicResourceLicense/events{/privacy}",
      "followers_url" : "https://api.github.com/users/PublicResourceLicense/followers",
      "following_url" : "https://api.github.com/users/PublicResourceLicense/following{/other_user}",
      "gists_url" : "https://api.github.com/users/PublicResourceLicense/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/PublicResourceLicense",
      "id" : 98574390,
      "login" : "PublicResourceLicense",
      "node_id" : "U_kgDOBeAgNg",
      "organizations_url" : "https://api.github.com/users/PublicResourceLicense/orgs",
      "received_events_url" : "https://api.github.com/users/PublicResourceLicense/received_events",
      "repos_url" : "https://api.github.com/users/PublicResourceLicense/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/PublicResourceLicense/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/PublicResourceLicense/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/PublicResourceLicense"
   }
}
