{
   "assignee" : null,
   "body" : "Bitcoin technology is great, and it won't be going away. So what if that network was used to secure an identity, our communications and - VOTES.\r\n\r\nA decentralized techno-republic lies within bitcoin technology and smarter people than me should be working on it.\r\n\r\n1) \"Mining\" is incentivized via money, a coin. Maybe bitcoin could adapt the rest of this, idk who controls bitcoin, but that coin would be the ideal coin to take on this responsibility I think.\r\n\r\n2) Mining does the following: Verifies coin transactions, secures communications via encryption, runs elections, validates votes\r\n\r\n3) What is an election? Nameless, faceless, voting history and verified accomplishments of the person that chose to throw their hat in the ring to be a public servant. Their spending and actions are public on the network ledger. When an election has concluded, the person is named and has a face. Its only anonymous during the election to curb propaganda\r\n\r\n4) Whats up with votes? Democracy sucks and doesn't work. You may agree or disagree with me that a pure democracy is a mobocracy. I think voting that those with validated scientific credentials get more voting power than non-scientists on certain issues having to do with complex science would make scientists representative in this case - making for a republic system or representative democracy. You could vote on anything prioritized by the network. \r\n\r\nIdeally something like this could even replace facebook.\r\n\r\n5) Elected Officials Office terms - There is no office terms, people can be voted in or out at anytime.\r\n\r\nThe goal:\r\nThe goal would be to eliminate all centralized government, worldwide, through attrition. The use of the decentralized, distributed, peer-to-peer republic, to return freedom to all inhabitants of earth. By creating a secure, protected network, where votes are validated by the network, propaganda fails to nameless/faceless candidates that are voted on based on merit and proven track record, communications and network activity are secured by strong encryption, spending and activities are 100% transparent recorded to the network ledger. There will be no pork, bills to long to read or understand, whenever needed, experts will be made representative via weighted voting, outcomes and debates will be rooted in facts - data, which can be accompanied with its corresponding statistical confidence and other pertinent attributes to aid in amicable outcomes all good people seek.\r\n\r\nWhat is required for this to work? Mass, widespread use, belief in the system, an excellent user-experience.\r\n\r\nEarly adopters - free software organizations, organizations with core legitimate goals in the interest of freedom, taxpayers that no longer wish to be enslaved for whatever % of their labor is collected and wasted via income tax.\r\n\r\nI have a unique and simple user-interface for this system, its kinda like a social network.\r\n\r\nThanks for reading. If you think this idea is worth spreading, spread it.",
   "closed_at" : "2014-05-05T06:42:41Z",
   "closed_by" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/126646?v=3",
      "events_url" : "https://api.github.com/users/laanwj/events{/privacy}",
      "followers_url" : "https://api.github.com/users/laanwj/followers",
      "following_url" : "https://api.github.com/users/laanwj/following{/other_user}",
      "gists_url" : "https://api.github.com/users/laanwj/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/laanwj",
      "id" : 126646,
      "login" : "laanwj",
      "organizations_url" : "https://api.github.com/users/laanwj/orgs",
      "received_events_url" : "https://api.github.com/users/laanwj/received_events",
      "repos_url" : "https://api.github.com/users/laanwj/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/laanwj/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/laanwj/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/laanwj"
   },
   "comments" : 1,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/4126/comments",
   "created_at" : "2014-05-05T01:57:48Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/4126/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/issues/4126",
   "id" : 32783136,
   "labels" : [],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/4126/labels{/name}",
   "locked" : false,
   "milestone" : null,
   "number" : 4126,
   "repository_url" : "https://api.github.com/repos/bitcoin/bitcoin",
   "state" : "closed",
   "title" : "decentralize and replace every government on earth",
   "updated_at" : "2014-05-05T06:42:41Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/4126",
   "user" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/6241559?v=3",
      "events_url" : "https://api.github.com/users/outsource/events{/privacy}",
      "followers_url" : "https://api.github.com/users/outsource/followers",
      "following_url" : "https://api.github.com/users/outsource/following{/other_user}",
      "gists_url" : "https://api.github.com/users/outsource/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/outsource",
      "id" : 6241559,
      "login" : "outsource",
      "organizations_url" : "https://api.github.com/users/outsource/orgs",
      "received_events_url" : "https://api.github.com/users/outsource/received_events",
      "repos_url" : "https://api.github.com/users/outsource/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/outsource/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/outsource/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/outsource"
   }
}
