{
   "assignee" : null,
   "body" : "As I understand it, 0.8.6 raised the maximum block size from 300KB to 350KB. According to current charts (http://www.quandl.com/BCHAIN/AVBLS-Bitcoin-Average-Block-Size) this maximum will be reached imminently.\r\n\r\nThere is currently no community consensus on whether to raise the block limit, but if this is not done, many investors in bitcoin (who are investing on the understanding that it will operate as a currency) are about to lose confidence, and the price will likely drop significantly. However, if sufficient nodes, exchanges and merchants (many of whom use bitcoin like a currency) when the metaphorical bitcoin boat hits the iceberg, it can split in two rather than sink. Exchanges can prepare for this event by being ready to trade both versions of bitcoin post-fork (as well as requiring people to clarify which version of bitcoin their buy orders are for prior to the fork happening) and the market will automatically derive on the prices of each type of bitcoin. The two bitcoins types that emerge from the fork would both be useful and needed, with the upscaled one providing more day-to-day currency qualities whereas the unscaled bitcoin (350K limit) would provide less frequent transactions and would continue to be able to run on lower-spec hardware.\r\n\r\nI believe action needs to happen as soon as possible as it may already be too late to avert significant impact on the network once the average block size required exceeds that which is available.\r\n\r\nWaiting for a consensus isn't ideal as this is unlikely to happen across the entire bitcoin community. A hardfork with two bitcoins is far more likely to survive the limit being reached than only one which will struggle. A analogy would be diversity in crops surviving adversity better than the hybrid crops which were not genetically sufficiently dissimilar.\r\n\r\nIn the same way that the inadvertent hardfork of last year was managed, I think with sufficient community collaboration this could happen in a timely manner, only this time it lacks the same sort of urgency and is more preventative than reactive, that is, unless we wait. (Frog in boiling water analogy comes to mind).\r\n\r\nThe code changes for this could be minimal with the focus simply being to increase the block size to something that will survive beyond the current limit, perhaps using an algorithm to set the max size to a slowly increasing amount based on the average over the last 2 weeks.\r\n\r\nI think this is important as many of the bitcoin advocates I meet recently are advocating bitcoin as a currency for use in situations such as buying relatively low-cost items (e.g. a cup of coffee) and so due to this lack of understanding that is prevalent within the bitcoin community, it may be that this assumption about the use of bitcoin forms the majority of investors currently investing in bitcoin.\r\n\r\nIn order to implement this, there could be a simple command line argument to set the type of bitcoin desired, no actual fork of the project would necessarily be needed.\r\n\r\nSuggested names for the twp bitcoins might be: Bitcoin Gold and Bitcoin Currency, Bitcoin 1 and Bitcoin 2, Bitcoin 1M and Bitcoin 1G. Just suggestions. The name is less important than the urgency in implementing this, but it's pretty important to avoid confusion. (Technically Bitcoin 1M is incorrect given that it's currently 350K).",
   "closed_at" : "2014-05-10T10:42:47Z",
   "closed_by" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/126646?v=3",
      "events_url" : "https://api.github.com/users/laanwj/events{/privacy}",
      "followers_url" : "https://api.github.com/users/laanwj/followers",
      "following_url" : "https://api.github.com/users/laanwj/following{/other_user}",
      "gists_url" : "https://api.github.com/users/laanwj/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/laanwj",
      "id" : 126646,
      "login" : "laanwj",
      "organizations_url" : "https://api.github.com/users/laanwj/orgs",
      "received_events_url" : "https://api.github.com/users/laanwj/received_events",
      "repos_url" : "https://api.github.com/users/laanwj/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/laanwj/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/laanwj/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/laanwj"
   },
   "comments" : 2,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/4168/comments",
   "created_at" : "2014-05-10T10:01:47Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/4168/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/issues/4168",
   "id" : 33233984,
   "labels" : [
      {
         "color" : "ebd775",
         "name" : "Brainstorming",
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/labels/Brainstorming"
      }
   ],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/4168/labels{/name}",
   "locked" : false,
   "milestone" : null,
   "number" : 4168,
   "state" : "closed",
   "title" : "Maximum block size limit soon to be reached.",
   "updated_at" : "2014-05-10T11:37:21Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/4168",
   "user" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/1530283?v=3",
      "events_url" : "https://api.github.com/users/rebroad/events{/privacy}",
      "followers_url" : "https://api.github.com/users/rebroad/followers",
      "following_url" : "https://api.github.com/users/rebroad/following{/other_user}",
      "gists_url" : "https://api.github.com/users/rebroad/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/rebroad",
      "id" : 1530283,
      "login" : "rebroad",
      "organizations_url" : "https://api.github.com/users/rebroad/orgs",
      "received_events_url" : "https://api.github.com/users/rebroad/received_events",
      "repos_url" : "https://api.github.com/users/rebroad/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/rebroad/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/rebroad/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/rebroad"
   }
}
