{
   "assignee" : null,
   "assignees" : [],
   "author_association" : "NONE",
   "body" : "                                Лицензия Apache\r\n                           Версия 2.0, январь 2018\r\n                        \r\n\r\n   УСЛОВИЯ ИСПОЛЬЗОВАНИЯ, ВОСПРОИЗВОДСТВА И РАСПРОСТРАНЕНИЯ\r\n\r\n   1. Определения.\r\n\r\n      «Лицензия» означает условия использования, воспроизведения,\r\n      и распределения, как определено в разделах 1-9 настоящего документа.\r\n\r\n      «Лицензиар» означает правообладателя или юридическое лицо,\r\n      владелец авторских прав, предоставляющий Лицензию.\r\n\r\n      «Юридическое лицо» означает союз действующего лица и все\r\n      другие субъекты, которые контролируют, контролируются или находятся под общим\r\n      контроль с этим объектом. Для целей этого определения,\r\n      «контроль» означает (i) силу, прямую или косвенную, чтобы вызвать\r\n      руководство или управление такой организацией, будь то по контракту или\r\n      в противном случае, или (ii) владение пятьюдесятью процентами (50%) или более\r\n      или (iii) преимущественное право собственности на такое лицо.\r\n\r\n      «Вы» (или «Ваш») означает физическое или юридическое лицо\r\n      используя разрешения, предоставленные настоящей Лицензией.\r\n\r\n      Форма «Источник» означает предпочтительную форму для внесения изменений,\r\n      включая, но не ограничиваясь, исходный код программного обеспечения, документацию\r\n      источника и файлов конфигурации.\r\n\r\n      Форма «Объект» означает любую форму,\r\n      преобразование или перевод исходной формы, включая, но\r\n      не ограничиваясь скомпилированным объектным кодом, сгенерированной документацией,\r\n      и конверсии с другими типами носителей.\r\n\r\n      «Работа» означает произведение авторства, будь то в Источнике или\r\n      Форма объекта, предоставляемая по лицензии, как указано\r\n      уведомление об авторских правах, которое включено в работу или прилагается к ней\r\n      (пример приведен в Приложении ниже).\r\n\r\n      «Производные произведения» означают любую работу, будь то в источнике или объекте\r\n      формы, которая основана на (или получена из) Работе и для которой\r\n      редакционные изменения, аннотации, разработки или другие изменения\r\n      представляют в целом оригинальную авторскую работу. Для целей\r\n      настоящей Лицензии, Производные Работы не должны включать работы, которые остаются\r\n      отделяться от или просто связывать (или связывать по имени) с интерфейсами,\r\n      Работы и производные работы.\r\n\r\n      «Вклад» означает любую авторскую работу, в том числе\r\n      оригинальная версия Работы и любые изменения или дополнения\r\n      к его Рабочим или Производным работам, то есть намеренно\r\n      представленный Лицензиару для включения в Работу владельцем авторских прав\r\n      или физическим лицом или юридическим лицом, уполномоченным представлять от имени\r\n      владелец авторских прав. Для целей этого определения, «представленных»,\r\n      означает любую форму электронного, устного или письменного сообщения, отправленного\r\n      Лицензиару или его представителям, включая, но не ограничиваясь ими,\r\n      связь с электронными списками рассылки, системами управления исходным кодом,\r\n      и системы отслеживания проблем, которыми управляет или от имени\r\n      Лицензиар для обсуждения и улучшения работы, но\r\n      исключая сообщение, которое явно обозначено или иным образом\r\n      обозначенный в письменной форме владельцем авторских прав как «Не внесенный вклад».\r\n\r\n      «Участник» означает Лицензиар и любое физическое или юридическое лицо\r\n      от имени которого Получатель был получен Лицензиаром и\r\n      впоследствии включенных в Работу.\r\n\r\n   2. Предоставление авторских прав. В соответствии с условиями\r\n      эта Лицензия, каждый Contributor настоящим предоставляет Вам вечную,\r\n      во всем мире, неисключительный, беспроцентный, безвозмездный, безотзывный\r\n      авторские права на воспроизведение, подготовку производных произведений,\r\n      публично демонстрировать, публично исполнять, сублицензировать и распространять\r\n      Работа и такие производные работы в форме источника или объекта.\r\n\r\n   3. Предоставление патентной лицензии. В соответствии с условиями\r\n      эта Лицензия, каждый Contributor настоящим предоставляет Вам вечную,\r\n      во всем мире, неисключительный, беспроцентный, безвозмездный, безотзывный\r\n      (за исключением случаев, указанных в этом разделе) патентную лицензию на изготовление,\r\n      использовать, предлагать продавать, продавать, импортировать и иным образом передавать Работу,\r\n      когда такая лицензия применяется только к тем патентам, которые подлежат лицензированию\r\n      от таких Сторонников, которые неизбежно нарушаются\r\n      Вклад (ы) самостоятельно или путем их комбинации (вкладок)\r\n      с Работой, на которую был представлен такой Взнос (-ы). Если вы\r\n      возбуждать патентные споры в отношении любого лица (включая\r\n      перекрестный иск или встречный иск в судебном процессе), утверждая, что работа\r\n      или вклад, включенный в Работу, является прямым\r\n      или сопутствующее патентное нарушение, то любые патентные лицензии\r\n      предоставленный вам в соответствии с настоящей Лицензией для этой работы, прекращается\r\n      на дату подачи такого судебного разбирательства.\r\n\r\n   4. Перераспределение. Вы можете воспроизводить и распространять копии\r\n      Рабочие или производные работы на любом носителе, с или без\r\n      изменений и в форме источника или объекта, при условии, что вы\r\n      отвечают следующим условиям:\r\n\r\n      (a) Вы должны предоставить любых других получателей Работы или\r\n          Derivative Works копирует эту Лицензию; а также\r\n\r\n      (b) Вы должны заставить любые измененные файлы нести заметные уведомления\r\n          заявив, что вы изменили файлы; а также\r\n\r\n      (c) Вы должны сохранить в исходной форме любые производные произведения\r\n          что вы распространяете все авторские права, патенты, товарные знаки и\r\n          уведомления об атрибуции из исходной формы Работы,\r\n          за исключением тех уведомлений, которые не относятся к какой-либо части\r\n          Производные работы; а также\r\n\r\n      (d) Если в Работе включен текстовый файл «УВЕДОМЛЕНИЕ» как часть его\r\n          распределения, то любые производные работы, которые вы распространяете, должны\r\n          включают читаемую копию уведомлений об атрибуции\r\n          в таком файле NOTICE, за исключением тех уведомлений, которые не\r\n          относятся к любой части Производных произведений, по крайней мере, в одном\r\n          из следующих мест: в текстовом файле NOTICE\r\n          как часть Производных работ; в форме источника или\r\n          документация, если она предоставляется вместе с производными произведениями; или,\r\n          в пределах дисплея, генерируемого производными произведениями, если и\r\n          везде, где обычно появляются уведомления сторонних производителей. Содержимое\r\n          файла NOTICE предназначены только для информационных целей и\r\n          не изменяйте Лицензию. Вы можете добавить свою собственную атрибуцию\r\n          уведомления в рамках производных работ, которые вы распространяете вместе с\r\n          или в качестве добавления к тексту NOTICE из Работы, предоставленного\r\n          что такие дополнительные уведомления об атрибуции не могут быть истолкованы\r\n          как изменение Лицензии.\r\n\r\n      Вы можете добавить свое собственное заявление об авторских правах в свои модификации и\r\n      могут предоставлять дополнительные или разные условия лицензии\r\n      для использования, воспроизведения или распространения ваших модификаций или\r\n      для любых таких производных работ в целом, при условии, что вы используете,\r\n      воспроизведение и распространение Работы в противном случае\r\n      условия, указанные в настоящей Лицензии.\r\n\r\n   5. Представление взносов. Если вы прямо не укажете иное,\r\n      любой Взнос, преднамеренно представленный для включения в Работу\r\n      от вас Лицензиару осуществляется на условиях\r\n      настоящей Лицензии, без каких-либо дополнительных условий.\r\n      Несмотря на вышесказанное, ничто в настоящем документе не должно заменять или изменять\r\n      условия любого отдельного лицензионного соглашения, которое вы, возможно, выполнили\r\n      с Лицензиаром в отношении таких взносов.\r\n\r\n   6. Товарные знаки. Эта лицензия не дает разрешения на использование\r\n      имена, товарные знаки, знаки обслуживания или названия продуктов Лицензиара,\r\n      за исключением случаев, когда это необходимо для разумного и обычного использования при описании\r\n      происхождение Работы и воспроизведение содержимого файла NOTICE.\r\n\r\n   7. Отказ от гарантии. Если это не предусмотрено действующим законодательством или\r\n      согласился в письменной форме, Лицензиар предоставляет Работу (и каждый\r\n      Contributor предоставляет свои взносы) на «AS IS» BASIS,\r\n      БЕЗ ГАРАНТИЙ ИЛИ УСЛОВИЙ ЛЮБОГО ВИДА, либо\r\n      подразумевает, включая, без ограничений, любые гарантии или условия\r\n      НАЗВАНИЯ, НЕНАРУШЕНИЯ ПРАВ, КОММЕРЧЕСКОЙ ЦЕННОСТИ ИЛИ ПРИГОДНОСТИ ДЛЯ A\r\n      КОНКРЕТНОЕ НАЗНАЧЕНИЕ. Вы несете единоличную ответственность за\r\n      целесообразности использования или перераспределения Работы и принятия любых\r\n      риски, связанные с выполнением вами разрешений в соответствии с настоящей Лицензией.\r\n\r\n   8. Ограничение ответственности. Ни в коем случае и ни при каких правовых теориях,\r\n      будь то деликты (в том числе небрежность), контракт или иное,\r\n      если это не требуется применимым законодательством (например, преднамеренно и грубо\r\n      небрежным актам) или согласовано в письменной форме, любой Участник\r\n      подлежащих возмещению, включая любые прямые, косвенные, специальные,\r\n      случайный или косвенный ущерб любого характера, возникающего как\r\n      результате этой Лицензии или из-за использования или невозможности использования\r\n      Работа (включая, но не ограничиваясь, убытки за потерю гудвила,\r\n      остановка работы, сбой компьютера или неисправность или все\r\n      другие коммерческие убытки или убытки), даже если такой Contributor\r\n      было сообщено о возможности такого ущерба.\r\n\r\n   9. Принятие гарантии или дополнительной ответственности. При перераспределении\r\n      Рабочие или производные работы, которые вы можете предложить,\r\n      и взимать плату за прием, поддержку, гарантию, возмещение,\r\n      или других обязательств по обязательствам и / или прав, соответствующих этому\r\n      Лицензия. Однако, принимая такие обязательства, вы можете действовать только\r\n      от вашего собственного имени и за вашу исключительную ответственность, а не от имени\r\n      любого другого Участника, и только если Вы согласитесь возместить,\r\n      защищать и удерживать каждого участника без какой-либо ответственности\r\n      понесенные или предъявленные претензии против такого Участника по причине\r\n      о принятии вами такой гарантии или дополнительной ответственности.\r\n\r\n   КОНЕЦ СРОКОВ И УСЛОВИЙ\r\n\r\n   ПРИЛОЖЕНИЕ: Как применить лицензию Apache к вашей работе.\r\n\r\n      Чтобы применить лицензию Apache к вашей работе, приложите следующие\r\n      с таблицами, заключенными в скобки \"[]\"\r\n      заменяется вашей собственной идентифицирующей информацией. (Не включайте\r\n      скобки!) Текст должен быть помещен в соответствующий\r\n      синтаксис комментария для формата файла. Мы также рекомендуем, чтобы\r\n      имя файла или класса и описание цели должны быть включены в\r\n      такую ​​же «печатную страницу», что и\r\n      идентификация в сторонних архивах.\r\n\r\n   Авторское право [yyyy] [имя владельца авторских прав]\r\n\r\n   Лицензируется по лицензии Apache, версия 2.0 («Лицензия»);\r\n   вы не можете использовать этот файл, кроме как в соответствии с Лицензией.\r\n   Вы можете получить копию Лицензии на\r\n\r\n       http://www.apache.org/licenses/LICENSE-2.0\r\n\r\n   Если это не предусмотрено действующим законодательством или не согласовано в письменной форме, программное обеспечение\r\n   распространяемый по лицензии, распространяется на основе «КАК ЕСТЬ»,\r\n   БЕЗ ГАРАНТИЙ ИЛИ УСЛОВИЙ ЛЮБОГО ВИДА, явных или подразумеваемых.\r\n   См. Лицензию на конкретном языке, определяющем разрешения и\r\n   ограничения по Лицензии.",
   "closed_at" : "2018-01-01T17:17:38Z",
   "closed_by" : {
      "avatar_url" : "https://avatars1.githubusercontent.com/u/548488?v=4",
      "events_url" : "https://api.github.com/users/sipa/events{/privacy}",
      "followers_url" : "https://api.github.com/users/sipa/followers",
      "following_url" : "https://api.github.com/users/sipa/following{/other_user}",
      "gists_url" : "https://api.github.com/users/sipa/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/sipa",
      "id" : 548488,
      "login" : "sipa",
      "node_id" : "MDQ6VXNlcjU0ODQ4OA==",
      "organizations_url" : "https://api.github.com/users/sipa/orgs",
      "received_events_url" : "https://api.github.com/users/sipa/received_events",
      "repos_url" : "https://api.github.com/users/sipa/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/sipa/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/sipa/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/sipa"
   },
   "comments" : 0,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/12068/comments",
   "created_at" : "2018-01-01T14:23:19Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/12068/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/pull/12068",
   "id" : 285309927,
   "labels" : [],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/12068/labels{/name}",
   "locked" : true,
   "milestone" : null,
   "node_id" : "MDExOlB1bGxSZXF1ZXN0MTYwNjQ5NzYw",
   "number" : 12068,
   "pull_request" : {
      "diff_url" : "https://github.com/bitcoin/bitcoin/pull/12068.diff",
      "html_url" : "https://github.com/bitcoin/bitcoin/pull/12068",
      "patch_url" : "https://github.com/bitcoin/bitcoin/pull/12068.patch",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/pulls/12068"
   },
   "repository_url" : "https://api.github.com/repos/bitcoin/bitcoin",
   "state" : "closed",
   "title" : "EVGHENICOIN",
   "updated_at" : "2018-01-01T23:41:19Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/12068",
   "user" : {
      "avatar_url" : "https://avatars0.githubusercontent.com/u/34837619?v=4",
      "events_url" : "https://api.github.com/users/GENERALGUBERNATOR1/events{/privacy}",
      "followers_url" : "https://api.github.com/users/GENERALGUBERNATOR1/followers",
      "following_url" : "https://api.github.com/users/GENERALGUBERNATOR1/following{/other_user}",
      "gists_url" : "https://api.github.com/users/GENERALGUBERNATOR1/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/GENERALGUBERNATOR1",
      "id" : 34837619,
      "login" : "GENERALGUBERNATOR1",
      "node_id" : "MDQ6VXNlcjM0ODM3NjE5",
      "organizations_url" : "https://api.github.com/users/GENERALGUBERNATOR1/orgs",
      "received_events_url" : "https://api.github.com/users/GENERALGUBERNATOR1/received_events",
      "repos_url" : "https://api.github.com/users/GENERALGUBERNATOR1/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/GENERALGUBERNATOR1/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/GENERALGUBERNATOR1/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/GENERALGUBERNATOR1"
   }
}
