{
   "active_lock_reason" : null,
   "assignee" : null,
   "assignees" : [],
   "author_association" : "NONE",
   "body" : "Title: White Paper - How to Make Full Use of Bitcoin Hashrate: Using Bitcoin Mining Power for Enterprise Cloud Computing\r\n\r\nAbstract:\r\n\r\nThis paper aims to propose a novel idea of using Bitcoin mining power to provide services for enterprise cloud computing, in order to improve the efficiency of Bitcoin mining and also provide computing services for other industries. By forking the Bitcoin protocol, Bitcoin mining power can be converted into enterprise cloud computing power, thereby achieving more extensive uses. This paper introduces the process of forking and the feasibility of achieving this goal.\r\n\r\nBackground:\r\n\r\nBitcoin is a digital currency, which is a decentralized digital currency and transactions are conducted on the Bitcoin blockchain. Bitcoin mining refers to using computer power to solve a series of complex mathematical problems in order to obtain Bitcoin as a reward. However, Bitcoin mining requires a large amount of computing resources, especially in the current market, the increase in computer power leads to an increase in mining difficulty. This makes Bitcoin mining no longer as profitable as before and leads to problems of energy and resource waste.\r\n\r\nHowever, we can use the mining power of Bitcoin to provide services for enterprise cloud computing, in order to improve efficiency and also provide computing services for other industries. The mining power of Bitcoin can be used for the computing needs of other industries, such as scientific computing, artificial intelligence, data analysis, and more. In addition, forking the Bitcoin protocol can also improve the efficiency of Bitcoin mining and provide faster computing services for other industries.\r\n\r\nMethod:\r\n\r\nFirstly, it is necessary to modify the Bitcoin protocol to convert Bitcoin mining power into enterprise cloud computing power. This can be achieved by modifying the mining algorithm in the Bitcoin protocol to another algorithm. For example, Proof-of-Work algorithm can be replaced by Proof-of-Stake algorithm, in order to convert mining power into enterprise cloud computing power.\r\n\r\nSecondly, it is necessary to fork the Bitcoin protocol in order to convert it into a protocol suitable for enterprise cloud computing. This can be achieved by adding new functions and protocols to the Bitcoin protocol. For example, enterprise cloud computing functions can be added, so that Bitcoin mining power can provide computing services for other industries.\r\n\r\nFinally, it is necessary to implement the mining power of Bitcoin on the enterprise cloud computing platform, in order to use it for the computing needs of other industries. This can be achieved by creating a Bitcoin mining node, and some possible application scenarios include artificial intelligence, blockchain technology, scientific computing, data mining, and more. By using the mining power of Bitcoin, enterprises can complete complex computing tasks more quickly, while reducing their own costs.\r\n\r\nHowever, to achieve such an application, it is necessary to modify the Bitcoin protocol through blockchain forking, in order to support multiple uses of Bitcoin computing power. Such a fork needs to be accepted and supported by the majority of nodes in order to achieve a wider range of application scenarios.\r\n\r\nTherefore, we suggest that Bitcoin software design companies and Bitcoin mining communities promote the forking of the Bitcoin protocol through reasonable technology and processes, in order to achieve the goal of using Bitcoin mining power for other computing tasks. At the same time, attention should be paid to the security and stability of the system, so as not to cause losses to the operation and users of the system due to forking.\r\n\r\nIn summary, the multiple application scenarios of using Bitcoin mining power have broad prospects and huge potential, but require the joint efforts of the Bitcoin community and software design companies to achieve.",
   "closed_at" : "2023-04-06T06:30:03Z",
   "closed_by" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/32963518?v=4",
      "events_url" : "https://api.github.com/users/hebasto/events{/privacy}",
      "followers_url" : "https://api.github.com/users/hebasto/followers",
      "following_url" : "https://api.github.com/users/hebasto/following{/other_user}",
      "gists_url" : "https://api.github.com/users/hebasto/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/hebasto",
      "id" : 32963518,
      "login" : "hebasto",
      "node_id" : "MDQ6VXNlcjMyOTYzNTE4",
      "organizations_url" : "https://api.github.com/users/hebasto/orgs",
      "received_events_url" : "https://api.github.com/users/hebasto/received_events",
      "repos_url" : "https://api.github.com/users/hebasto/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/hebasto/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/hebasto/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/hebasto"
   },
   "comments" : 0,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/27428/comments",
   "created_at" : "2023-04-06T06:26:23Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/27428/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/issues/27428",
   "id" : 1656745005,
   "labels" : [],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/27428/labels{/name}",
   "locked" : true,
   "milestone" : null,
   "node_id" : "I_kwDOABII585iv-wt",
   "number" : 27428,
   "performed_via_github_app" : null,
   "reactions" : {
      "+1" : 0,
      "-1" : 0,
      "confused" : 0,
      "eyes" : 0,
      "heart" : 0,
      "hooray" : 0,
      "laugh" : 0,
      "rocket" : 0,
      "total_count" : 0,
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/27428/reactions"
   },
   "repository_url" : "https://api.github.com/repos/bitcoin/bitcoin",
   "state" : "closed",
   "state_reason" : "not_planned",
   "timeline_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/27428/timeline",
   "title" : ".",
   "updated_at" : "2023-04-06T06:30:36Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/27428",
   "user" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/37261887?v=4",
      "events_url" : "https://api.github.com/users/eeeflying/events{/privacy}",
      "followers_url" : "https://api.github.com/users/eeeflying/followers",
      "following_url" : "https://api.github.com/users/eeeflying/following{/other_user}",
      "gists_url" : "https://api.github.com/users/eeeflying/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/eeeflying",
      "id" : 37261887,
      "login" : "eeeflying",
      "node_id" : "MDQ6VXNlcjM3MjYxODg3",
      "organizations_url" : "https://api.github.com/users/eeeflying/orgs",
      "received_events_url" : "https://api.github.com/users/eeeflying/received_events",
      "repos_url" : "https://api.github.com/users/eeeflying/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/eeeflying/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/eeeflying/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/eeeflying"
   }
}
