{
   "active_lock_reason" : null,
   "assignee" : null,
   "assignees" : [],
   "author_association" : "NONE",
   "body" : "This BIP proposes the direct implementation of several privacy and anonymity-enhancing features in the Bitcoin protocol, including CoinJoin, zk-SNARKs, ring signatures, and stealth addresses directly into the Bitcoin protocol. These features were envisioned by Satoshi Nakamoto and other contributors as essential tools for preserving user privacy on the network.\n\nMotivation\n\nBitcoin's current level of privacy and anonymity is limited due to its public ledger, which allows anyone to view all transactions and trace them back to their source. This has led to concerns about the privacy and security of Bitcoin users, as well as potential regulatory pressures and censorship.\nTo address these issues, Satoshi Nakamoto foresaw the need for privacy-enhancing technologies in the original Bitcoin white paper. Specifically, Nakamoto suggested the use of ring signatures to protect user privacy and prevent transaction analysis. In section 10 of the white paper, Nakamoto wrote: \"We can use a ring signature to protect user privacy by not showing the input transaction to the world, keeping the public key only inside the group.\"\n\nAdditionally, Nakamoto envisioned stealth addresses as a way to enhance privacy on the network. In section 9 of the white paper, Nakamoto wrote: \"To protect privacy, the output value of a transaction must be completely used up in the next transaction. If the value is split into smaller amounts and combined with other transactions, it becomes more difficult to know which transaction(s) are relevant to a particular transaction.\" While Nakamoto did not specifically mention stealth addresses in the white paper, he did allude to the concept by suggesting the use of one-time addresses to enhance privacy. In addition to Nakamoto's original vision, there have been several other proposals for privacy-enhancing features in the Bitcoin ecosystem, including CoinJoin and zk-SNARKs. These technologies can help obfuscate transaction details, making it more difficult for third parties to track and analyze Bitcoin transactions.\n\nProposal and Technical Specifications\n\nWe propose the direct implementation of four privacy-enhancing features in the Bitcoin protocol:\n\n1. CoinJoin: CoinJoin is a technique that allows multiple Bitcoin transactions to be combined into a single transaction, making it more difficult for outside observers to determine which inputs correspond to which outputs. By joining transactions together, CoinJoin can help obfuscate the origin and destination of Bitcoin transactions. We propose that CoinJoin be implemented directly in the Bitcoin protocol using a new opcode.\n2. zk-SNARKs: zk-SNARKs (Zero-Knowledge Succinct Non-Interactive Argument of Knowledge) are a type of zero-knowledge proof that allows for private transactions on the Bitcoin network. Using zk-SNARKs, users can prove that they own a certain amount of Bitcoin without revealing any details about the transaction or their identity. In section 10 of the white paper, Nakamoto wrote: \"The traditional banking model achieves a level of privacy by limiting access to information to the parties involved and the trusted third party. The necessity to announce all transactions publicly precludes this method, but privacy can still be maintained by breaking the flow of information in another place: by keeping public keys anonymous.\". We propose that zk-SNARKs be implemented in the Bitcoin protocol using a new transaction format.\n3. Ring Signatures: Ring signatures allow users to sign a message without revealing which user actually signed it. This can help protect the privacy and anonymity of Bitcoin users, as it makes it more difficult for third parties to determine who is behind a particular transaction. In section 10 of the white paper, Nakamoto wrote: \"We can use a ring signature to protect user privacy by not showing the input transaction to the world, keeping the public key only inside the group.\" We propose that ring signatures be implemented in the Bitcoin protocol using a new opcode\n4. Stealth Addresses: Stealth addresses allow users to generate a new address for each transaction, making it more difficult for outside observers to track the flow of Bitcoin. This can help enhance privacy on the network, as it makes it more difficult for third parties to link transactions together. While stealth addresses were not specifically mentioned in the white paper the idea was presented by Satoshi Nakamoto white pepar the quote can be found in the original Bitcoin white paper, in section 9 \"Combining and Splitting Value\":\n\n\"The solution we propose begins with a timestamp server. A timestamp server works by taking a hash of a block of items to be timestamped and widely publishing the hash, such as in a newspaper or Usenet post [2-5]. The timestamp proves that the data must have existed at the time, obviously, in order to get into the hash. Each timestamp includes the previous timestamp in its hash, forming a chain, with each additional timestamp reinforcing the ones before it. When a client wishes to make a payment to another, he broadcasts to the network a message signed by his private key, announcing this transaction and identifying the recipient by a hash of the recipient's public key. The recipient can then scan the blockchain to confirm that the sender does indeed have the necessary funds. The recipient's software then generates a new key pair, and uses the public key to receive the funds, and the private key to spend them. The transaction is broadcast to the network to be included in the next block if it is valid (this is where the timestamping comes in).\"\n\nIn this section, Satoshi does not use the term \"stealth address\" specifically, but he does describe a process where a recipient generates a new key pair to receive funds, which is a core feature of the stealth address technology. they were proposed later by Peter Todd in 2013 as a way to enhance privacy on the network. We propose that stealth addresses be implemented in the Bitcoin protocol using a new transaction format.\n\nImplementation\n\nWe propose that these features be implemented directly into the Bitcoin protocol, rather than relying on third-party wallet providers to implement them. This would help ensure that all Bitcoin users have access to these privacy-enhancing features, regardless of which wallet provider they choose to use.\n\nWhile the proposed privacy-enhancing features could be directly implemented into the Bitcoin protocol, there may be concerns from the Bitcoin community regarding regulatory or government bodies thinking about the potential misuse of these features. As such, we acknowledge that wallet providers may be a more viable means of implementing the features into the Bitcoin ecosystem in as was the case with the Taproot update and its facilitation of CoinJoin. We suggest that wallet providers work with the proposed working group to develop standards and best practices for implementing CoinJoin, zk-SNARKs, ring signatures, and stealth addresses into their products. By doing so, they can provide users with enhanced privacy and security features.\n\nAcknowledgement\n\nWe acknowledge that there may be technical challenges to implementing these features directly in the protocol, and we propose that a working group be formed to explore these challenges and develop a plan for implementation. This working group could be composed of Bitcoin developers, privacy advocates, and other stakeholders with an interest in enhancing the privacy and security of the Bitcoin network.\n\nConclusion\n\nBitcoin was originally conceived as a decentralized, peer-to-peer payment system that would allow users to transact without the need for intermediaries. However, the current level of transparency on the Bitcoin network has raised concerns about the privacy and security of Bitcoin users. By implementing privacy-enhancing features such as CoinJoin, zk-SNARKs, ring signatures, and stealth addresses directly into the Bitcoin protocol, we can help ensure that Bitcoin remains a viable payment system for users who value privacy and anonymity.\n\nHere is the link of the BIP below\n\nhttps://github.com/Bandarfaqih/Enhancing-Bitcoin-Privacy-Protocol-Bip-Proposal\n\n<a rel=\"license\" href=\"http://creativecommons.org/licenses/by/4.0/\"><img alt=\"Creative Commons License\" style=\"border-width:0\" src=\"https://i.creativecommons.org/l/by/4.0/88x31.png\" /></a><br /><span xmlns:dct=\"http://purl.org/dc/terms/\" property=\"dct:title\">Enhancing Privacy in the Bitcoin Protocol</span> by <span xmlns:cc=\"http://creativecommons.org/ns#\" property=\"cc:attributionName\">Bandarfaqih</span> is licensed under a <a rel=\"license\" href=\"http://creativecommons.org/licenses/by/4.0/\">Creative Commons Attribution 4.0 International License</a>.",
   "closed_at" : "2023-04-07T15:37:41Z",
   "closed_by" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/863730?v=4",
      "events_url" : "https://api.github.com/users/fanquake/events{/privacy}",
      "followers_url" : "https://api.github.com/users/fanquake/followers",
      "following_url" : "https://api.github.com/users/fanquake/following{/other_user}",
      "gists_url" : "https://api.github.com/users/fanquake/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/fanquake",
      "id" : 863730,
      "login" : "fanquake",
      "node_id" : "MDQ6VXNlcjg2MzczMA==",
      "organizations_url" : "https://api.github.com/users/fanquake/orgs",
      "received_events_url" : "https://api.github.com/users/fanquake/received_events",
      "repos_url" : "https://api.github.com/users/fanquake/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/fanquake/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/fanquake/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/fanquake"
   },
   "comments" : 1,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/27437/comments",
   "created_at" : "2023-04-07T15:34:11Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/27437/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/issues/27437",
   "id" : 1658933790,
   "labels" : [],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/27437/labels{/name}",
   "locked" : false,
   "milestone" : null,
   "node_id" : "I_kwDOABII585i4VIe",
   "number" : 27437,
   "performed_via_github_app" : null,
   "reactions" : {
      "+1" : 0,
      "-1" : 0,
      "confused" : 0,
      "eyes" : 0,
      "heart" : 0,
      "hooray" : 0,
      "laugh" : 0,
      "rocket" : 0,
      "total_count" : 0,
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/27437/reactions"
   },
   "repository_url" : "https://api.github.com/repos/bitcoin/bitcoin",
   "state" : "closed",
   "state_reason" : "completed",
   "timeline_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/27437/timeline",
   "title" : "Enhancing Privacy in the Bitcoin Protocol BIP Proposal",
   "updated_at" : "2023-04-07T15:37:41Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/27437",
   "user" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/130158492?v=4",
      "events_url" : "https://api.github.com/users/Bandarfaqih/events{/privacy}",
      "followers_url" : "https://api.github.com/users/Bandarfaqih/followers",
      "following_url" : "https://api.github.com/users/Bandarfaqih/following{/other_user}",
      "gists_url" : "https://api.github.com/users/Bandarfaqih/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/Bandarfaqih",
      "id" : 130158492,
      "login" : "Bandarfaqih",
      "node_id" : "U_kgDOB8IPnA",
      "organizations_url" : "https://api.github.com/users/Bandarfaqih/orgs",
      "received_events_url" : "https://api.github.com/users/Bandarfaqih/received_events",
      "repos_url" : "https://api.github.com/users/Bandarfaqih/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/Bandarfaqih/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/Bandarfaqih/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/Bandarfaqih"
   }
}
