{
   "assignee" : null,
   "body" : "I realize this introduction is a bit long, so if you don't feel like reading skip to the bullet points below under \"strategy\".\r\n\r\nThe codebase as it exists right now has a number of unnecessary dependencies which makes code modularization much more difficult. In particular, the satoshi client was built to handle all bitcoin-related tasks, but its value as a \"reference implementation\" lies primarily in doing verification and acting as a relay agent as these are the most essential tasks that participating nodes must perform to keeping the network in operation. Things like wallets, historical databases, mining, and notification agents could be written as entirely separate third-party applications without risk to the network's fundamental integrity.\r\n\r\nThe basic architecture of a bitcoin node is as follows:\r\n\r\nAt the core there exist fundamental bitcoin message structures, along with the code necessary for serialization/deserialization. These structures belong in their own source files with minimal dependencies so they can be reused for applications that needn't perform verification and relay - for instance, filtering and notification agents. Unfortunately, these core structures currently reside for the most part in main.h/main.cpp, one of the central problems this pull request attempts to fix.\r\n\r\nOn top of these core structures sits a network component that manages sockets, does peer discovery, and handles queueing and dispatching of messages. This component is clearly dependent on the core message structures but does not depend on the specific logic used to verify blocks and transactions nor to identify misbehaving peers nor sign transactions nor maintain a block chain database.\r\n\r\nThen we have a scripting engine, signature verification component, and a signing component. Historical database applications do not need signature verification/signing functionality at all.  Filtering messages and sending alerts generally does not even require a scripting engine and does fine with basic pattern matching.\r\n\r\nThe most critical high-level operations needed by a verification/relay node such as the satoshi client are transaction verification; block chain and memory pool management; and detection/management of misbehaving peers. These things are currently primarily implemented in main.h/main.cpp. These are indeed the main operations of the satoshi client - but the core low-level structures should not depend at all on this logic.\r\n\r\nThen there's the UI, but let's leave that aside for a moment.\r\n\r\nFinally there's init.h/init.cpp, which sets up the particular environment in which the satoshi client runs.\r\n\r\n<b>This branch takes the following strategy:</b>\r\n\r\n- Remove source file dependencies on main.h and init.h by only including necessary headers wherever possible.\r\n- If source files depend on definitions in main or init, either move the dependent portions into main/init or move the depended-upon portions into separate files.\r\n- If the dependent source files use global variables or functions that clearly belong in either main or init, copy the value over to a class member or a variable with file scope in the dependent source or expose a registration function to set a callback.\r\n- If moving a core class out of main is impossible because its methods depend on variables or functions defined in main, isolate the methods that depend on main and either move them to another class that *does* belong in main or convert them into regular functions in main.\r\n\r\nIt is important that all modifications made in this branch are easy to review and to test. This branch does not encourage rewriting things from scratch - only moving them and rearranging them in easily identifiable chunks. Furthermore, the focus of the branch is not so much on coding style and style consistency - but on isolation of functional units and elimination of unnecessary dependencies.",
   "closed_at" : "2013-06-10T13:17:39Z",
   "closed_by" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/494411?v=3",
      "events_url" : "https://api.github.com/users/jgarzik/events{/privacy}",
      "followers_url" : "https://api.github.com/users/jgarzik/followers",
      "following_url" : "https://api.github.com/users/jgarzik/following{/other_user}",
      "gists_url" : "https://api.github.com/users/jgarzik/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/jgarzik",
      "id" : 494411,
      "login" : "jgarzik",
      "organizations_url" : "https://api.github.com/users/jgarzik/orgs",
      "received_events_url" : "https://api.github.com/users/jgarzik/received_events",
      "repos_url" : "https://api.github.com/users/jgarzik/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/jgarzik/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/jgarzik/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/jgarzik"
   },
   "comments" : 46,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/2154/comments",
   "created_at" : "2013-01-07T07:18:51Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/2154/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/pull/2154",
   "id" : 9726713,
   "labels" : [],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/2154/labels{/name}",
   "locked" : false,
   "milestone" : null,
   "number" : 2154,
   "pull_request" : {
      "diff_url" : "https://github.com/bitcoin/bitcoin/pull/2154.diff",
      "html_url" : "https://github.com/bitcoin/bitcoin/pull/2154",
      "patch_url" : "https://github.com/bitcoin/bitcoin/pull/2154.patch",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/pulls/2154"
   },
   "repository_url" : "https://api.github.com/repos/bitcoin/bitcoin",
   "state" : "closed",
   "title" : "Clean up code dependencies",
   "updated_at" : "2014-06-18T20:42:03Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/2154",
   "user" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/894059?v=3",
      "events_url" : "https://api.github.com/users/CodeShark/events{/privacy}",
      "followers_url" : "https://api.github.com/users/CodeShark/followers",
      "following_url" : "https://api.github.com/users/CodeShark/following{/other_user}",
      "gists_url" : "https://api.github.com/users/CodeShark/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/CodeShark",
      "id" : 894059,
      "login" : "CodeShark",
      "organizations_url" : "https://api.github.com/users/CodeShark/orgs",
      "received_events_url" : "https://api.github.com/users/CodeShark/received_events",
      "repos_url" : "https://api.github.com/users/CodeShark/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/CodeShark/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/CodeShark/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/CodeShark"
   }
}
