[
   {
      "body" : "Sample output:\r\n\r\n```\r\n~/bitcoin/src$ test/bitcoin-util-test.py --srcdir='.' --verbose\r\nTesting: Creates a blank transaction\r\nPASS\r\nTesting: Creates a blank transaction (output in json)\r\nPASS\r\nTesting: Creates a blank transaction when nothing is piped into bitcoin-tx\r\nPASS\r\nTesting: Creates a blank transaction when nothing is piped into bitcoin-tx (output in json)\r\nPASS\r\nTesting: Deletes a single input from a transaction\r\nPASS\r\nTesting: Deletes a single input from a transaction (output in json)\r\nPASS\r\nTesting: Attempts to delete an input with a bad index from a transaction. Expected to fail.\r\nPASS\r\nTesting: Deletes a single output from a transaction\r\nPASS\r\nTesting: Deletes a single output from a transaction (output in json)\r\nPASS\r\nTesting: Attempts to delete an output with a bad index from a transaction. Expected to fail.\r\nPASS\r\nTesting: Adds an nlocktime to a transaction\r\nPASS\r\nTesting: Adds an nlocktime to a transaction (output in json)\r\nPASS\r\nTesting: Creates a new transaction with three inputs and two outputs\r\nPASS\r\nTesting: Creates a new transaction with three inputs and two outputs (output in json)\r\nPASS\r\nTesting: Creates a new transaction with a single empty output script\r\nPASS\r\nTesting: Creates a new transaction with a single empty output script (output in json)\r\nPASS\r\nTesting: Creates a new transaction with a single input and a single output, and then signs the transaction\r\nPASS\r\nTesting: Creates a new transaction with a single input and a single output, and then signs the transaction (output in json)\r\nPASS\r\nTesting: Attempts to create a new transaction with one input and an output with malformed hex data. Expected to fail\r\nPASS\r\nTesting: Attempts to create a new transaction with one input and an output with no value and malformed hex data. Expected to fail\r\nPASS\r\nTesting: Creates a new transaction with one input, one address output and one data output\r\nPASS\r\nTesting: Creates a new transaction with one input, one address output and one data output. Output in json\r\nPASS\r\nTesting: Creates a new transaction with one input, one address output and one data (zero value) output\r\nPASS\r\nTesting: Creates a new transaction with one input, one address output and one data (zero value) output. Output in json\r\nPASS\r\nTesting: Creates a new transaction with one input with sequence number and one address output\r\nPASS\r\nTesting: Creates a new transaction with one input with sequence number and one address output. Output in json\r\nPASS\r\nTesting: Adds a new input with sequence number to a transaction\r\nPASS\r\nTesting: Adds a new input with sequence number to a transaction. Output in json\r\nPASS\r\n```",
      "created_at" : "2016-10-04T18:28:29Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/pull/8881#issuecomment-251472532",
      "id" : 251472532,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/8881",
      "updated_at" : "2016-10-04T18:28:29Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/251472532",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/1063656?v=3",
         "events_url" : "https://api.github.com/users/jnewbery/events{/privacy}",
         "followers_url" : "https://api.github.com/users/jnewbery/followers",
         "following_url" : "https://api.github.com/users/jnewbery/following{/other_user}",
         "gists_url" : "https://api.github.com/users/jnewbery/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/jnewbery",
         "id" : 1063656,
         "login" : "jnewbery",
         "organizations_url" : "https://api.github.com/users/jnewbery/orgs",
         "received_events_url" : "https://api.github.com/users/jnewbery/received_events",
         "repos_url" : "https://api.github.com/users/jnewbery/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/jnewbery/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/jnewbery/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/jnewbery"
      }
   }
]
