[
   {
      "author_association" : "MEMBER",
      "body" : "I think \"Make params configurable/not hardcoded params\" should be under \"critical conceptual discussion\". Not the part about flexibility, which I agree is low priority.\r\n\r\nWhat's more fundamental is the question of whether these parameters should be \"blessed\" by the Bitcoin Core project.\r\n\r\nOne could argue that there is no \"blessing\", because these snapshots can be objectively assessed. A snapshot hash is valid if and only if background validation yields the same result. Any other snapshot, if it somehow makes into the code, is either a bug or an exploit.\r\n\r\nThis makes this feature different from checkpoints in a fundamental way. A checkpoint can be abused to override the most-work valid chain. Once enough people honor it, it becomes a fait accompli because miners are incentivised to work on it - eventually making it the most-work chain. (after which it can be deleted, and people can pretend it never happened)\r\n\r\nThe same can't be achieved with an invalid snapshot. Such forgery can always be demonstrated as long as a single person has an archive of the blockchain all the way back to genesis.\r\n\r\nStill, in a far future where perhaps few _users_ actually perform the background validation, a technically sound argument may not matter in the political reality.\r\n\r\nA thought experiment to clarify this. The US Treasury finally issues their one trillion dollar coin. They do so by creating their own UTXO snapshot and forcing maintainers to include it. To avoid a chain split existing nodes on the network, they don't actually move the coin, but borrow against it. A few generations go by, more and more nodes will have be reinstalled and synced based on this new snapshot.\r\n\r\nIn this particular scenario I don't think it matters at all if the hash is part of chainparams or if it's flexible. But there may be a less extreme scenario's where it does. Which is why I think some discussion is warranted.\r\n\r\nMeanwhile there is a major downside to not hardcoding the parameters, in that it makes the feature much harder to use. A user would have to find some place to download it, verify a hash and a PGP signature. It's less obvious how we could add p2p snapshot functionality later, because we have no hash to ask for and check against.\r\n\r\nSo on balance, because of the difference with checkpoints I explained above, my current thinking is that it's alright to include these params.\r\n\r\n> How frequently should we update testnet/signet params\r\n\r\nImo those params are only there to test the functionality. They don't need to be fresh. If the are nuked, we can add new params a year after the new genesis block (it's hard to test this feature if the snapshot is too close to the start of the chain).",
      "created_at" : "2024-03-11T13:02:02Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/29616#issuecomment-1988390944",
      "id" : 1988390944,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/29616",
      "node_id" : "IC_kwDOABII5852hHAg",
      "performed_via_github_app" : null,
      "reactions" : {
         "+1" : 0,
         "-1" : 0,
         "confused" : 0,
         "eyes" : 0,
         "heart" : 0,
         "hooray" : 0,
         "laugh" : 0,
         "rocket" : 0,
         "total_count" : 0,
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1988390944/reactions"
      },
      "updated_at" : "2024-03-11T13:04:39Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/1988390944",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/10217?v=4",
         "events_url" : "https://api.github.com/users/Sjors/events{/privacy}",
         "followers_url" : "https://api.github.com/users/Sjors/followers",
         "following_url" : "https://api.github.com/users/Sjors/following{/other_user}",
         "gists_url" : "https://api.github.com/users/Sjors/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/Sjors",
         "id" : 10217,
         "login" : "Sjors",
         "node_id" : "MDQ6VXNlcjEwMjE3",
         "organizations_url" : "https://api.github.com/users/Sjors/orgs",
         "received_events_url" : "https://api.github.com/users/Sjors/received_events",
         "repos_url" : "https://api.github.com/users/Sjors/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/Sjors/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/Sjors/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/Sjors"
      }
   }
]
