{
   "assignee" : null,
   "assignees" : [],
   "author_association" : "NONE",
   "body" : "I have a solution to stop big Re-Org attacks that can caused by Selfish Mining Attacks. I'm calling it The Great Wall but name isn't important. Here is the solution;\r\n\r\n>>>\r\nBig financial companies like Visa etc. would do everything they can to stop Bitcoin and altcoins. That includes reorging txs with selfish mining and they can afford it. They could be doing selfish mining right now that continued for days, weeks, months or even years (even it's very unlikely) and their chain might be just 1 block longer than from ours since they might have only just a little bit more Hashing power. The worst part is we can't know this untill they share their chain to network. An attack big like this might have never happen or it might be happening right know, the real thing is we can't be sure. I was thinking about this when I got this idea. Small attacks can hurt but bigger attacks like this can totally fuck up our network. We all know what they can do with months of selfish mining.\r\n\r\n\r\nHow can we protect nodes within decentralized manner?\r\n\r\nWe need to build a wall that rejects changes after every recent 8th block (since we need last 7 blocks to changable due to sync reasons). Here is how it will work;\r\n\r\nWhen a new block added to chain, the recent 8th block (since txs need 7 blocks to be confirmed) should be considered as \"confirmed\" by nodes and all changes that are older than 8 blocks should be automatically rejected. With this, the longer chain (reorganized/corrupted) that shared by Selfish Mining Attacker will be rejected by default by nodes if blocks (or block) that are affected by their attack are older than recent 8th block.\r\n\r\nSince the whole network will get information from nodes with protection, the whole network would consider the chain before attack as the real chain automatically even it's the shorter chain. The longer (reorged) chain that mined with selfish mining will be a (most likely unseccessful) hard fork from Bitcoin if they choose to keep mining it. Network and community can decide that if (reorged) chain is the real chain by changing their nodes manually to reorganized chain. With this we are just actively protecting the pure chain from corrupting by attackers with an automatic protection like a wall without giving up from decentralization. The final decion is always on network and community.\r\n\r\nThis protection is only works if attackers mined more than 8 blocks without sharing with network. It would work if they mine 9 blocks but their chain is only 1 block longer than network has.\r\n\r\n\r\nIsn't dividing the chain bad and risky?\r\n\r\nYes, most of the times but not always, and we don't acually divide the chain on attacks. Attackers will create their own chain instead of changing the networks. Even their fork will be better than Bcahs and other shitcoin hard forks, noone would use it. Also, if noone use their chain, they are most likely to give up from mining and they chain would die.\r\n\r\n\r\nHow is it decentralized if we block/fork the longer chain?\r\n\r\nWe block the info that is shared by Selfish Mining attacker for an active protection. We are not censoring it. Their chain will be still available, nodes and miners can decide it manually. If majority of nodes decide to choose their corrupted chain, their chain would be the real chain and the pure chain would be old chain.\r\n\r\n\r\nHow is this different from Checkpoints?\r\n\r\nCheckpoints saves a copy of history of chain on nodes they are out of our network. This protection is automaticly blocks changes like a wall. \r\n\r\n\r\nWhat would happen to nodes that aren't online 24/7?\r\n\r\nWhen it comes to offline nodes they should connect to real chain when they need to connect to network because (with adoption of this protection) majority of nodes are keeping the healty chain. Only way to their node connect to the corrupted chain is that if attackers have more nodes than the whole network (as far as I know it's way harder than have more hash power on Bitcoin). With having more corrupted nodes attackers attack would be successful.\r\n<<<\r\n\r\nThis was my idea/theory to protect from big Re-Org attacks. Even there is a very little possibility to encounter a big attack like this we need to prevent these from happening. I think it's always better to be safe than sorry. We can argue about potantial new problems this solution can create and try to find a solution to them. We can argue about 8th block rule. I think 8th is the safest number but we can change it to which block majority wants if we need. We can argue everything about this protection.",
   "closed_at" : "2018-12-05T00:57:23Z",
   "closed_by" : {
      "avatar_url" : "https://avatars1.githubusercontent.com/u/548488?v=4",
      "events_url" : "https://api.github.com/users/sipa/events{/privacy}",
      "followers_url" : "https://api.github.com/users/sipa/followers",
      "following_url" : "https://api.github.com/users/sipa/following{/other_user}",
      "gists_url" : "https://api.github.com/users/sipa/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/sipa",
      "id" : 548488,
      "login" : "sipa",
      "node_id" : "MDQ6VXNlcjU0ODQ4OA==",
      "organizations_url" : "https://api.github.com/users/sipa/orgs",
      "received_events_url" : "https://api.github.com/users/sipa/received_events",
      "repos_url" : "https://api.github.com/users/sipa/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/sipa/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/sipa/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/sipa"
   },
   "comments" : 1,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/14871/comments",
   "created_at" : "2018-12-05T00:52:10Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/14871/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/issues/14871",
   "id" : 387544996,
   "labels" : [],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/14871/labels{/name}",
   "locked" : false,
   "milestone" : null,
   "node_id" : "MDU6SXNzdWUzODc1NDQ5OTY=",
   "number" : 14871,
   "repository_url" : "https://api.github.com/repos/bitcoin/bitcoin",
   "state" : "closed",
   "title" : "Protection From Re-Org Attacks",
   "updated_at" : "2018-12-05T00:57:23Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/14871",
   "user" : {
      "avatar_url" : "https://avatars2.githubusercontent.com/u/42880118?v=4",
      "events_url" : "https://api.github.com/users/berkhatipoglu/events{/privacy}",
      "followers_url" : "https://api.github.com/users/berkhatipoglu/followers",
      "following_url" : "https://api.github.com/users/berkhatipoglu/following{/other_user}",
      "gists_url" : "https://api.github.com/users/berkhatipoglu/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/berkhatipoglu",
      "id" : 42880118,
      "login" : "berkhatipoglu",
      "node_id" : "MDQ6VXNlcjQyODgwMTE4",
      "organizations_url" : "https://api.github.com/users/berkhatipoglu/orgs",
      "received_events_url" : "https://api.github.com/users/berkhatipoglu/received_events",
      "repos_url" : "https://api.github.com/users/berkhatipoglu/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/berkhatipoglu/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/berkhatipoglu/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/berkhatipoglu"
   }
}
