{
   "assignee" : null,
   "body" : "By \"paper backup\" I mean what is commonly associated with it:\r\n- To be able to print out the private keys of a wallet, in both human readable and computer readable format\r\n- To include the public keys in human readable and computer readable format, so you can quickly check whether the paper still holds value.\r\n- To be able to import the backup easily.\r\n\r\nBy \"multi\" I mean something similar to \"encrypted\" or \"N-factor authentication\":\r\n- The backup should consist of multiple sheets. It should only be possible to spend the Bitcoins if you have ALL of the sheets. This allows you to keep the backup safe from physical theft by splitting it to different locations.\r\n- Ideally, the amount of sheets should be freely configurable. \r\n- It can be implemented by having a long password for the wallet which is split into equal-sized parts and each sheet containing only one part. This allows the user to destroy one sheet and instead memorize the password which was on it. Then you effectively have an encrypted paper backup as a bonus feature.\r\n\r\nBy \"nested\" I mean something to provide plausible deniability:\r\n- It would be useful to not disclose the number of sheets on each sheet. Then an attacker cannot quickly tell whether he has all of them, and might quit searching for more.\r\n- To prevent the attacker from being able to determine whether he has all sheets, make each sheet represent a complete Bitcoin address, including private key. Fund that address with a decoy amount of Bitcoins.\r\n- Put the random seed used to generate the decoy address on each sheet. But also generate a \"primary\" Bitcoin address whose public/private keys are NOT mentioned on the sheets.\r\n- Instead, the primary key is generated by concatenating the random seeds used for generating the decoy addresses of *all* sheets. Put 90% of the money into the primary address.\r\n- So ALL of the sheets combined would generate the \"actual\" address which holds the most amount of coins. But the attacker would stop trying to search more sheets once he has found one, because it DOES hold money. Just not all of it.\r\n- This could even be raised to a higher level: For each possible N out of M combinations of the sheets, also generate a decoy primary address which holds a little amount of Bitcoins. If the attacker believes that you had used the nesting feature and harasses you to hand out the remaining sheets, you can plausibly claim having given all of them to him, while you only revealed part of the whole.\r\n\r\nEven if the nesting is not implemented at first, I think at least the multi-sheet part is absolutely critical. One of the core advantages of Bitcoin surely is that they cannot be physically stolen because you can encrypt them. This is voided with physical paper backup which isn't split into multiple sheets.\r\n\r\nYou might argue that paper backup doesn't have to be implemented in Bitcoin-Qt because Bitcoin-Armory already supports it somehow. I think backup really should be a core feature of the reference Bitcoin client because it is a core advantage of Bitcoin. You cannot backup dollars. You can backup Bitcoins. \r\n\r\nPlease make the reference Bitcoin client more useful for the very paranoid.\r\n\r\n[Off-topic PS: I'm greedy and proud of the nesting idea, make me happy: 14EpAnasbwpeRH55mQZKX8GjZRnY6DCNsQ :) Admins please mail me if donation requests are not allowed, I will remove it then.]",
   "closed_at" : null,
   "closed_by" : null,
   "comments" : 2,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/3212/comments",
   "created_at" : "2013-11-06T05:26:28Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/3212/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/issues/3212",
   "id" : 22174154,
   "labels" : [
      {
         "color" : "7cf575",
         "name" : "Feature",
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/labels/Feature"
      },
      {
         "color" : "02d7e1",
         "name" : "Wallet",
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/labels/Wallet"
      }
   ],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/3212/labels{/name}",
   "locked" : false,
   "milestone" : null,
   "number" : 3212,
   "repository_url" : "https://api.github.com/repos/bitcoin/bitcoin",
   "state" : "open",
   "title" : "Implement nested multi-paper backup",
   "updated_at" : "2016-01-29T13:11:36Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/3212",
   "user" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/2364130?v=3",
      "events_url" : "https://api.github.com/users/leo-bogert/events{/privacy}",
      "followers_url" : "https://api.github.com/users/leo-bogert/followers",
      "following_url" : "https://api.github.com/users/leo-bogert/following{/other_user}",
      "gists_url" : "https://api.github.com/users/leo-bogert/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/leo-bogert",
      "id" : 2364130,
      "login" : "leo-bogert",
      "organizations_url" : "https://api.github.com/users/leo-bogert/orgs",
      "received_events_url" : "https://api.github.com/users/leo-bogert/received_events",
      "repos_url" : "https://api.github.com/users/leo-bogert/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/leo-bogert/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/leo-bogert/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/leo-bogert"
   }
}
