{
   "assignee" : null,
   "body" : "Many people have different ideas of how to contribute to the system that they use and what contribution means to them.  The fees are only one method whereby someone can provide support to the overall network.  This particular issue suggests that there be indicated or expressed in Bitcoin Core, perhaps below where confirmed transactions are displayed, or in a menu, a question that is expressed, such as \"Would you like to contribute to help the Bitcoin network?\" or some variant thereof.  Potentially this could present options (in a menu dropdown), for example:\r\n- donations of bitcoin (one form of contribution) to a pool where bitcoin developers could opt in or out either totally or on a per commit basis, such as [WhisperSystems / BitHub](https://github.com/WhisperSystems/BitHub)\r\n- contributions of time and energy for Bitcoin (may indicate a suggested area to visit such as the bitcoin/bitcoin repository)\r\n- Other - could default to a site such as [the bitcoin.org participate page](https://bitcoin.org/en/support-bitcoin) - currently titled 'Support Bitcoin'\r\n- Volunteer activities relating to bitcoin which could then be expressed as transactions\r\n\r\nThese are some initial thoughts that are specific to how full client users could be presented with additional options to contribute - from the wallet itself - specifically, in ways that would result in contributions of bitcoin, time, energy, volunteer activity, or other, and at the user's option, make record of that in the transactions area.\r\n\r\nIssue modified based on comments to include the following as suggested elements:\r\n\r\n- options that can be easily generated by users or groups of users, such as the concepts shown in [sx tools](https://github.com/spesmilo/sx/tree/master/tools) in what is described as the charity donations section \r\n\r\n- a feature [similar to that suggested](https://github.com/bitcoin/bitcoin/issues/4079#issuecomment-41010593) by @gmaxwell that would process small change and tiny txouts to user specified donation targets, in an incentivized process. Those running full nodes (Bitcoin Core all the time), processing their change and txouts through Core, would be provided incentives in the form of a 'decentralizing lottery' such that all participants who are running nodes and donating no matter how infrequently (and no matter who they donate to) will be entered in the 'decentralizing lottery,' the 'award amounts' (which would be distinct from 'block rewards' for any mining) would vary from small to large bitcoin amounts depending on how many participants are involved in the donations process. This would help incentivize individuals to run full nodes as well as encouraging giving and microdonations. The option could be expressed in the transactions area to contribute to help bitcoin core development for those that are setting up change and txouts for donations, regarding the microdonation portion (which has also has been expressed conceptually at [abis.io](http://abis.io)\r\n\r\n- The simplest implementation of this idea has individuals benefiting from running full nodes and performing microdonations, but more could be done. Depending on how this is implemented, it could work in such a way that individuals running full nodes (Bitcoin Core) are increasingly incentivized, or, in which miners are incentivized to give hashing power away (ensuring decentralization continues) in the form of smart property as microdonations (where the incentive would be the possibility of miners receiving 'award amounts.')  The smart property representing the mining or hashing power would be distributed throughout the network.  In the latter case, the 'award amounts' of bitcoin associated with the 'decentralizating lottery' described above could increase as mining becomes more concentrated or centralized, thus creating a disincentive for ongoing centralization and a greater incentive for decentralization via microdonations.",
   "closed_at" : "2014-06-15T14:57:23Z",
   "closed_by" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/331997?v=3",
      "events_url" : "https://api.github.com/users/gavinandresen/events{/privacy}",
      "followers_url" : "https://api.github.com/users/gavinandresen/followers",
      "following_url" : "https://api.github.com/users/gavinandresen/following{/other_user}",
      "gists_url" : "https://api.github.com/users/gavinandresen/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/gavinandresen",
      "id" : 331997,
      "login" : "gavinandresen",
      "organizations_url" : "https://api.github.com/users/gavinandresen/orgs",
      "received_events_url" : "https://api.github.com/users/gavinandresen/received_events",
      "repos_url" : "https://api.github.com/users/gavinandresen/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/gavinandresen/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/gavinandresen/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/gavinandresen"
   },
   "comments" : 21,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/4079/comments",
   "created_at" : "2014-04-22T06:41:15Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/4079/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/issues/4079",
   "id" : 31949007,
   "labels" : [
      {
         "color" : "7cf575",
         "name" : "Feature",
         "url" : "https://api.github.com/repos/bitcoin/bitcoin/labels/Feature"
      }
   ],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/4079/labels{/name}",
   "locked" : false,
   "milestone" : null,
   "number" : 4079,
   "repository_url" : "https://api.github.com/repos/bitcoin/bitcoin",
   "state" : "closed",
   "title" : "Option to Contribute - Indicate in Bitcoin Core [Incentivizing Giving, Adding Smart Property Element]",
   "updated_at" : "2014-09-30T07:45:47Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/4079",
   "user" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/4469280?v=3",
      "events_url" : "https://api.github.com/users/ABISprotocol/events{/privacy}",
      "followers_url" : "https://api.github.com/users/ABISprotocol/followers",
      "following_url" : "https://api.github.com/users/ABISprotocol/following{/other_user}",
      "gists_url" : "https://api.github.com/users/ABISprotocol/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/ABISprotocol",
      "id" : 4469280,
      "login" : "ABISprotocol",
      "organizations_url" : "https://api.github.com/users/ABISprotocol/orgs",
      "received_events_url" : "https://api.github.com/users/ABISprotocol/received_events",
      "repos_url" : "https://api.github.com/users/ABISprotocol/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/ABISprotocol/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/ABISprotocol/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/ABISprotocol"
   }
}
