[
   {
      "body" : "Bitcoin Core's maintainers do not, and do not want to, decide what the network's rules are. If there is widespread agreement about a change, it will be merged. But if you want to rally for such a change, the correct place is in public fora that involve the whole community, not on the issue tracker of just one software project.\n\nAs far as several individual contributors (including myself) are concerned, we have gone through a large scale effort to bring a capacity increase in a safe and backward-compatible way, known as SegWit. At this point it is out of our hands and up to the community to adopt it. This is a complicated issue for everyone, but please don't accuse people of inaction.",
      "created_at" : "2017-03-18T19:11:50Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/10028#issuecomment-287567873",
      "id" : 287567873,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/10028",
      "updated_at" : "2017-03-18T20:58:56Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/287567873",
      "user" : {
         "avatar_url" : "https://avatars2.githubusercontent.com/u/548488?v=3",
         "events_url" : "https://api.github.com/users/sipa/events{/privacy}",
         "followers_url" : "https://api.github.com/users/sipa/followers",
         "following_url" : "https://api.github.com/users/sipa/following{/other_user}",
         "gists_url" : "https://api.github.com/users/sipa/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/sipa",
         "id" : 548488,
         "login" : "sipa",
         "organizations_url" : "https://api.github.com/users/sipa/orgs",
         "received_events_url" : "https://api.github.com/users/sipa/received_events",
         "repos_url" : "https://api.github.com/users/sipa/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/sipa/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/sipa/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/sipa"
      }
   },
   {
      "body" : "Well when an issue effects the security of the chain, historically maintainers have had to fork. Bitcoin has certainly been hard forked in the past . Segwit is not a viable solution because settlement networks such as lightning lead to centralization because they either A: force users to deposit with extremely rich holders of coins so more settlements can be made without owing funds or B: funds are connecting two multisig accounts with two asymmetrical  Poon-Dryja channels. The problem with the 2nd scenario is that it runs serious security threats because when you use hash time locked contracts to link unrelated multisignature accounts with funds that are not held by the intermediate party, then the one routing the payment can simply collude and double spend (because they can secretly pose as transferor and channel via collusion). A channel which is highly centralized can be hacked and the hacker may default on any payments owed. This collusion and hacking can only be prevented by forcing users to deposit their 2 of 2 with very rich holders or constantly clear payments when they are owed funds(which may not necessarily reduce bloat at all) not to mention problems with getting disconnected and not being able to clear payments before expiry of the time lock. All of these are messy and seriously risky security threats with the only solution being a centralized one aka trusting the ultra wealthy or perhaps constantly settling payments. So no, Segwit doesn't solve the issue. Plus, because its elective, many Bitcoiners will choose not to deposit into channels and still bloat the chain especially in a year or two when network size doubles again.\r\n\r\nThe \"community\" will never be in agreement because humans never reach consensus on anything especially when there are more than 2 options. You and others are making this issue about yourselves via inaction and thus making it a political issue. Small and healthy changes to the network are not complex issues, stop pretending they are. I'm not using github as a \"forum\" or sounding board. This is in fact a security issue and therefore deserves to be reported. Please don't misconstrue my issue that was raised. Furthermore consumers and users of Bitcoin are **not gifted coders** such as us devs and aren't adept at making decisions. We are however because we code daily for a living and we can reach consensus via open discussion. I've posted on forums and places such reddit and have not gotten viable feedback(in fact I get viciously down-voted and lose reddit Karma whenever I bring up technical issues). The news will never reach consensus as they get their information through the wire. So I realize the best way is to approach you all directly. The silent majority wants and needs github to make security fixes. Namely bip 100 which is a dynamic solution to block size which relies on votes or as you put it \"the community\". The miners are the ones investing hard ware and electricity and this solution is the best of both worlds. You cannot ignore the greatest current security threat to Bitcoin and eventually you must allow and embrace change. Otherwise all of you are guilty of inaction. Please make the right decision you all know in your heart to be true and do not centralize this github. Not all contributors to Bitcoin are in agreement. Don't brush devs off by closing issues that are in fact bugs as small block size is a bug not a feature. Please reconsider and reopen this issue.",
      "created_at" : "2017-03-19T00:27:54Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/10028#issuecomment-287585204",
      "id" : 287585204,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/10028",
      "updated_at" : "2017-03-19T00:48:33Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/287585204",
      "user" : {
         "avatar_url" : "https://avatars1.githubusercontent.com/u/7565265?v=3",
         "events_url" : "https://api.github.com/users/dzimbeck/events{/privacy}",
         "followers_url" : "https://api.github.com/users/dzimbeck/followers",
         "following_url" : "https://api.github.com/users/dzimbeck/following{/other_user}",
         "gists_url" : "https://api.github.com/users/dzimbeck/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/dzimbeck",
         "id" : 7565265,
         "login" : "dzimbeck",
         "organizations_url" : "https://api.github.com/users/dzimbeck/orgs",
         "received_events_url" : "https://api.github.com/users/dzimbeck/received_events",
         "repos_url" : "https://api.github.com/users/dzimbeck/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/dzimbeck/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/dzimbeck/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/dzimbeck"
      }
   }
]
