{
   "assignee" : null,
   "assignees" : [],
   "author_association" : "NONE",
   "body" : "Before anything, I've read all of the other posts about this topic. It includes \"extra indexes\", \"txIndexes\", \"block explorers\" and some other topics. English is not my native language, but I will try my best. \r\n\r\n**Resume of the issue:** Node software does not contain an alternative to index all the Blockchain data.\r\n**What I think that could solve the issue:** Implement an option to include the extra indexes, and implement new RPC calls in case of this extra indexes exists. Make a RPC Block Explorer.\r\n**Why you should do that instead of others**: Because it would be easier for you to make it and everybody uses your software. \r\n\r\n**Why I think this is important:**\r\n\r\nEvery time a someone sends Bitcoins from one address to another, they take a look at a Block Explorer to see if the transaction has actually worked fine. It does not matter the value of the transaction because it feels like you are getting a \"payment voucher\" (the ticket that you received after paying for something containing some details about the transaction). It happens a lot. \r\n\r\nThe issue is that all of this Block Explorers are \"visions\" of the blockchain. None of them actually IS the blockchain, and none of them should be used like it is blockchain. And unfortunately a huge number of dev's relay on the public APIs from services like Blockchain.info and Blockcypher. They cannot avoid that, since deploying a personal block explorer - even for a independent \"vision\" of the blockchain - requires a lot of work in a lot of different environments. \r\n\r\nIf one of this services lies to us for any reason, we have to believe them. And even if we try to use multiple services, we are restricted to a very feel number of them.\r\n\r\nAnd there is more. \r\n\r\nImagine this: nodes have a very small incentive to keep them running. The blockchain is getting bigger, the number of transactions is exponentially increasing. This \"vision of the truth\" factor sounds pretty seductive (aka lucrative). I'm not saying that this already happened, but I'm afraid that it might happen. Internet hooligans are there, and every developer - especially financial related developers -  should be afraid of them. \r\n\r\nI wrote an article in Portuguese about the risk of a correlation attack to identify a wallet owner, especially on countries that have a \"tuff government\". Most of the people do not run their wallets directly from the node, so we can track down an IP address that has used the block explorer and link it to the owner. I know that Bitcoin is not about privacy (not directly, like Monero, ZCash..), but even this Zero-Knowledge Proofs are tricky if you access them from your PC.  The Onion support is awesome but partially inefficient against this issue.  \r\n\r\nI'm not sure if you guys can understand my concern. We are constantly receiving news about wallets from Blockchain.info being hacked (even if the 2FA is enabled). It makes me worry even more. \r\n\r\nThe solution, in my point of view, is to unleash all the power that the blockchain data already have. I run a full node at home - on a singular blade server for research purpose - and it would be awesome if I can index all the data so that I can see what is going on. And I'm not even saying anything about a Web UI to allow people to publish their nodes (although I can draw a particularly beautiful one for you if you want - I hate Insights). Just the RPC calls would solve most of the problems. \r\n\r\nThanks for your time.\r\n \r\n",
   "closed_at" : "2018-03-06T20:17:02Z",
   "closed_by" : {
      "avatar_url" : "https://avatars2.githubusercontent.com/u/863730?v=4",
      "events_url" : "https://api.github.com/users/fanquake/events{/privacy}",
      "followers_url" : "https://api.github.com/users/fanquake/followers",
      "following_url" : "https://api.github.com/users/fanquake/following{/other_user}",
      "gists_url" : "https://api.github.com/users/fanquake/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/fanquake",
      "id" : 863730,
      "login" : "fanquake",
      "organizations_url" : "https://api.github.com/users/fanquake/orgs",
      "received_events_url" : "https://api.github.com/users/fanquake/received_events",
      "repos_url" : "https://api.github.com/users/fanquake/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/fanquake/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/fanquake/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/fanquake"
   },
   "comments" : 3,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/11810/comments",
   "created_at" : "2017-12-01T12:48:51Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/11810/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/issues/11810",
   "id" : 278456548,
   "labels" : [],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/11810/labels{/name}",
   "locked" : false,
   "milestone" : null,
   "number" : 11810,
   "repository_url" : "https://api.github.com/repos/bitcoin/bitcoin",
   "state" : "closed",
   "title" : "Block Explorers should be included (as optional)!",
   "updated_at" : "2018-03-06T20:17:02Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/11810",
   "user" : {
      "avatar_url" : "https://avatars3.githubusercontent.com/u/3607502?v=4",
      "events_url" : "https://api.github.com/users/davimello28/events{/privacy}",
      "followers_url" : "https://api.github.com/users/davimello28/followers",
      "following_url" : "https://api.github.com/users/davimello28/following{/other_user}",
      "gists_url" : "https://api.github.com/users/davimello28/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/davimello28",
      "id" : 3607502,
      "login" : "davimello28",
      "organizations_url" : "https://api.github.com/users/davimello28/orgs",
      "received_events_url" : "https://api.github.com/users/davimello28/received_events",
      "repos_url" : "https://api.github.com/users/davimello28/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/davimello28/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/davimello28/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/davimello28"
   }
}
