[
   {
      "body" : "@dooglus I originally played around with slightly \"smarter\" fee algorithms that started at the most expensive bucket but looked for the point of no return so to speak where the confirmation percentage dropped below the threshold never to return.  Every permutation I tried seemed susceptible to not being ideal in some particular circumstance or gameable, so it seemed better to err on the side of simpler.\r\n\r\nAs for starting from the cheapest bucket, we can't do that because then the gaming you posited could potentially happen in reverse causing the fee estimates of all targets above some minimum to become useless if a miner was indiscriminately including things in that low fee range.  For instance perhaps these are paid for out of band or were being confirmed by priority or some other mechanism..\r\n\r\nThe change from 85% to 95% was motivated by a desire to respond more quickly to changes in market conditions.  It's quite typical for there to be popular buckets that get tons of data points.  If for instance 97% of transactions in the 40 sat/byte bucket are being confirmed within 2 blocks and all of a sudden the mempool fills up and none get confirmed.  It could take many hours for the confirmation rate to drop below 85% especially because people will adjust quicker and stop giving new failing data points at that fee rate.\r\n\r\nIn general the fee estimation algorithm in Core is meant to be conservative.  It's the fee you should put on your transaction if you really want to be very sure your transaction will confirm in that target.  You can always see how much money you would save by selecting a longer target and realizing that you are likely to be confirmed sometime within that range, not necessarily at the end of it.  I would recommend never ever using 1 as a target.  \r\n\r\nAll that said, it is an art more than a science, and I welcome interest in people trying to improve it.\r\n",
      "created_at" : "2016-11-08T21:36:15Z",
      "html_url" : "https://github.com/bitcoin/bitcoin/issues/9106#issuecomment-259267172",
      "id" : 259267172,
      "issue_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/9106",
      "updated_at" : "2016-11-08T21:36:15Z",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/comments/259267172",
      "user" : {
         "avatar_url" : "https://avatars.githubusercontent.com/u/4360349?v=3",
         "events_url" : "https://api.github.com/users/morcos/events{/privacy}",
         "followers_url" : "https://api.github.com/users/morcos/followers",
         "following_url" : "https://api.github.com/users/morcos/following{/other_user}",
         "gists_url" : "https://api.github.com/users/morcos/gists{/gist_id}",
         "gravatar_id" : "",
         "html_url" : "https://github.com/morcos",
         "id" : 4360349,
         "login" : "morcos",
         "organizations_url" : "https://api.github.com/users/morcos/orgs",
         "received_events_url" : "https://api.github.com/users/morcos/received_events",
         "repos_url" : "https://api.github.com/users/morcos/repos",
         "site_admin" : false,
         "starred_url" : "https://api.github.com/users/morcos/starred{/owner}{/repo}",
         "subscriptions_url" : "https://api.github.com/users/morcos/subscriptions",
         "type" : "User",
         "url" : "https://api.github.com/users/morcos"
      }
   }
]
