{
   "assignee" : null,
   "body" : "A while back I started looking at bitcoin, and I was disappointed with the code quality wrt locking.\r\n\r\nI tried to fix the code to be clang -Wthread-safety clean, but I don't know the code enough to understand some of the entanglements that are currently present.\r\n\r\nI've added lots of annotations that specifies the locking requirements on functions and data.  This might seem a little overzealous, but I believe that this is necessary to \"get back on track\" and make the locking strategy clear and consistent.\r\n\r\nEven with this patch there are lots of locking issues left - probably benign like things happening during startup and shutdown.   There are also false positives from me not getting clang to grok TRY_LOCK correctly.\r\n\r\nBelow is a long note I wrote while looking through the source code a while back.  Maybe you guys agree or maybe not - at least it explains the whats and the whys.\r\n\r\n---\r\n\r\nFor an object that is accessed by multiple threads we have, for every field:\r\n- It is const, constant after initialization, or guarded by a mutex.\r\n\r\n- Re-using an object is a *bad idea*.  It should never be done. If we\r\n  do, we are mutating the constant-after-initialization fields.  This\r\n  leads to exessive locking and overcomplicated code.  It is a lot\r\n  simpler to discard the object and re-create it.  This works, because\r\n  the object is owned by some other object, and in that other object,\r\n  it is a \"guarded by mutex\" field.  Thus by re-creating the object,\r\n  we lift the responsibility for locking into the parent.\r\n\r\n- A result of the above is that \"constructors\" must be separate from\r\n  other functions in the class.  Constructors that are not strictly\r\n  C++ constructors, such as deserializing should be static functions\r\n  if possible.  This makes it impossible for them to to be used to\r\n  mutate constant-after-initialization fields.\r\n\r\n- Locks should not be exported outside of a class.  Java did this\r\n  mistake and it is considered an anti-pattern.\r\n\r\n- Locks should never serialize code, they should protect data from\r\n  being accessed while invariants on that data are broken.\r\n\r\n- Locks should be textually close to the fields.  Given a lock, it\r\n  should be easy to understand what it guards, and given a field, it\r\n  should be easy to see which locks guard that field.\r\n  Thus, locks should be private members of a class.\r\n\r\n  A good way to obfuscate this is to put a lock in a parent class, as\r\n  done in keystore.h where CKeyStore.  It is hard to know what that\r\n  lock guards.  It is a lot cleaner to duplicate that lock in the data\r\n  section of the subclasses.\r\n\r\n- Recursive locks should never be used.  They lead to bugs, and are\r\n  *only* necessary in order to write sloppy code.  If some functionality\r\n  is both a transaction that ensures that the invariants of the data are\r\n  obeyed, and part of larger transactions, then it is much clearer to\r\n  separate these conserns into two functions:\r\n\r\n  void DoFoo() {\r\n     LOCK(cs);\r\n     DoFooUnlocked();\r\n  }\r\n  void DoFooUnlocked() { ... }\r\n\r\n- Using locks to protect simple setters and getters is often buggy\r\n  and/or complex.  In most cases, mutating some state is part of a\r\n  larger transaction, so the setter is often protected by some other\r\n  lock external to the class.  In these cases, re-building a new\r\n  object is usually the best approach, but otherwise, explicitly\r\n  marking setters as SetFooUnlocked() and not lock is clearer.  It\r\n  makes it explicit that you can't just mutate randomly without doing\r\n  some external locking.\r\n\r\n- Do not hold locks over callbacks out of an object.  This means that\r\n  objects should *signal* some state change, and not guarantee which\r\n  state the object is in when a callback happens.  Sometimes, it makes\r\n  sense to break this, but then the callback will have to be treated\r\n  like a signal handler, or irq handler - i.e. it can only do simple\r\n  things and not call out to other random code.\r\n\r\n- Every time you call TRY_LOCK, a kitten dies.  The reason why this is\r\n  bad is that it makes reasoning, and testing the code incredibly\r\n  hard.  TRY_LOCK is basically this:\r\n\r\n    if (rand() % 1) {\r\n      DoA();\r\n    } else {\r\n      DoB();\r\n    }\r\n\r\n  It is simply unnecessary randomness. The TRY_LOCK macro should be\r\n  removed, it kills kittens.\r\n\r\n  If something like TRY_LOCK is truly needed, then at least it should\r\n  be abstracted out of the actual functions, so that the functions\r\n  themselves are testable.  Thus in the above case, DoA() would be a\r\n  separate, testable, function.\r\n\r\n  In some really large systems (millions of large tps), sharding work\r\n  queues by lock is a reasonable design to reduce resource usage by\r\n  threads (so you do cs_someLock.DoWorkNowOrWhenUnlocked(&DoA), and it\r\n  is more efficient than TRY_LOCK, but for bitcoin - this is just\r\n  overkill.\r\n\r\n- Having lots of semantically different locks in a class is not ideal.\r\n  For example CNode has 4 locks.  This means that there are 4 sets of\r\n  invariants that can be established independently of each other in\r\n  this class.  To put it another way, when you call a function on this\r\n  object, it should work on a subset of the state, or it should hold\r\n  all 4 locks.  This suggests that either the class is a composite of\r\n  multiple objects, and should be broken up, or the number of locks\r\n  should be reduced.\r\n\r\n- We cannot compose multiple critical sections which all take a lock\r\n  into a large critical section.  After we have released locks, all\r\n  checks that we have done are invalidated.  Most of CWallet is just\r\n  plain wrong and based on this false assumption.  Locking is done in\r\n  CCryptoKeyStore instead of in CWallet.  See above \"Locks should be\r\n  textually close to the fields\" for a reason why people confuse\r\n  themselves.\r\n\r\n- There is a lot of convoluted code like this:\r\n        bool result;\r\n        {\r\n            LOCK(cs_KeyStore);\r\n            result = (mapKeys.count(address) > 0);\r\n        }\r\n        return result;\r\n\r\n   which is equivalent to this:\r\n\r\n        LOCK(cs_KeyStore);\r\n        return (mapKeys.count(address) > 0);\r\n\r\n   The destructor is guaranteed to run after the expression is\r\n   evaluated.  There is no need to over-engineer.\r\n\r\n   Similarly, there is a lot of code like this:\r\n\r\n    void SomeFunction(...)\r\n    {\r\n        something();\r\n        {\r\n            LOCK(cs_something);\r\n            ...\r\n        }\r\n    }\r\n\r\n    or this:\r\n    void SomeFunction(...)\r\n    {\r\n        {\r\n            LOCK(cs_something);\r\n            .. rest of function ...\r\n        }\r\n        return false;\r\n    }\r\n\r\n   There is no point in all the excessive blocks.  What are they for?\r\n\r\n",
   "closed_at" : "2012-11-11T03:36:41Z",
   "closed_by" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/339369?v=3",
      "events_url" : "https://api.github.com/users/alexanderkjeldaas/events{/privacy}",
      "followers_url" : "https://api.github.com/users/alexanderkjeldaas/followers",
      "following_url" : "https://api.github.com/users/alexanderkjeldaas/following{/other_user}",
      "gists_url" : "https://api.github.com/users/alexanderkjeldaas/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/alexanderkjeldaas",
      "id" : 339369,
      "login" : "alexanderkjeldaas",
      "organizations_url" : "https://api.github.com/users/alexanderkjeldaas/orgs",
      "received_events_url" : "https://api.github.com/users/alexanderkjeldaas/received_events",
      "repos_url" : "https://api.github.com/users/alexanderkjeldaas/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/alexanderkjeldaas/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/alexanderkjeldaas/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/alexanderkjeldaas"
   },
   "comments" : 5,
   "comments_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/1995/comments",
   "created_at" : "2012-11-09T18:37:41Z",
   "events_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/1995/events",
   "html_url" : "https://github.com/bitcoin/bitcoin/pull/1995",
   "id" : 8248110,
   "labels" : [],
   "labels_url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/1995/labels{/name}",
   "locked" : false,
   "milestone" : null,
   "number" : 1995,
   "pull_request" : {
      "diff_url" : "https://github.com/bitcoin/bitcoin/pull/1995.diff",
      "html_url" : "https://github.com/bitcoin/bitcoin/pull/1995",
      "patch_url" : "https://github.com/bitcoin/bitcoin/pull/1995.patch",
      "url" : "https://api.github.com/repos/bitcoin/bitcoin/pulls/1995"
   },
   "state" : "closed",
   "title" : "Large locking change",
   "updated_at" : "2012-11-11T03:36:41Z",
   "url" : "https://api.github.com/repos/bitcoin/bitcoin/issues/1995",
   "user" : {
      "avatar_url" : "https://avatars.githubusercontent.com/u/339369?v=3",
      "events_url" : "https://api.github.com/users/alexanderkjeldaas/events{/privacy}",
      "followers_url" : "https://api.github.com/users/alexanderkjeldaas/followers",
      "following_url" : "https://api.github.com/users/alexanderkjeldaas/following{/other_user}",
      "gists_url" : "https://api.github.com/users/alexanderkjeldaas/gists{/gist_id}",
      "gravatar_id" : "",
      "html_url" : "https://github.com/alexanderkjeldaas",
      "id" : 339369,
      "login" : "alexanderkjeldaas",
      "organizations_url" : "https://api.github.com/users/alexanderkjeldaas/orgs",
      "received_events_url" : "https://api.github.com/users/alexanderkjeldaas/received_events",
      "repos_url" : "https://api.github.com/users/alexanderkjeldaas/repos",
      "site_admin" : false,
      "starred_url" : "https://api.github.com/users/alexanderkjeldaas/starred{/owner}{/repo}",
      "subscriptions_url" : "https://api.github.com/users/alexanderkjeldaas/subscriptions",
      "type" : "User",
      "url" : "https://api.github.com/users/alexanderkjeldaas"
   }
}
